[
  { "id": 1, "text": "🗣️ 店員を呼ぶ時、躊躇なく大声で「すみませーん！」と叫べそう。周りの客が振り向くレベルの声量を出しがち。", "axes": { "E_I": 1 } },
  { "id": 2, "text": "🤫 沈黙が続くと、すぐ「最近何か面白いことあった？」と聞きがち。沈黙に耐えられず、何でもいいから話題を投げ込みがち。", "axes": { "E_I": 1, "Fickle": 1 } },
  { "id": 3, "text": "🤣 自分のプライベート話を聞かれてもいないのに、話始めて自分で爆笑しがち。周りがついていけてないことに気づかないがち。", "axes": { "E_I": 1, "Approval": 1 } },
  { "id": 4, "text": "📋 旅行に一緒に行く際、かなり細かく計画を練りがち。集合時間どころか、何時何分にどの電車に乗るかまで決めてそう。", "axes": { "J_P": 1 } },
  { "id": 5, "text": "📱 LINEで3つ質問したのに、一番最後の話題だけ拾って返信してきがち。残りの2つは華麗にスルーされがち。", "axes": { "J_P": 1 } },
  { "id": 6, "text": "🚃 電車で、降車駅のエスカレーターに一番近いドアを狙って乗車位置を計算しがち。ホームの案内図を一瞬で暗記してそう。", "axes": { "J_P": 1 } },
  { "id": 7, "text": "💇 会うたびに髪がサロン帰りみたいにキマっていて、寝起きや適当な髪を見た記憶がないがち。雨の日でも前髪が崩れないガチ勢っぽいがち。", "axes": { "J_P": 1 } },
  { "id": 8, "text": "🔄 予定が急に変更になっても、「あ、じゃあこっち行こ」と即座に切り替えがち。予定変更のダメージがゼロに見えがち。", "axes": { "J_P": -1 } },
  { "id": 9, "text": "🔒 インスタのアカウントが頑なに「鍵垢」設定になっていがち。フォロリクを送っても数日放置されがち。", "axes": { "Obsession": 1 } },
  { "id": 10, "text": "💰 「1億円当たったら何する？」という話に、「そんな夢話より今月の家賃どうすんの」と現実を突きつけてきがち。妄想に一切付き合ってくれなさそう。", "axes": { "S_N": 1 } },
  { "id": 11, "text": "👜 持ち物は必要最小限のミニバッグ派で、「これ一つで十分」と言い切りがち。荷物の少なさに毎回驚かされがち。", "axes": { "S_N": 1 } },
  { "id": 12, "text": "🛍️ 持ち物はデザインより機能性重視。「結局ユニクロが最強」と本気で思ってそう。ブランドものに一切興味なさそうなオーラを放ちがち。", "axes": { "S_N": 1 } },
  { "id": 13, "text": "👊 ただ聞いてほしくて愚痴っているのに、「要するにこうすればよくない？」とクソデカ正論パンチをかましてきて余計に腹立たせがち。", "axes": { "T_F": 1 } },
  { "id": 14, "text": "🙏 お願いする時、理屈よりも「お願いぃぃ！死ぬほど！」という熱意に弱そう。ゴリ押しされると断れないタイプに見えがち。", "axes": { "T_F": -1, "Emotion": 1 } },
  { "id": 15, "text": "🎬 ド素人なのに、映画の感想が「泣いた」とかじゃなく、「脚本の構成がさぁ…」と分析モードに入りがち。一緒に余韻に浸れないタイプっぽいがち。", "axes": { "T_F": 1 } },
  { "id": 16, "text": "💬 LINEの文面が「了解。」「着いた。」など句読点だらけで、上司からの業務連絡みたいな冷酷さを放ちがち。絵文字を使わない美学がありそう。", "axes": { "T_F": 1 } },
  { "id": 17, "text": "👀 インスタで色々な異性のアイドルや俳優を大量にフォローしていがち。タイプを聞くと「いや、顔は関係ない」と嘘つきがち。", "axes": { "Fickle": 1 } },
  { "id": 18, "text": "❤️‍🔥 特定のアイドルや芸能人の「推し」を一途にずっと追いかけていがち。推し変した人を裏切り者扱いしそう。", "axes": { "Obsession": 1 } },
  { "id": 19, "text": "📸 インスタに投稿している写真と、現実の姿にかなりの差がありがち。「加工じゃないし、光の加減」と言い張りがち。", "axes": { "Approval": 1 } },
  { "id": 20, "text": "🔮 日常の出来事にやたらと「意味」を見出しがち。「今日カラス3羽見たんだけど、これ絶対なんかのサインだよね」とか本気で言いがち。", "axes": { "S_N": -1 } },
  { "id": 21, "text": "🏠 「今日飲み行かない？」と誘っても、「今日はちょっと…」と断りがち。後でSNS見たら家でNetflix観てただけだったりしがち。", "axes": { "E_I": -1 } },
  { "id": 22, "text": "🤳 SNSで自分の写真（自撮りなど）の投稿が異様に多めがち。アングルと照明へのこだわりがプロ級に見えがち。", "axes": { "Approval": 1 } },
  { "id": 23, "text": "🍽️ フォロワー50人なのに、やたらと凝ったグルメアカウントを運用していがち。ラーメンの写真にまで一眼使ってそう。", "axes": { "Approval": 1 } },
  { "id": 24, "text": "😢 嫌なことがあるとすぐに泣く、あるいはすぐに拗ねて周囲の気を引こうとしがち。「もういい」が口癖になってそう。", "axes": { "Emotion": 1 } },
  { "id": 25, "text": "🙌 カフェでもファミレスでも身振り手振りが大げさすぎて、隣のテーブルの人がチラチラ見てきがち。感情が腕の振りに全部出るタイプっぽいがち。", "axes": { "E_I": 1 } },
  { "id": 26, "text": "⏰ 集合時間の3分前に「ごめん、あと10分！」とLINEしてきがち。しかもその10分が大体20分になりがち。", "axes": { "J_P": -1 } },
  { "id": 27, "text": "💥 説明する時「バーンとなって！」「ガーッとやって！」みたいな擬音語が多すぎて、結局何が言いたいのか伝わってないがち。", "axes": { "S_N": 1 } },
  { "id": 28, "text": "🤝 昨日あれだけガチ喧嘩したのに、翌日ケロッと「ランチ行かない？」と何事もなかったように話しかけてきがち。こっちがまだ怒ってることに気づかないがち。", "axes": { "T_F": 1 } },
  { "id": 29, "text": "😊 複数人の集まりでは、自ら話題を振ることはなく、ニコニコと「へえ〜！」「そうなんだ！」と相槌を打つだけの置物になりがち。帰り道が一番リラックスしてそう。", "axes": { "E_I": -1 } },
  { "id": 30, "text": "🍔 「何食べたい？」と聞かれて「なんでもいいよ」と言ったくせに、こちらが提案した店は微妙な顔で却下しがち。結局「なんでもいい」が一番面倒くさいがち。", "axes": { "Emotion": 1, "J_P": -1 } },
  { "id": 31, "text": "🎧 友達と遊んでる最中でも、急にスマホいじり出したり、イヤホン片耳つけて自分の世界に入りがち。集まりの途中で「ごめん、先帰るわ」と早めに離脱しがち。", "axes": { "E_I": -1 } },
  { "id": 32, "text": "🌌 「もし宇宙人が来たら何する？」みたいな突拍子もない妄想に本気で乗ってきがち。しかもめっちゃ設定が細かくて、30分くらい語れるがち。", "axes": { "S_N": -1 } },
  { "id": 33, "text": "📱 別れた相手の話題が出ると急に黙ったり、共通の友達にさりげなく近況を聞き出しがち。「もう全然気にしてない」と言いつつ、めちゃめちゃ気にしてそう。", "axes": { "Obsession": 1 } },
  { "id": 34, "text": "🎣 新しい趣味を見つけたら道具一式揃えるけど、3ヶ月で飽きて押入れ行きがち。部屋が使われないグッズの博物館になっていがち。", "axes": { "Fickle": 1 } },
  { "id": 35, "text": "📺 感動系CMとか犬猫の動画見ただけで涙腺崩壊しがち。「泣いてないし」って言いながら目が真っ赤がち。", "axes": { "Emotion": 1 } },
  { "id": 36, "text": "🤝 友達の恋愛相談に「わかるぅ〜」「辛いよね〜」しか言えず、具体的なアドバイスは何一つしてないがち。共感だけで60分消費しがち。", "axes": { "T_F": -1 } },
  { "id": 37, "text": "👑 推し活で古参マウント取りがち。「いや私〇〇の頃から推してるから」が口癖で、新規ファンをちょっと見下していがち。", "axes": { "Obsession": 1, "Approval": 1 } },
  { "id": 38, "text": "🎨 「この雲、なんかドラゴンに見えない？」とか、他の人が全く共感できない独自の世界観を突然展開しがち。本人はめちゃくちゃ楽しそうなのが余計に謎がち。", "axes": { "S_N": -1 } },
  { "id": 39, "text": "🛏️ 嫌なことがあった日は、グループLINEから急に無言になって、SNSも無音で消えがち。数日後にケロッと復活して何事もなかったかのように振る舞いがち。", "axes": { "E_I": -1, "Emotion": 1 } },
  { "id": 40, "text": "✨ 「前世は絶対に貴族だった」とか、スピリチュアル系の話をわりとガチで信じてそう。タロット占いアプリ入ってそうだし、水星逆行の時期を把握してそう。", "axes": { "S_N": -1 } },
  { "id": 41, "text": "🧊 カバンの中身やデスクの配置にこだわりがあって、勝手に触られると無言でキレるタイプ。持ち物の定位置が完全に決まってそう。", "axes": { "J_P": 1, "Obsession": 1 } },
  { "id": 42, "text": "😭 映画やドラマで泣いた後、わざわざ「やばい、また泣いちゃった〜」とアピールしがち。泣ける自分が好きそうなオーラを全開で放ちがち。", "axes": { "T_F": -1, "Approval": 1 } },
  { "id": 43, "text": "📱 「最近ハマってるもの」を聞くたびに毎回答えが変わりがち。先月は筋トレ、今月はカフェ巡り、来月は多分また別の何かにハマってそう。", "axes": { "Fickle": 1 } },
  { "id": 44, "text": "👀 気になる人のインスタ投稿にいいね速度が異常に早いがち。ストーリー上げた瞬間に足跡ついてて、もはや監視レベルの反応速度を見せがち。", "axes": { "Obsession": 1 } },
  { "id": 45, "text": "😏 自分のツッコミがグループで大ウケした時、すかさず追いツッコミをかぶせて二匹目のどじょうを狙いにいきがち。スベった時の愛想笑いが痛々しいがち。", "axes": { "E_I": 1, "Approval": 1 } }
]
