{
  "INTJ": {
    "name": "ラグジュアリー猫",
    "emoji": "cat",
    "tagline": "知的で気高い、都会のミステリアスな存在",
    "traits": ["知的好奇心が強い", "独立心が高い", "完璧主義", "戦略的思考"],
    "description": "一見クールで近寄りがたい雰囲気を持ちながら、内面には深い知性と情熱を秘めている。自分の世界観を大切にし、無駄な付き合いはしない主義。でも心を開いた相手にはとことん深い愛情を注ぐ。",
    "advice": {
      "teens": {
        "date": "放課後の図書館で一緒に勉強するデートが最強。テスト前に「教えて」と頼ると、嬉しそうに解説してくれるはず。学校の文化祭では、裏方の企画や装飾にこだわるタイプなので、一緒に準備するのもアリ。帰り道に少しだけ遠回りして、星が見える場所に連れ出してみて。",
        "hidden": "実は誰よりも承認欲求が強い。テストで1位を取っても「別に」と言いつつ、内心ではめちゃくちゃ嬉しい。本当は寂しがり屋で、自分から誘えないだけ。LINEの既読スルーは「どう返そうか考えてる」だけだったりする。",
        "attractive": "相手の話を遮らず最後まで聞くこと。「すごいね」より「なるほど、そういう考え方もあるんだ」と知的に返すと好感度UP。部活や勉強で成果を出している姿を見せると、対等な存在として認めてもらえる。",
        "approach": "「○○のこと、もっと詳しく教えてほしい」と知的好奇心をくすぐる一言が刺さる。LINEでは長文で深い話をすると、じっくり返信が来る。「あなたといると、新しい発見がある」は最強の殺し文句。"
      },
      "twenties": {
        "date": "夜景が見えるバーや、美術館の特別展に誘うのがベスト。おしゃれなブックカフェで、お互いの本を交換するのも刺さる。プラネタリウムや科学館など、知的好奇心を満たせるスポットも◎。食事は隠れ家的な名店を予約しておくと「わかってるな」と思われる。",
        "hidden": "仕事では完璧に見えるけど、実はプライベートではかなりの甘えん坊。信頼した相手の前でだけ見せる無防備な姿がある。休日は一日中パジャマでいたいタイプ。実は感情的になると泣くことも。",
        "attractive": "自分の仕事やキャリアに真剣に向き合っている姿を見せること。「私も○○について勉強してるんだ」と向上心をアピール。デートの待ち合わせには少し早めに到着し、清潔感のある服装で。相手の専門分野について質問すると一気に距離が縮まる。",
        "approach": "「あなたの考え方、すごく刺激になる」と知性を認める言葉が効く。「今度、面白い展覧会があるんだけど、一緒にどう？」と自然に誘って。「あなたと話してると、時間があっという間に過ぎる」は心に深く刺さる。"
      }
    }
  },
  "ENFP": {
    "name": "路地裏チワワ",
    "emoji": "dog",
    "tagline": "好奇心の塊、トレンドを追いかける冒険者",
    "traits": ["好奇心旺盛", "社交的", "直感型", "柔軟性が高い"],
    "description": "どんな場所でもすぐに溶け込める社交性と、新しいものへの飽くなき好奇心を持つ。話題が豊富で、一緒にいると退屈しない。ただし飽きっぽい一面もあり、興味の矛先がコロコロ変わることも。",
    "advice": {
      "teens": {
        "date": "話題のカフェ巡りやSNSで見つけた穴場スポットを一緒に開拓するデート。文化祭の打ち上げでワイワイするのも楽しい。放課後にふらっと古着屋や雑貨屋をハシゴするのも最高。「あそこ行ってみない？」のノリが通じる相手。",
        "hidden": "いつも明るく振る舞っているけど、実は人の顔色をかなり気にしている。夜、一人になると急に不安になることも。みんなの前では言えない深い悩みを抱えていることがある。「大丈夫？」の一言で泣き出すかも。",
        "attractive": "新しい情報や面白いネタをどんどんシェアすること。「これ知ってる？」から始まる会話が大好き。リアクション大きめで、相手の話に全力でノっていくと仲良くなれる。自分も何かに夢中になっている姿が魅力的に映る。",
        "approach": "「次の休み、面白い場所見つけたんだけど一緒に行かない？」と冒険に誘う形がベスト。「あなたといると毎日が楽しい」はストレートだけど一番響く。サプライズ演出にも弱い。"
      },
      "twenties": {
        "date": "週末のフリーマーケットや、新しくオープンしたレストランのチェック。ポップアップイベントやフードフェスなど、刺激のある場所がぴったり。旅行好きなので、日帰り温泉や近場の小旅行を提案するのも◎。写真映えするスポットは必ず押さえて。",
        "hidden": "仕事では「何でもできる人」を演じているけど、実は自分の本当にやりたいことが見つかっていないことに焦りを感じている。キャリアの話になると急に真剣になる。一人の夜に将来について考え込むことも多い。",
        "attractive": "フットワークの軽さを見せつけること。「面白そう！行こう！」の即レスが好印象。SNSで面白い投稿をシェアしたり、新しい趣味にチャレンジしている姿も◎。ファッションやトレンドへの感度が高いと一目置かれる。",
        "approach": "「あなたと一緒だと、普通の日常もアドベンチャーになる」がキラーフレーズ。「今度の週末、まだ何も決めてないんだけど、一緒にノープランで出かけない？」と誘うと目が輝く。"
      }
    }
  },
  "ESTJ": {
    "name": "爆走ライオン",
    "emoji": "lion",
    "tagline": "圧倒的リーダーシップで道を切り拓く王者",
    "traits": ["リーダーシップ", "責任感が強い", "効率重視", "決断力がある"],
    "description": "グループの中では自然とリーダーポジションに。計画的で責任感が強く、有言実行の人。頼りがいがある一方で、自分のやり方にこだわりすぎることも。心を開くと意外と面倒見がいい。",
    "advice": {
      "teens": {
        "date": "体育祭や球技大会の後の「おつかれ！」から始まるのが自然。運動系のデート（ボウリング、バッティングセンター）で一緒に盛り上がれる。部活の試合を応援に行くと喜ぶ。勝負事には全力なので、一緒にゲームセンターで対戦するのも面白い。",
        "hidden": "みんなの前ではしっかり者だけど、実は繊細で傷つきやすい。リーダーとしてのプレッシャーを一人で抱えていることが多い。弱音を吐ける相手を心の底では求めている。甘いものが好きだったりする意外な一面も。",
        "attractive": "何事にも一生懸命で全力な姿を見せること。約束を守り、時間に正確であること。テキパキと行動できる人に好感を持つ。「あなたを頼りにしてる」と伝えると、守りたい本能が刺激される。",
        "approach": "「○○がいるとチームが安心する」と存在価値を認める言葉が効く。ストレートに「一緒にいたい」と伝えるのが一番響く。回りくどい駆け引きは逆効果。「あなたについていきたい」は最高の褒め言葉。"
      },
      "twenties": {
        "date": "人気の焼肉店やステーキハウスなど、活力が出る食事デート。スポーツ観戦やフットサル、ゴルフの打ちっぱなしなどアクティブなプランが◎。仕事終わりの「軽く一杯」から始まるのも自然。休日はドライブで郊外に出かけるのも喜ぶ。",
        "hidden": "仕事では部下にも上司にも厳しいけど、プライベートでは実はかなり寂しがり屋。休日に一人でいると急に元気がなくなる。「ありがとう」と言われるのに弱い。本当は誰かに甘えたいけど、甘え方がわからない。",
        "attractive": "自分のキャリアビジョンをしっかり持っていること。仕事の話を熱く語ると共感してもらえる。清潔感があり、TPOに合った服装ができる人に好印象。デートのプランをしっかり準備しておくと「できるな」と評価される。",
        "approach": "「あなたの仕事への姿勢、本当に尊敬する」が最強ワード。「私も負けないくらい頑張るから、一緒に高め合おう」と対等な関係を提案。「あなたの隣にいたい」とシンプルに伝えて。"
      }
    }
  },
  "ESFJ": {
    "name": "ひだまりレトリバー",
    "emoji": "retriever",
    "tagline": "共感の天才、みんなのお母さん的存在",
    "traits": ["共感力が高い", "面倒見がいい", "協調性", "温かみがある"],
    "description": "誰といても場を和ませる太陽のような存在。相手の気持ちを察するのが上手で、気がつくとグループの調整役を買って出ている。人の世話を焼くのが好きだが、自分のことは後回しにしがち。",
    "advice": {
      "teens": {
        "date": "一緒にお菓子作りやカフェ巡り。学校の行事（文化祭・体育祭）で一緒の係になるのが近道。放課後のファミレスでの「なんでもない話」が一番幸せな時間。友達を交えたグループ遊びから徐々に二人の時間を増やす作戦が◎。",
        "hidden": "みんなに優しいから「八方美人」と思われがちだけど、本当は特定の人にだけ深い愛情を注ぎたい。「私のことどう思ってる？」が口癖になるくらい承認欲求がある。一人の時間に急にネガティブになることも。",
        "attractive": "相手の「ありがとう」をちゃんと伝えること。些細なことに気づいて褒めると喜ぶ。「○○がいてくれて助かった」は魔法の言葉。自分も相手に親切にすることで、お互いの温かさが共鳴する。",
        "approach": "「○○がいると安心する」が一番響く。手書きの手紙やちょっとしたプレゼントに弱い。「いつも頑張ってるの知ってるよ」と日頃の努力を認める言葉で一気に落ちる。"
      },
      "twenties": {
        "date": "おしゃれなカフェでランチ、季節の花を見にお出かけ、料理教室に一緒に参加。人気のパンケーキ屋さんや、話題のスイーツ店もテンションが上がる。休日はショッピングモールで一緒にウィンドウショッピングもあり。温泉旅行なども喜ぶ。",
        "hidden": "職場では「頼れるお姉さん」でも、家に帰ると急にスイッチが切れる。実は人間関係の悩みを一番抱えやすいタイプ。「嫌われたくない」が行動原理になっていることに気づいている。一人になると不安でSNSを延々とチェックしてしまう。",
        "attractive": "相手の体調や変化に気づいてあげること。「髪切った？似合うね」のような小さな気づきが大切。記念日やイベントをちゃんと覚えておく。LINEはマメに返す。既読無視は絶対NG。",
        "approach": "「あなたがいるから頑張れる」が最強のキラーフレーズ。「いつもみんなのこと考えてるけど、今日は○○のことだけ考えさせて」と特別感を演出。手料理を振る舞うと心を鷲掴み。"
      }
    }
  },
  "ISTJ": {
    "name": "戦略ペンギン",
    "emoji": "penguin",
    "tagline": "几帳面で堅実、信頼の実務家",
    "traits": ["几帳面", "責任感が強い", "現実的", "忍耐力がある"],
    "description": "言ったことは必ずやる、信頼の塊のような人。ルーティンを大切にし、計画的に物事を進める。派手さはないが、コツコツと確実に成果を積み上げる。信頼を得るまでに時間がかかるが、一度認めた相手にはとことん誠実。",
    "advice": {
      "teens": {
        "date": "図書館で一緒に勉強した後、駅前のファミレスでご褒美パフェ。定期テスト前の「一緒に頑張ろう」が自然な誘い文句。通学路が同じなら、一緒に登下校するのが距離を縮める最短ルート。真面目なイベント（勉強会、委員会活動）で一緒になるチャンスを活かして。",
        "hidden": "真面目そうに見えて、実はお笑い番組が大好きだったり、意外な趣味を持っていることが多い。感情表現が苦手なだけで、内心ではめちゃくちゃ嬉しかったり悲しかったりしている。サプライズに慣れていなくて、照れ隠しに無表情になることも。",
        "attractive": "約束を守ること。これが一番大事。遅刻しない、嘘をつかない。提出物をちゃんと出す、当番をサボらない。そういう「当たり前のこと」をちゃんとできる人を信頼する。自分も真面目に取り組む姿を見せることが最大のアピール。",
        "approach": "「○○って本当に信頼できる」が最も響く。じっくり時間をかけて距離を縮めるのが正解。焦らず毎日の挨拶から。「いつも見てるよ、頑張ってるの知ってるよ」とさりげなく伝えて。"
      },
      "twenties": {
        "date": "事前にちゃんと計画されたデートがベスト。有名なお店を予約しておくと安心感を与えられる。水族館や博物館のような落ち着いた場所も◎。定番のデートスポットの方が「はずれがない」と喜ぶ。散歩しながら将来の話をするのも好き。",
        "hidden": "職場では堅物キャラだけど、お酒が入ると急に饒舌になることがある。実はロマンチストで、記念日をちゃんと覚えている。意外と甘いものが好きで、コンビニスイーツのチェックは欠かさない。趣味の世界ではオタク気質。",
        "attractive": "社会人としてのマナーがちゃんとしていること。敬語が使える、名刺交換がスムーズ、TPOをわきまえた服装。貯金や将来設計について真面目に考えている姿勢を見せると一気に好感度が上がる。安定感のある人に惹かれる。",
        "approach": "「あなたと一緒にいると安心する」がキラーフレーズ。「将来のことを一緒に考えたい」は最高の告白。誠実に、まっすぐに気持ちを伝えること。遠回しな表現より「好きです」の直球が効く。"
      }
    }
  },
  "INFP": {
    "name": "雨宿りうさぎ",
    "emoji": "rabbit",
    "tagline": "繊細な感性で世界を彩る芸術家",
    "traits": ["繊細", "想像力豊か", "理想主義", "共感力が高い"],
    "description": "独自の世界観を持ち、芸術や物語を深く愛する。表面上は穏やかだが、内面には激しい感情と強い理想を持っている。深い人間関係を少数精鋭で築くタイプ。本音を見せるまでに時間がかかるが、心を開くと驚くほど情熱的。",
    "advice": {
      "teens": {
        "date": "おしゃれなカフェで読書したり、美術館に行ったり。放課後に桜並木を散歩するような、穏やかな時間が至福。音楽の話や好きな漫画・小説の話で盛り上がれると距離が一気に縮まる。二人だけの秘密の場所を作るのも効果的。",
        "hidden": "穏やかに見えて、実は頭の中では壮大な妄想ストーリーが展開されている。好きな人のことを小説みたいに脳内で物語にしていることも。怒りの感情を表に出さないけど、一度限界を超えると大爆発する。創作活動（絵、文章、音楽）に打ち込んでいる可能性大。",
        "attractive": "相手の作品や考えを否定しないこと。「わかる」「素敵だね」と共感する姿勢が大切。自分も何か好きなことに熱中している姿を見せると、同志として認めてもらえる。LINEでは絵文字やスタンプを使って柔らかい雰囲気を出すと◎。",
        "approach": "「○○の感性って素敵だと思う」が一番心に響く。手書きの手紙は最強の武器。「あなたの世界をもっと知りたい」は魔法のフレーズ。ゆっくり、丁寧に、焦らずに。"
      },
      "twenties": {
        "date": "映画館で感動作を観た後、静かなカフェで感想を語り合うのがベスト。本屋さんでお互いにおすすめの本を選び合うデートも◎。公園でピクニック、森林浴、海辺の散歩など、自然を感じられる場所も好き。ライブハウスやギャラリーもおすすめ。",
        "hidden": "仕事は「やりがい」で選ぶので、収入が低くても好きなことを仕事にしようとする。社会の不条理に対して強い怒りを持っている。SNSでは全然違うキャラを演じていることも。実はかなりの完璧主義で、自分の理想に達しない自分を責めがち。",
        "attractive": "相手の価値観を尊重し、否定しないこと。「お金より大切なものがある」という考えに共感できると距離が縮まる。文学やアート、音楽などカルチャーへの感度が高いと好印象。深い会話ができる人に惹かれる。",
        "approach": "「あなたの考え方、他の人にはない特別なものだと思う」が最強。「一緒にいると心が穏やかになる」も効く。急がず、長い手紙のような告白が一番心に届く。ロマンチックな場所で、ロマンチックな言葉を。"
      }
    }
  },
  "ISTP": {
    "name": "職人ウルフ",
    "emoji": "wolf",
    "tagline": "寡黙なこだわり派、背中で語る孤高の職人",
    "traits": ["職人気質", "冷静沈着", "自立心が強い", "器用"],
    "description": "多くを語らず、行動で示すタイプ。手先が器用で、何かを作ったり修理したりするのが得意。自分のペースを大切にし、束縛を嫌う。クールに見えるが、好きなことへの情熱は誰にも負けない。",
    "advice": {
      "teens": {
        "date": "一緒にプラモデルやDIYをするような「作業デート」が至高。ゲームセンターで対戦したり、自転車で遠出したり。あまり計画を詰め込まず、自然体で過ごせる時間が大切。部活（特に技術系）で一緒になるのが一番の近道。",
        "hidden": "クールに見えるけど、実は好きな人の前ではかなり不器用になる。言葉で気持ちを伝えるのが苦手で、代わりに「行動」で示そうとする。消しゴムを貸してくれたり、重い荷物を持ってくれたり。そういう小さな行動が全部「好き」のサイン。",
        "attractive": "相手の趣味やこだわりに興味を持つこと。「それどうやって作ったの？」と質問すると嬉しそうに教えてくれる。自分も何かに没頭できる人が好み。ベタベタしすぎず、適度な距離感を保つのがコツ。",
        "approach": "「○○の作るもの、かっこいいね」と技術を褒めるのが一番効く。「隣にいてもいい？」というさりげない一言が響く。長文LINEより、隣で無言でいられる関係性が理想。"
      },
      "twenties": {
        "date": "ものづくりワークショップ（陶芸、レザークラフト）やDIYショップ巡り。バイクや車好きならドライブデート。ホームセンターを一緒にぶらつくのも楽しい。映画は考察系やアクション系がハマる。一人の時間も尊重しつつ、たまに一緒にいる距離感。",
        "hidden": "職場では淡々としているけど、趣味の話になると急にスイッチが入って饒舌になる。実は困っている人を放っておけない優しさがある。感情を表に出さないだけで、内心では色々感じている。一人旅が好きだが、本当は隣に誰かいてほしい。",
        "attractive": "自分の趣味や仕事に理解を示すこと。束縛せず、お互いの時間を尊重できる人に惹かれる。さりげない気遣い（コーヒーを淹れてくれる、寒そうにしてたら上着をかけるなど）が好印象。言葉より行動で愛情を示す人が好き。",
        "approach": "「あなたの集中してる姿、好きだな」がキラーフレーズ。「一人の時間も大切にしたいし、でも一緒にいる時間も欲しい」と正直に伝えるのが◎。「隣にいたい」のシンプルな一言が一番刺さる。"
      }
    }
  },
  "ESFP": {
    "name": "お祭りパンダ",
    "emoji": "panda",
    "tagline": "今を全力で楽しむエンターテイナー",
    "traits": ["ムードメーカー", "行動的", "楽観的", "人懐っこい"],
    "description": "どんな場でも雰囲気を明るくするムードメーカー。食べることが好きで、楽しいことが大好き。「今この瞬間」を全力で楽しむことに長けている。ノリがよく、一緒にいるだけで元気をもらえる存在。",
    "advice": {
      "teens": {
        "date": "お祭り、花火大会、テーマパークなどイベント系が最強。食べ歩きしながら街を探検するのも大好き。体育祭のあとの打ち上げで一気に仲良くなれるチャンス。カラオケで盛り上がったり、プリクラを撮ったり、とにかく一緒に笑える時間が大事。",
        "hidden": "いつも明るいけど、実は「空気を読みすぎて疲れる」ことがある。周りが楽しくないと自分も楽しめないタイプ。一人になると急に寂しくなって、深夜にLINEしてくることも。将来の不安を口にしないだけで、実は結構考えている。",
        "attractive": "一緒にノリノリで楽しめること。「楽しい！」「美味しい！」のリアクションが大きいほど嬉しい。写真や動画を一緒に撮って「またやりたいね」と言うと◎。自分も明るくポジティブなエネルギーを出すことが大事。",
        "approach": "「○○といると元気もらえる！」が魔法の言葉。「次は二人だけで行こうよ」とさりげなく誘う。「あなたの笑顔が一番好き」はストレートだけど最強。写真と一緒にメッセージを送るのも効果的。"
      },
      "twenties": {
        "date": "食べログ高評価の店で食べ歩き、フードフェスやビアガーデン。テーマパークや夏フェス、花火大会は鉄板。BBQやキャンプなどアウトドア系も◎。旅行は行き当たりばったりでも楽しめる最高の相棒。インスタ映えスポットも大好き。",
        "hidden": "パーティーの帰り道、急に黙ることがある。実は「自分には何もない」と感じる瞬間がある。楽しいことで不安を紛らわせている面も。キャリアについて真面目に悩んでいるけど、周りには見せない。一人で泣くことも実はある。",
        "attractive": "「楽しい」「美味しい」を共有できること。食事をおいしそうに食べる姿は好感度MAX。インスタやTikTokの面白い投稿をシェアするコミュニケーションも◎。常にポジティブで、一緒にいて楽しい雰囲気を出せる人が好き。",
        "approach": "「人生楽しくなるから一緒にいて」がベストアンサー。「美味しいもの食べに行こ？」はデートへの最短ルート。「あなたの笑顔で元気になれる、ずっと隣で笑っていてほしい」が最強の告白。"
      }
    }
  }
}
