{
  "INTJ": {
    "name": "夜景の黒猫",
    "emoji": "cat",
    "tagline": "クールぶってるが、脳内は「俺様が一番正しい」の特権意識モンスター",
    "traits": ["選民意識の塊", "他人の成功に毒づく", "完璧主義の皮を被った臆病者", "孤高気取りの寂しがり屋"],
    "description": "表面はクールで知的な雰囲気を漂わせているが、その仮面の裏には「自分以外全員バカ」という壮大な勘違いが潜んでいる。他人の成功を見ると「運が良かっただけ」と陰で毒づき、自分の失敗は「周りのレベルが低いせい」と責任転嫁。でも本人は「論理的に正しいことを言っているだけ」と本気で思っている。",
    "weakness": "クールぶってるが、脳内は「俺様が一番正しい」という特権意識の塊。他人の成功を見ると「運が良かっただけ」と陰で毒づく。承認欲求が異常に高いくせに、自分からは絶対にそれを見せない。",
    "date": "刺激の少ない静かなブックカフェ。知的な空間で「私はあなたのレベルに合わせてあげてる」感を出させてあげるのがコツ。美術館の特別展や、隠れ家的なバーも◎。間違っても騒がしい居酒屋に連れて行ってはいけない。",
    "attractive": "質問攻めを封印し、「沈黙の美学」を貫く。余計なことを喋らず、たまに深い一言を落とすのが最強ムーブ。「わかってる感」を出せれば勝ち。相手の専門分野を事前にリサーチしておくと尊敬ポイント爆上がり。",
    "approach": "「〇〇の独自理論、誰も真似できないね。天才じゃない？」——この一言で承認欲求のダムが決壊する。知性を褒められることに飢えているので、ピンポイントで刺せ。"
  },
  "INFJ": {
    "name": "高嶺の花子さん",
    "emoji": "flower",
    "tagline": "「私を理解できる人なんていない」と自分に酔ってる孤高の理想主義者",
    "traits": ["理想が高すぎて誰も届かない", "自己犠牲に酔いがち", "表面温厚・内面ドロドロ", "被害者意識の達人"],
    "description": "穏やかで理想主義的に見えるが、内心では「こんなに深い私を理解できる人はいない」と常にどこか上から目線。人間関係に深く入り込みすぎて、勝手に期待して勝手に失望する。自分の世界観に合わない人間は静かに切り捨てる冷酷さも持つ。",
    "weakness": "「私を理解できる人なんていない」が口癖だが、実は理解されることを一番求めている矛盾の塊。他人を救おうとして自分が溺れるタイプ。裏切られたと感じると一生許さない執念深さがある。",
    "date": "雰囲気のいいプラネタリウムや、静かな湖畔のレストラン。「特別な体験」に弱い。事前に相手の好みをリサーチしている「計画的サプライズ」が最強。大人数の飲み会は魂が抜ける。",
    "attractive": "表面的な会話を避け、人生観や夢について語り合う。「あなたの考え、深いね」と共感すれば心の扉が開く。ただし嘘の共感は即バレするので要注意。本気で共感できる部分を見つけろ。",
    "approach": "「〇〇みたいに、本質を見抜ける人は初めて。もっとその世界を知りたい。」——「唯一の理解者」ポジションを取れれば圧勝。"
  },
  "INTP": {
    "name": "無愛想なロボ",
    "emoji": "robot",
    "tagline": "感情をエラーとして処理する天然マウントマシン",
    "traits": ["感情よりロジック優先", "空気が読めない天才", "屁理屈の申し子", "興味ないことは完全無視"],
    "description": "頭の中は常に理論と仮説でいっぱいだが、他人の感情は「バグ」として処理する。悪気はないが「それ、論理的におかしくない？」が口癖で、周囲を地味に傷つけ続けている。興味があることには異常な集中力を見せるが、興味がないことは存在しないかのように無視する。",
    "weakness": "感情をエラーとして処理するので、人を傷つけても気づかない。「正しければ何を言ってもいい」と本気で思っている。社交的な場面では完全にフリーズし、一人の世界に逃げ込む。",
    "date": "科学館やボードゲームカフェ。知的好奇心を刺激する場所が◎。VRゲームやプログラミングイベントもアリ。しっとりしたデートは相手がバグる。会話より「一緒に考える」体験が大事。",
    "attractive": "知的な話題を振り、相手の理論に「なるほど、そういう視点は考えなかった」と感心してみせる。議論を楽しめる相手だと認識されれば勝ち。感情論で攻めると即シャットダウン。",
    "approach": "「〇〇の頭の中、覗いてみたい。その思考回路、めちゃくちゃ面白い。」——知性への好奇心を見せるのが最短ルート。"
  },
  "ISTP": {
    "name": "一匹狼ウルフ",
    "emoji": "wolf",
    "tagline": "無愛想をクールで片付けてるコミュ障、論破マウントが快感",
    "traits": ["コミュ障をクールと勘違い", "論破マウント中毒", "束縛されたら死ぬ", "不器用な愛情表現"],
    "description": "寡黙でクールな一匹狼を気取っているが、実態はただのコミュニケーション不全。マニアックな知識で他人を論破してマウントを取るのが密かな快感。束縛されると本気で消える。",
    "weakness": "無愛想を「クール」で片付けているが、実際はただのコミュニケーション不全。マニアックな知識で他人を論破してマウントを取るのが快感。好きな人の前だと更にコミュ障が加速する。",
    "date": "工作ワークショップや、ガジェット巡り。一緒に何かを「作る」体験が最強。ドライブやホームセンター巡りでも可。会話より「並んで同じことをする」時間を重視。",
    "attractive": "一人時間を絶対に邪魔しない。「束縛ゼロ」が最大のプレゼント。LINEの返信が遅くても絶対に責めるな。「放っておいてくれる人」が一番好き。",
    "approach": "「〇〇の専門的な話、もっと聞かせて。マジでハマるわ。」——自分の得意分野に興味を持ってくれる人に弱すぎる。これだけで心の扉が開く。"
  },
  "ENTJ": {
    "name": "ビッグマム",
    "emoji": "bigmom",
    "tagline": "「私に従えば全員幸せ」と本気で信じてる支配欲の帝王",
    "traits": ["支配欲MAX", "有能だが独裁的", "弱みを見せたら負け", "意外と面倒見がいい"],
    "description": "生まれながらのリーダー気質だが、リーダーシップと独裁の区別がついていない。「私に従えば全員幸せになれる」と本気で信じており、反抗する者は容赦なく切り捨てる。でも実は部下の成長を誰よりも喜ぶ、ツンデレ支配者。",
    "weakness": "「私が正しい」が全ての原動力。反論されると「こいつ無能だな」と内心で見下す。完璧じゃない自分を絶対に見せたくないので、疲れても弱音を吐けない。プライドが高すぎて素直に甘えられない。",
    "date": "高級レストランやヘリクルーズ。「格」のある場所に弱い。ビジネスセミナーや起業家イベントへの同行もアリ。安っぽい場所に連れて行ったら二度目はない。",
    "attractive": "相手のビジョンに共感しつつ、自分の意見もしっかり述べる。イエスマンは見下されるので注意。「対等なパートナー」として振る舞えれば一目置かれる。",
    "approach": "「〇〇についていきたい。でもたまには甘えてきてよ。」——支配者の仮面を外す許可証。この一言で心が崩れる。"
  },
  "ESTJ": {
    "name": "爆走ライオン",
    "emoji": "lion",
    "tagline": "完璧主義の仮面の下で「誰も私を助けてくれない」と被害妄想中",
    "traits": ["支配欲の権化", "部下disが趣味", "弱み見せたら死ぬ病", "隠れ甘えん坊"],
    "description": "「俺についてこい」が生きがいの自称リーダー。有言実行で頼りがいがあるように見えるが、他人のミスを心の中で「この下手くそが！」とdisるのが実は快感。完璧主義の鎧を脱げない不器用さが最大の弱点。",
    "weakness": "完璧主義の仮面の下で「誰も私を助けてくれない」と被害妄想。部下や他人のミスを心の中で「この下手くそが！」とdisるのが趣味。本当は甘えたいけど甘え方がわからない不器用な王様。",
    "date": "予約困難な名店や、達成感のあるスポーツ。「自分が一番」と思える場所に連れて行け。ゴルフ、高級焼肉、スポーツ観戦のVIP席。安っぽい店は即アウト。",
    "attractive": "基本は尊重しつつ、たまに「今日は私が全部仕切るね」と甘えさせる。普段は絶対に弱みを見せないので、「頑張らなくていいよ」の一言で思わず涙腺が崩壊する。",
    "approach": "「いつも完璧だけど、私の前ではただのダメ人間でいいんだよ？」——鎧を脱がせる一言。これを言えるのはあなただけ、という特別感が致命傷になる。"
  },
  "ENTP": {
    "name": "マウント拡声器",
    "emoji": "parrot",
    "tagline": "論破が趣味の知的マウントモンスター、でも飽きたら即撤退",
    "traits": ["論破中毒", "飽き性の極み", "口だけ番長", "刺激がないと死ぬ"],
    "description": "知識の引き出しが多く、議論では無敵。だが目的は「正しさの追求」ではなく「相手を論破する快感」。新しいアイデアを次々生み出すが、実行する前に飽きて次のターゲットへ。口は達者だが行動が伴わない、知的口だけ番長。",
    "weakness": "論破できない相手に出会うとパニックになる。飽き性が災いして何も完成させられない。「自分は特別」と思っているが、実は深い人間関係を築くのが苦手。表面的な知り合いは多いが本当の友達は少ない。",
    "date": "ディベートカフェや謎解きイベント。知的に戦える場所が◎。脱出ゲーム、トークイベント、お笑いライブも刺さる。予定通りのデートは退屈で死ぬので、ハプニングを歓迎する姿勢が大事。",
    "attractive": "議論を受けて立つ度胸を見せる。「それは違うと思う。なぜなら…」と反論できる人に惹かれる。ただし、感情的に怒ると「つまらない」と判定されるので冷静に。知的なツッコミが一番刺さる。",
    "approach": "「〇〇の発想力、マジで化け物。一緒にいると脳がバグる。」——知的に認められたい欲求を直撃。退屈させない相手だと思わせたら勝ち。"
  },
  "ENFP": {
    "name": "路地裏チワワ",
    "emoji": "dog",
    "tagline": "明るいふりして、一人になると盛大に拗ねる構ってちゃんモンスター",
    "traits": ["笑顔の裏の闇", "構ってちゃん攻撃", "飽き性の権化", "感情のジェットコースター"],
    "description": "どこにいても中心にいたがる目立ちたがり屋。「面白い」「楽しい」が口癖だが、一人になった途端「誰も本当の自分を理解してない」と盛大に病む。新しいもの好きだが、飽きるスピードも異常。恋愛でも同じパターンを繰り返す。",
    "weakness": "明るいふりして、一人になると「誰も自分を理解してない」と盛大に拗ねる。寂しさから相手を試すような「構ってちゃん攻撃」を仕掛ける。飽きっぽいくせに捨てられるのは死ぬほど怖い。",
    "date": "毎日変わる新オープン施設や謎のイベント。とにかく「初めて」と「刺激」に弱い。インスタ映えスポットは必須。予定はガチガチに決めず、ノープランで「次どこ行く？」のワクワク感を演出。",
    "attractive": "突飛なアイデアを「神の啓示！」と全力で全肯定。どんなに意味不明な提案でも「天才じゃん！」と目をキラキラさせろ。否定した瞬間、心のシャッターが音を立てて閉まる。",
    "approach": "「〇〇といると毎日が冒険！ 世界が派手に輝いて見えるよ」——特別感と冒険心をくすぐれば、尻尾を振って寄ってくる。"
  },
  "ISTJ": {
    "name": "鉄壁の金庫",
    "emoji": "vault",
    "tagline": "感情にロックをかけた、ルール絶対主義の石頭",
    "traits": ["ルールが命", "変化が怖い", "感情表現が化石", "裏では意外と心配性"],
    "description": "ルールと秩序が全ての行動原理。決められた手順を完璧にこなすが、想定外の事態が起きると完全にフリーズする。感情表現がバグっていて、嬉しくても悲しくても同じ顔。でも内心では「嫌われてないかな…」と常に心配している。",
    "weakness": "変化を極度に恐れ、新しいことに挑戦する前に10個くらいリスクを並べる。感情表現がほぼゼロなので、好意を持っていても相手に一切伝わらない。ルールを破る人間を心の底から軽蔑している。",
    "date": "スケジュールが完璧に組まれたプラン。事前に「何時にどこで何をする」を共有しておくと安心する。老舗の和食や水族館など定番スポットが◎。サプライズは心臓に悪いのでNG。",
    "attractive": "時間厳守、マナー完璧。「当たり前のことを当たり前にやる」姿勢が最大の好感度UP。約束を破ったら信頼回復に1年かかると思え。安定感と誠実さで勝負。",
    "approach": "「〇〇の堅実さ、本当に安心する。ずっと隣にいたい。」——「信頼されている」と実感できる言葉が一番効く。派手な告白より日常の積み重ねが大事。"
  },
  "ISFJ": {
    "name": "戦略ペンギン",
    "emoji": "penguin",
    "tagline": "真面目な顔して「ルール守れないヤツ全員消えろ」と呪ってる",
    "traits": ["ルール至上主義", "むっつりスケベ", "感情表現バグ", "裏オタク気質"],
    "description": "几帳面で真面目、信頼の塊に見えるが、内心では「ルールを守れないヤツ、全員いなくなればいいのに」と呪っている。表面はポーカーフェイスだが、裏ではかなりの妄想家。真面目すぎて逆に変態寄り。",
    "weakness": "真面目な顔して、裏では「ルールを守れないヤツ、全員いなくなればいいのに」と呪っている。下ネタや卑猥な妄想を一人で楽しむむっつり派。感情表現がバグっているので、嬉しくても無表情。",
    "date": "スケジュールが完璧に組まれた水族館。事前にプランを共有しておくと安心感MAX。「予約してあるから」の一言が最強の媚薬。定番デートスポットの方がハズレがなくて安心する。",
    "attractive": "マナーと礼儀を徹底。靴を揃えるレベルの「当たり前」で信頼を得る。遅刻は死罪。約束を守ることが最大の愛情表現。ドタキャンしたら二度と会えないと思え。",
    "approach": "「〇〇のその几帳面さ、正直ガチで尊敬する。真似したい。」——真面目さを評価してくれる人が圧倒的に少ないので、この一言は心に深く刺さる。"
  },
  "ISFP": {
    "name": "雨宿りうさぎ",
    "emoji": "rabbit",
    "tagline": "穏やかな表情の裏で「この世界は私には眩しすぎる」と嘆いてる",
    "traits": ["繊細すぎる感受性", "自分の世界に引きこもる", "芸術肌の変わり者", "怒ると突然キレる"],
    "description": "穏やかで優しい雰囲気を漂わせているが、内面は過敏なセンサーだらけ。些細な言葉で深く傷つき、一人の世界に引きこもって回復する。芸術的なセンスは抜群だが、それを表現するのが苦手。普段は温厚だが、限界を超えると突然キレる。",
    "weakness": "繊細すぎて、他人の何気ない一言を一週間引きずる。自分の殻にこもりがちで、SOSを出すのが下手。穏やかに見えるが、怒りの沸点を超えると過去の全てを引っ張り出してキレる。感受性が豊かすぎて疲れやすい。",
    "date": "感性を刺激する美術館や、お洒落なセレクトショップ。「あなたと見たい世界がある」的な誘い方が刺さる。静かなカフェで深い話をする時間が何より幸せ。騒がしい場所は魂が抜ける。",
    "attractive": "無理に聞き出そうとせず、相手のペースにひたすら寄り添う。「わかるよ」の共感ワードを散りばめろ。作品や価値観を否定した瞬間、永遠にブラックリスト入り。",
    "approach": "「言葉にしなくても、〇〇の内面の深さ、私には伝わってくるよ。」——「理解されている」感覚に飢えているので、この一言で完全に心を開く。"
  },
  "INFP": {
    "name": "お豆腐メンタル",
    "emoji": "tofu",
    "tagline": "脳内ポエムが止まらない、被害妄想と理想主義のカオス",
    "traits": ["脳内ポエマー", "被害妄想の達人", "理想と現実のギャップで自爆", "怒ると陰湿"],
    "description": "常に脳内で壮大なポエムを紡いでいる夢見がちな理想主義者。現実とのギャップに勝手に傷ついて、勝手に泣いている。「自分だけの正義」が暴走すると手がつけられない。怒ると表面上は静かだが、裏で陰湿に復讐を企てる。",
    "weakness": "メンタルが豆腐並みに柔らかく、ちょっとした批判で3日寝込む。理想が高すぎて現実に常にガッカリしている。被害妄想が得意で「あの人、私のこと嫌いに違いない」と勝手に確信する。キレたら過去の罪状を全部引っ張り出す。",
    "date": "世界観の強い映画やミュージカル。感動を共有できる体験型デートが◎。おしゃれな古本屋やレトロ喫茶も刺さる。現実感が強すぎる場所（ファミレス等）はテンションが落ちる。",
    "attractive": "相手のポエムや夢を全肯定。「その世界観、好きだよ」の一言が最強。否定は絶対にNG。「あなたの感性は特別」と繰り返し伝えることで信頼を獲得。焦らず時間をかけて距離を縮める。",
    "approach": "「〇〇の見てる世界、私にも見せてほしい。一緒に生きたい。」——ポエティックに攻めるのが正解。現実的な言葉より、感性に響く表現を。"
  },
  "ESTP": {
    "name": "お祭りパンダ",
    "emoji": "panda",
    "tagline": "脳天気に見えて「この集まりクソつまんねぇ」と心で毒吐いてる",
    "traits": ["ムードメーカー仮面", "心の八つ当たり常習犯", "寂しがり屋の脳天気", "逃避行動の天才"],
    "description": "どんな場でもムードメーカーを買って出る陽キャの鑑。だが疲れが溜まると「この集まり、クソつまんねぇ」と心で毒を吐いている。場の空気が悪くなると「お前のせいだ！」と心で八つ当たり。楽しいことで不安を紛らわせる逃避行動の天才。",
    "weakness": "脳天気に見えて、実は場の空気が悪くなると「お前のせいだ！」と心で八つ当たり。疲れが溜まると「この集まり、クソつまんねぇ」と毒を吐く。楽しいことで将来の不安から逃げ続けている。",
    "date": "ライブやフェス。五感を揺さぶる賑やかな場所。食べ歩き、テーマパーク、花火大会は鉄板。「何する？」より「行こう！」の勢いが大事。インスタ映えは必須条件。",
    "attractive": "一緒に馬鹿みたいに大笑いする。感情を120%共有。「楽しい！」「美味しい！」のリアクションはMAXで。テンション低い人は即戦力外通告。",
    "approach": "「〇〇といる瞬間が人生のピーク！ 今日が最高すぎて死ねる！」——大げさなくらいの全力感が一番刺さる。冷静な告白は響かない。"
  },
  "ESFP": {
    "name": "偽善ウミガメ",
    "emoji": "turtle",
    "tagline": "「いい人」仮面の下で損得勘定フル稼働、逃げ足だけは超一流",
    "traits": ["いい人を演じるプロ", "逃げ足MAX", "面倒くさがり屋", "空気を読む天才"],
    "description": "誰にでも優しくて協調性バツグンに見えるが、裏では「この人と仲良くしておくと得かな」と損得勘定フル稼働中。面倒な状況になると海の底に潜るように静かに消える逃避の達人。空気は読めるが、都合よく読み替える才能もある。",
    "weakness": "「いい人」の仮面が分厚すぎて本心が見えない。面倒な問題は全力でスルーし、責任は他人にスライド。本音で語ることが苦手で、結果的に信頼を失う。八方美人が災いして深い関係を築けない。",
    "date": "おしゃれなビーチカフェやリゾート感のある場所。「とりあえず楽しければOK」な雰囲気が大事。SNS映えするスポットに弱い。重い話は避けて、軽いノリで楽しむのがコツ。",
    "attractive": "相手のペースに合わせつつ、たまに本音を引き出す。「無理しなくていいよ」と安心感を与えるのが◎。重すぎるアプローチは逃げられる。軽くて居心地のいい関係を目指せ。",
    "approach": "「〇〇の前では仮面外していいよ。素のままが一番かわいいから。」——「素を出しても大丈夫」という安心感が最大の武器。"
  },
  "ENFJ": {
    "name": "ひだまりレトリバー",
    "emoji": "retriever",
    "tagline": "「みんなのために」が口癖だが、実は依存煽り職人",
    "traits": ["承認欲求の化身", "依存させるプロ", "切り捨て上手", "自己犠牲風マウント"],
    "description": "「あなたのためを思って」が殺し文句の世話焼き番長。周囲からは「いい人」認定だが、実は「私が必要とされない世界」を許せない依存煽り職人。用済みになった相手は無表情で切り捨てる残酷さも持ち合わせている。",
    "weakness": "「みんなのために」が口癖だが、実は「私が必要とされない世界」を許せない依存煽り職人。用済みになった相手は無表情で切り捨てる。「嫌われたくない」が全行動の原動力。",
    "date": "ほっこりできるアニマルカフェやピクニック。「あなたが選んでくれたんだ」感がある場所なら何でも喜ぶ。サプライズ演出にめちゃくちゃ弱い。SNSに上げられる映えスポットも◎。",
    "attractive": "小さな配慮に気づき、大げさなくらい「ありがとう！」を連発。記念日は絶対に忘れるな。LINEの既読無視は宣戦布告と同義。こまめな連絡が命綱。",
    "approach": "「〇〇のおかげで私は救われてる。存在がもう、パワースポット。」——存在意義を全肯定されると、もう離れられなくなる。"
  },
  "ESFJ": {
    "name": "偽善ウミガメ",
    "emoji": "turtle",
    "tagline": "笑顔で世話を焼きつつ「感謝されて当然でしょ」と内心キレてる",
    "traits": ["感謝を要求する世話焼き", "噂話が栄養", "仲間外れが致死量", "表面だけの優しさ"],
    "description": "困ってる人を放っておけない世話焼き体質だが、裏では「こんなにやってあげてるのに感謝がない」と常にキレている。グループの和を重視するが、その実態は「自分が仲間外れにならないため」の生存戦略。噂話を栄養にして生きている。",
    "weakness": "「あなたのため」と言いながら見返りを期待している。感謝されないと静かにブチギレる。仲間外れにされると精神崩壊するので、常に多数派に属そうとする。噂話を広めるのが趣味だが、自分の噂には異常に敏感。",
    "date": "話題のレストランやカフェ巡り。「みんなに自慢できる」場所が大事。グルメフェスやマルシェも◎。友達に「いいなー」と言われるようなデートが理想。自分だけ知らない場所に連れていかれるのは不安。",
    "attractive": "「ありがとう」を惜しみなく伝える。相手の努力を見逃さず褒める。グループ内での立場を守ってあげると好感度MAX。悪口を言う相手には不信感を抱くので注意。",
    "approach": "「〇〇がいるだけで場が明るくなる。みんなそう思ってるよ。」——周囲からの評価を代弁してあげると、承認欲求が満たされて一気に心を開く。"
  }
}
