{
  "INTJ": {
    "name": "夜景の黒猫",
    "emoji": "cat",
    "tagline": "10年後の計画は完璧やのに今日の昼飯すら決められへん闇の戦略家",
    "traits": [
      "脳内プレゼン常時開催",
      "効率厨の極み",
      "感情表現バグりまくり",
      "孤高ぶった承認欲求モンスター"
    ],
    "front": "😇 表向きは「この人、何手先まで読んでるん？」って周囲がざわつくほどの戦略家オーラ全開や。\n\n✨ 会議では的確な発言を最小限にキメて、余計な雑談には一切参加せーへん。その「選ばれし者」感に周囲は勝手に一目置いてしまう。\n\n🧊 感情に流されず、どんなトラブルでも「はいはい、想定内」って顔で冷静に対処するもんやから、「あの人に任せたら間違いない」が合言葉になってるわ。\n\n🎯 趣味にも仕事にもストイックで、Netflix観るにも「IMDbスコア8.0以上しか観ーへん」とか謎の基準設けてるタイプや。効率よく生きすぎて、周囲からは「あの人ロボットちゃう？」って半分本気で言われてるで。",
    "hidden": "👿 その仮面の裏にはNi（内向的直観）が暴走した「俺だけが正しい未来を見えている」という壮大な選民意識が渦巻いとるんや。\n\n🤮 他人の成功ニュース見たら「運が良かっただけやろ」と0.3秒で片付け、自分の失敗は「周りのレベルが低すぎて足引っ張られたんや」と脳内PowerPointで責任転嫁のプレゼン始めるで。\n\n💀 Te（外向的思考）が補助機能やから効率至上主義が極まって、他人のムダな行動にいちいちイライラしとる。会議が10分超えたら「この時間、俺のExcelマクロの方が有益やったな」って真顔で思ってるわ。\n\n😭 でもな、Fi（内向的感情）が第三機能で実はめっちゃ感情豊かやねん。好きなアニメの最終回で号泣してるし、推しの曲聴いたら急に早口になるし。ただ表現の仕方がごっつ下手くそやから、感動しても顔が「確定申告の計算中」みたいになるんや。\n\n🫠 そんで一番あかんのが、Se（外向的感覚）が劣等機能で五感がバグっとること。冷蔵庫で3日前の弁当見つけて「まだいけるやろ」って食べるし、おしゃれに無頓着すぎて同じ黒Tシャツ5枚持ってるし。孤高を気取ってるけど、ほんまは「誰か俺の天才性に気づいてくれへんかな」って心の中で毎日オーディションしとるんや。",
    "manual": "✅ 【攻略法】議論で感情論ぶつけたら0.5秒でシャットダウンされるで、そこはほんまに気ぃつけや。🧠 「なるほど、その視点はなかったわ」ってまず知性を認めるひと言から入るんが鉄則やねん。これやるだけで態度が180度変わるからな、マジで。\n\n📚 相手の専門分野を事前にちょっとリサーチしとくんやで。Ni主機能やから自分のビジョンに共鳴してくれる人にごっつ弱いねん。「その考え、10年後に絶対主流になるわ」とか言うたら内心ガッツポーズしとるで。\n\n🎯 Te補助やから、ダラダラした会話よりも要点まとめて効率よく話す人を尊敬するんや。LINEも「了解」の2文字で完結させるタイプやから、長文送ったら既読スルーされるで覚悟しとき。\n\n🤫 Fi第三が育ってきたら、急に「あの映画の最終回さぁ…」って感情全開トークし始めるから、その瞬間を逃したらあかん。「わかるわー！」って全力で乗っかったれ。心の扉が一気に開くで。\n\n💣 【地雷ポイント】頭ごなしに否定したら一生口きいてくれへんくなるで、ほんまに一生や。🚫 「みんなそう言うてるで」「普通はこうやで」とかいう同調圧力はNi使いに対する最大の侮辱やねん。あの人にとって「普通」は褒め言葉やなくて死刑宣告や。\n\n😤 感情的に泣いたり怒ったりしたら「こいつのTe低いな」って内心で能力査定されて二度と信用されへんで。Se劣等やから突然の予定変更もあかん、「今から飲み行こ！」とかいうノリは心臓止まるレベルのストレスやねん。知らんけど。",
    "date": "🎬 【シミュレーション】まず「隠れ家」「完全予約制」「知る人ぞ知る」のキーワードに死ぬほど弱いから、そういうブックカフェで待ち合わせや。Googleマップの口コミ4.8以上、レビュー50件以下の店を探しとけ、あの人の「特別感センサー」に引っかかるで。\n\n🖼️ 美術館の特別展で「この構図、黄金比使ってるんちゃう？」とか言い出したらチャンスや。お互い無言で鑑賞しつつ、たまに「あの作品の色使い、〇〇の影響受けてるよな」ってボソッと言えたら内心「こいつ…できるな」ってニヤニヤし始めるで。\n\n🍷 仕上げは静かなバーで「あの展示の解釈やけどな…」って議論スタートや。ここでNi同士のビジョンがぶつかり合う知的スパーリングが始まったら、あの人の瞳孔が開いてるはずや。それ「恋に落ちた」のサインやで。\n\n🙅 間違っても大人数の居酒屋、カラオケ、タピオカ屋とかに連れてったらあかん。Se劣等が刺激されて「帰りたい」しか考えられへんくなるからな。ほんまあかんで。\n\n📍 【おすすめスポット】美術館・博物館の企画展、完全予約制の隠れ家バー、天体観測スポット、古書店巡り、プラネタリウムの貸切上映会",
    "killer": "💘 「〇〇の独自理論、10年後にみんな追いつくんやろな。うちだけが今わかっとるわ。」——💥 Ni主機能の「俺だけが見えている未来」を全肯定するこの一言で、承認欲求のダムが決壊するで。あの人が一番飢えてるんは「知性を認められること」やなくて「ビジョンを理解されること」やねん。🎯 「天才やな」より「あんたの見てる世界が見たいわ」の方が100倍刺さるで。知らんけど。",
    "love": "💑 【付き合うとこうなる】「この人が最適解である」と論理的に恋に落ちるタイプや。告白もほぼプレゼン形式で「君と交際することの相互メリットを3点説明させてくれ」とか真顔で言い出すで。\n\n📊 好きな人のデータ収集を「純粋な興味の範疇」と言い張るんやけど、相手の誕生日、血液型、好きな食べ物、アレルギー情報まで全部スプレッドシートにまとめてるのはもう「興味」ちゃうやろって話や。\n\n📱 LINEの返信速度を無意識に0.1秒単位で計測しとるし、既読つくのが普段より30秒遅いだけで「何かあったのか」ってNiが暴走して最悪のシナリオ10パターン脳内シミュレーションし始めるんや。でも本人は「別に気にしてへんけど」って顔しとるで。\n\n📅 記念日には「そういうの興味ないし」って顔しといて、1ヶ月前から脳内でプラン練り上げとる完璧主義や。当日になって「たまたま見つけたんやけど」って渡すプレゼントが的確すぎて逆に怖いレベル。\n\n⚔️ ケンカになるとTe全開で論理武装して相手を完全論破するんやけど、Fi第三が3日後に起動して「言い過ぎた…」と小声で謝る。でもその謝り方が「データを再検証した結果、一部不適切な表現があったことを認める」とかいうビジネスメール調やから、相手は「は？」ってなるわな。\n\n📖 愛情表現は壊滅的に下手やけど、Se劣等のくせに相手の好きなスイーツの店を必死に調べて並んでたり、さりげなく相手の好きな本を全巻揃えてたりする。言葉にでけへんだけで、行動が全部バレバレやねん。\n\n⚠️ 【恋愛キケン度】★★★★☆\n🌀 Ni暴走で自分の世界に入り込みすぎて「あ、恋人おったわ」って存在忘れることがある。\n\n😢 「俺といても楽しくないやろ？」って自虐が始まったら、それFi第三が「構ってほしい」って叫んでるサインやで。\n\n🏆 攻略できたら一生モノの忠誠心を手に入れられるけど、攻略難易度はラスボス級やな。知らんけど。",
    "compatibility": {
      "best": "ENFP",
      "best_reason": "あんたな、INTJの石頭の戦略脳とENFPのぶっ飛んだ発想力が合わさったら最強やねん。Niで未来見据えるINTJに、Neで無限のアイデアぶつけてくるENFPがおったら、お互い「こいつおもろいやん」ってなるんよ。Fi同士が深いとこで繋がるから、表面的やない本音の関係になれるんやで。",
      "worst": "ESFP",
      "worst_reason": "INTJのNi（未来志向）とESFPのSe（今を生きる）が真正面からぶつかるから、もう会話が成立せーへんのよ。「10年後の計画が」って語るINTJに「今楽しけりゃええやん！」って返すESFPの横で、INTJの血管がブチ切れる音が聞こえるで。お互いの劣等機能を刺激し合う地獄コンボやねん。",
      "bestName": "路地裏チワワ",
      "worstName": "偽善ウミガメ"
    }
  },
  "INFJ": {
    "name": "高嶺の花子さん",
    "emoji": "flower",
    "tagline": "「3ヶ月後にあの人ら別れるわ」の予言が当たりすぎて本人もドン引きしてる孤高の預言者",
    "traits": [
      "人間観察の鬼",
      "感情スポンジ体質",
      "ニコニコ腹黒ジャッジメント",
      "ドアスラム搭載済み"
    ],
    "front": "😇 穏やかで優しく、困っている人を見ると反射的に手を差し伸べる聖人オーラ全開の人や。\n\n👂 聞き上手の極みで、相手の話を深く受け止めて「あんたのこと、ちゃんとわかってるで」って雰囲気を醸し出すもんやから、気づいたら周囲の人間全員が悩み相談に来とるねん。無料カウンセラー状態や。\n\n🌟 グループでは控えめに端っこにおるんやけど、議論が迷走した時に「それってつまりこういうことちゃう？」って核心突く一言放って全員を黙らせる。あの瞬間の「うわ、この人すごい」感はほんまに鳥肌モンやで。\n\n🔮 なんか知らんけど人の本質を見抜く能力がバグっとって、「あの二人、半年後に別れるわ」「あの新人、3ヶ月で辞めるで」って予言がことごとく当たるから周囲にちょっと恐れられとる。",
    "hidden": "👿 Ni（内向的直観）が主機能やから「人間の本質が見えすぎる」んやけど、その副作用で「こんなに深い私を理解できる人はこの世におらん」っていう壮大な孤独感を常に抱えとるんや。\n\n🎭 Fe（外向的感情）が補助で周囲の感情を吸い取るスポンジ体質やから、隣の人の機嫌が悪いだけで自分も体調崩すし、満員電車乗ったら他人のネガティブ感情浴びすぎてHPゼロになるで。「共感力高い」って聞こえはええけど、実態は「他人の感情に振り回されて毎日ヘロヘロ」やねん。\n\n🔪 でもな、Ti（内向的思考）が第三機能で裏ではめっちゃ冷静に分析しとるんや。ニコニコしながら「この人、底が浅いな」「あんたの話、論理破綻しとるで」って心の中でジャッジしまくっとる。表のFe笑顔と裏のTi毒舌のギャップがえげつないねん。\n\n💀 一番やばいんがSe（外向的感覚）劣等機能の暴走や。ストレスがMAXに達すると突然タガが外れて、ジャンクフード爆食い、深夜3時にAmazonで30万円分ポチる、突然髪バッサリ切る、とかいう「え、誰？」レベルの衝動行動に走るで。普段の聖人オーラはどこ行ったんやって話や。\n\n🚪 そして最強にして最恐の武器が「ドアスラム」——一度「この人無理」って判定したら、予告なしに関係を完全遮断するねん。LINEブロック、SNS全削除、共通の友達にも「あの人の話はせんといて」って根回し完了。昨日まで普通に話してたのに突然透明人間扱いされるから、やられた方はトラウマ級やで。",
    "manual": "✅ 【攻略法】表面的な会話は逆効果どころか「こいつ浅いな」判定されて終了やで。🧠 「最近どう？」より「あの件についてどう思った？ ほんまの気持ち聞きたいねん」って深い話題振ったら心開き始めるんや。Ni主機能やから本質的な対話にしか興味ないねん。\n\n🤫 大人数の場では絶対に本音しゃべらへんから、二人きりの空間を作るのが鉄則やで。カフェの個室とか、散歩しながらとか、「周囲の感情ノイズ」が少ない環境を選んだれ。Fe補助で他人の感情拾いすぎるから、人混みはHPがゴリゴリ削れるねん。\n\n🫶 「あんたの考え、深いなぁ。うち初めてそこまで考えてる人に会ったわ」って本気の共感を示したれ。ただし嘘の共感はTi第三が0.01秒で見抜くから、心から思ってへんかったらバレるで。あの人の「嘘検知センサー」はChatGPTより精度高いわ。\n\n📚 相手の好きな本とか映画を「自分も観てみたいねん」って言うて共有するんが距離縮める最短ルートや。Ni同士でビジョン共有できた瞬間に「この人は違う」って特別枠に入れてもらえるで。\n\n💣 【地雷ポイント】嘘の共感は速攻バレるって言うたやろ、ほんまになめたらあかんで。Ti第三の分析力は「あんた今、何%の確率で嘘ついてるか」まで計算しとるからな。🚫 裏切りは宇宙が滅んでも許されへん。一回信頼失ったらドアスラム発動で人生から永久追放やで。\n\n😱 大人数の飲み会に無理やり誘うのはFe過負荷で魂抜ける行為や。「みんな来るし〜」って同調圧力かけたら最悪やねん。\n\n🔪 「考えすぎちゃう？」「気にしすぎやって」はNi主機能を全否定する最悪のひと言や。あの人にとって「深く考えること」は呼吸と同じやねん、それ止めろって言われたらどう思う？ ほんまにこれだけは絶対言ったらあかんで。知らんけど。",
    "date": "🎬 【シミュレーション】まずプラネタリウムで待ち合わせや。暗い空間で星を眺めながら横に座るだけで、Fe補助が「この人、安心するわ」って反応し始めるで。ここでベラベラしゃべったらあかん、静かに星を共有する時間が大事やねん。\n\n🍽️ 次は完全個室の静かなレストランや。湖畔とか川沿いとか、水辺が見える場所やとNiの直観モードが心地よく回り始めるで。ここで「人生で一番影響受けた本って何？」とか「10年後どうなってたい？」とか深い話題振ったれ。目がキラキラし始めたらもうこっちの勝ちや。\n\n🌙 帰り道がクライマックスやで。「今日、特別やったわ。こんなに深い話できる人おらんかったわ」って静かに伝えたら、心の扉が全開になるで。大声やなくてええねん、小さい声で本気で言うのが刺さるんや。\n\n🎁 事前に相手の好みを死ぬほどリサーチして「計画的サプライズ」仕込んどくんやで。「あ、そういえば前に〇〇好きって言ってたよな」って渡した瞬間、Ni主機能が「この人、私のこと見てくれてる…」って感動して内心号泣しとるから。\n\n🙅 騒がしい居酒屋、クラブ、カラオケ、BBQとかは論外中の論外やで。Se劣等が爆発して翌日寝込むレベルのダメージ食らうわ。\n\n📍 【おすすめスポット】プラネタリウム、静かな水辺のレストラン、個室のある隠れ家カフェ、小さな映画館のレイトショー、神社仏閣巡り、星空が綺麗な温泉宿",
    "killer": "💘 「〇〇みたいに本質見抜ける人、ほんまにこの世におらんわ。あんただけが見えてる世界、うちにも教えてほしいねん。」——💥 Ni主機能の「誰にも理解されない孤独」をピンポイントで癒すこの一言で、ドアスラムどころか心の扉全開放やで。あの人が一生探し続けてるのは「唯一の理解者」やねん。その椅子に座れたら、もう誰にもポジション奪われへんわ。🔑 ただし本気で思ってへんかったらTiに秒でバレるから、魂込めて言えよ。知らんけど。",
    "love": "💑 【付き合うとこうなる】Ni主機能が「この人こそ運命の相手」と確信した瞬間から、脳内で壮大なラブストーリーの脚本が書き始められるで。Netflix3シーズン分くらいの展開が既に完成しとる。\n\n🌃 深夜3時に「私たちの関係の本質って何だと思う？」って哲学的LINEが飛んでくるんは日常や。寝かけた相手を叩き起こして「魂の対話」を求めるのがINFJの恋愛やねん。返信が「眠い」の2文字やったら3日間落ち込むで覚悟しとき。\n\n😮‍💨 Fe補助で相手の感情を自分のものとして引き受けすぎるから、恋人が仕事で疲れてたら自分もヘロヘロになるし、恋人が風邪引いたら自分も具合悪くなるっていう謎の共鳴現象が起きるんや。「尽くしてる」って言えば聞こえはええけど、実態は「勝手に共倒れ」やで。\n\n📓 ケンカすると一切口を利かず、Ti第三で相手の言動の矛盾を冷静に分析しながら日記に恨みを書き連ねるタイプや。で、1週間後に「あの日の発言、論理的に問題がある点を3つ指摘するね」って冷静に切り出してくるから怖すぎるわ。\n\n🚪 理想と現実のギャップに耐えられんくなったら「ドアスラム」発動や。昨日まで「運命の人」やった相手を、翌日には人生から完全消去する。LINEブロック、写真全削除、共通の友人への根回し、全部1日で完了するスピード感がエグい。\n\n💎 ただしな、本気で愛した相手には人生を捧げるレベルの献身を見せるで。あの人の「この人のためなら全部捨ててもいい」は冗談やなくてマジやねん。そのレベルの愛をくれるタイプは16タイプ中でもINFJだけや。\n\n⚠️ 【恋愛キケン度】★★★★★\n🌋 理想が高すぎて「あなたは私が思っていた人と違う」って突然の失望宣言が来る。期待値コントロールが宇宙規模で崩壊しがちやねん。\n\n📉 でも「完璧じゃなくても一緒にいたい」って伝え続けたら、Ni暴走が落ち着いて最高のパートナーになるで。攻略難易度はSSランクやけど、リターンもSSランクや。知らんけど。",
    "compatibility": {
      "best": "ENTP",
      "best_reason": "INFJのNi（直観）とENTPのNe（発想力）がぶつかったら知的スパークが止まらんのよ。お互い深い話大好きやし、ENTPの「これどう思う？」にINFJが本質ズバッと返す——この知的キャッチボールが快感すぎるねん。Fe-Tiの軸も共有してるから、考え方のベースが噛み合うんやで。",
      "worst": "ESTP",
      "worst_reason": "INFJの「深く考えたい」とESTPの「とりあえず動こうぜ」が水と油すぎるんよ。INFJがNiで未来の意味を考えてる横で、ESTPがSeで「そんなん考えてもしゃーないやん」って行動し始めるから、INFJの魂が抜けるで。お互いの劣等機能を踏み抜く最悪の組み合わせやねん。",
      "bestName": "ナルシスト拡声器",
      "worstName": "お祭りパンダ"
    }
  },
  "INTP": {
    "name": "無愛想なロボ",
    "emoji": "robot",
    "tagline": "「好きの定義とは？」と真顔で哲学し始めたらもう手遅れな天然マウントマシン",
    "traits": [
      "Wiki沼3時間は序の口",
      "「そもそも」が口癖",
      "部屋は汚いが最適配置",
      "好きな人の前で更にバグる"
    ],
    "front": "😇 物静かで知的なオーラを漂わせる「歩くWikipedia」みたいな存在や。\n\n🧠 専門分野の知識は圧倒的で、聞けば何でも論理的に——しかも図解つきで——説明してくれる頼れるインテリ。「とりあえずあの人に聞いとけ」が周囲の合言葉になっとるわ。\n\n🧊 感情に左右されず、周りがパニックになっても一人だけ「で、原因は何？」って冷静に分析し始める安定感。トラブル時に一番頼りになるんは実はこの人やねん。\n\n🔬 興味あることへの集中力は人類の限界突破しとって、気づいたら朝4時にYouTubeで量子力学の講義動画見てたりする。「オタク」って言うたらキレるけど、どう見てもオタクやで。",
    "hidden": "👿 Ti（内向的思考）が主機能やから、他人の感情は「処理不能なバグデータ」として脳内でエラー吐いて弾かれてるんや。泣いてる人の前で「泣いても問題は解決せーへんで？」って真顔で言えるのはこのタイプだけやで。悪気はゼロやねん、ゼロ。でもダメージは100やねん。\n\n🤖 Ne（外向的直観）が補助機能やから、会話が5秒で哲学的になるんや。「今日暑いな」って言うたら「そもそも『暑い』の定義って主観的やんな？ 体感温度と実際の気温の乖離について考えたことある？」って返してくるで。お前と天気の話もでけへんのかって話や。\n\n🔬 興味があることには48時間ぶっ通しで没頭するくせに、興味がないことは物理的に存在せーへんかのように無視するんや。「あの書類、提出した？」「何の書類？」「先週頼んだやつ」「そんなん知らんけど」——これ、マジで覚えてへんねん。脳のメモリ容量が「興味あること100%：その他0%」で配分されとるんや。\n\n💀 Si（内向的感覚）第三機能のせいで生活力が壊滅しとる。部屋は一見カオスやけど本人的には「最適配置」で、3ヶ月前に買ったペットボトルの位置まで把握しとる。掃除したら「あの論文どこやった！？」ってキレ始めるから触ったらあかんで。\n\n😶 そしてFe（外向的感情）が劣等機能で感情表現が完全にバグっとる。好きな人の前で余計に無愛想になる、褒められたら逆にキョドる、感動したら顔が固まる。「あの人、私のこと嫌いなんかな…」って誤解されまくってるけど、本人は全力で好意を表現してるつもりやねん。出力と入力の変換テーブルがぶっ壊れとるんや。",
    "manual": "✅ 【攻略法】「これってなんでこうなるん？」って知的好奇心をくすぐる質問で距離縮めるのが最短ルートやで。Ti主機能は「考える快感」が生きがいやから、一緒に思考実験できる相手を最も尊敬するねん。\n\n🎯 議論を楽しめる相手やって認識されたら、あの人の「信頼できる知的パートナー」リストに入れるで。ただし議論で負かしたらあかんで、「面白い反論やな、でもここはどう考える？」って対等にやりとりするのが正解や。\n\n📱 LINEの返信が3日来ーへんのは嫌いやからちゃうで。「返信する必要性を感じてへん」か「返信しようと思って宇宙の成り立ちについて考え始めたら3日経ってた」のどっちかや。催促したら「めんどくさい人」フォルダに永久格納されるから絶対やめとき。\n\n🧩 Ne補助を活用して「〇〇と△△って実は繋がってるんちゃう？」みたいな意外な関連性を提示したら、「おっ、こいつおもろいな」って目が輝き始めるで。「そもそも」って言い始めたらチャンスや、一緒にそもそもの深淵に飛び込んだれ。\n\n💣 【地雷ポイント】感情論で攻めたら脳がフリーズして再起動かかるで。「怒ってるんやけど！」「で、何が問題なん？」ってなるから、感情の翻訳作業が必要やねん。🚫 「空気読んでや」はFe劣等にとって「量子力学を3歳児に説明して」って言うてるのと同レベルの無理ゲーやで。\n\n💥 催促LINE3連投したら「この人、論理的コミュニケーションができへん人」フォルダに永久追放や。Si第三に配慮して生活習慣を批判するのもあかん、「部屋汚すぎん？」は人格否定と同義やで。知らんけど。",
    "date": "🎬 【シミュレーション】科学館かボードゲームカフェで待ち合わせや。Ti主機能が「何かの仕組みを一緒に考える」ことで快感を覚えるから、体験型の場所がベストやねん。美術館とかしっとり系はNe補助が退屈してソワソワし始めるからあかんで。\n\n🧩 謎解きイベントとかVR体験施設で一緒にミッションクリアするんや。ここであの人が「あ、わかった！このパズルの構造はな…」って早口で解説し始めたら大成功やで。「えー、すごいやん！ どうやって気づいたん？」って聞いたら30分ノンストップで語り出すから、その時の目のキラキラ具合を見逃したらあかんで。あれがINTPの最大の魅力や。\n\n🗣️ 食事は気取った店やなくてええねん。ラーメン屋でも牛丼屋でも、「あの理論って実はこういう応用できるんちゃう？」って議論盛り上がったらそれが最高のデートなんや。雰囲気より会話の質が全てやで。\n\n💔 しっとりしたムーディなデートはFe劣等がバグって「何すればいいんかわからん」ってフリーズするから逆効果や。キャンドルディナーとかは緊張で箸落とすレベルやで。\n\n📍 【おすすめスポット】科学館、ボードゲームカフェ、VR体験施設、プログラミングワークショップ、謎解きイベント、JAXA・天文台の一般公開、DIY電子工作カフェ",
    "killer": "💘 「〇〇の頭ん中、一回覗いてみたいわ。その思考回路、普通の人間には絶対たどり着かれへん領域にあるやろ。」——💥 Ti主機能に対する「知性への純粋な好奇心」が最短ルートやで。「すごい」って褒めるんやなくて「もっと知りたい」って好奇心見せるのがポイントやねん。あの人が一番嬉しいんは「認められる」ことやなくて「理解しようとしてくれる人がおる」ことなんや。Fe劣等が泣いて喜ぶで。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋愛感情をTi主機能が「分析対象」として観察し始めるで。「胸がドキドキする→心拍数上昇→原因は？→あの人を見た時に発生→仮説：好意の可能性あり→追加データ収集が必要」って、恋心を科学論文のプロセスで検証しとるんや。\n\n🤔 「好きという感情の定義とは何か？」と真顔で考え始めたら、それはもう完全に恋に落ちとる証拠や。哲学的になってきたらもう手遅れやで。\n\n📊 デートプランをGoogleスプレッドシートで管理して「移動効率を最適化したルート」を提案してくるんやけど、肝心の「相手が楽しいかどうか」のパラメータが設定されてへんのがINTPクオリティや。「この動線だと徒歩移動が最小化されるんやけど」って力説されても「は？」ってなるわな。\n\n📅 記念日を忘れるんやなくて「記念日という概念の必要性」を疑問視しとるんや。「なぜ特定の日に感情を表明する必要があるのか、毎日大事にすればよいのでは？」って理屈は正しいけど、それで許されると思うなよって話やで。\n\n🖥️ ただしな、一度「この人を幸せにする」ってTiが結論出したら、相手の全データを分析して「この人の幸福度を最大化する最適解は何か」を本気で計算し始めるで。睡眠時間、栄養バランス、ストレス要因まで分析して改善提案してくるんや。愛情表現がデータドリブンすぎて怖いけど、本気度はガチや。\n\n😶 Fe劣等のせいで「好き」って言葉がどうしても口から出ーへんのやけど、代わりに「君と議論してる時間が一番脳のパフォーマンスが上がる」とか言うてくるで。翻訳すると「大好き」やねん。変換テーブル持っとかんと付き合われへんで。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n🔀 感情のすれ違いが日常茶飯事やけど、悪気はほんまにゼロやねん。マイナスにもゼロにもならん、ただ変換がバグってるだけや。\n\n😶 「なんで怒ってるの？」が本気でわかってへんから、怒りの理由を論理的に説明したれ。「私は怒っている。理由は3点ある」って言うたら真剣に聞いてくれるで。\n\n💪 根気強く感情の翻訳作業ができる人じゃないと持たへんけど、あの人なりの不器用すぎる愛に気づけたら、これほど純粋な愛はないで。知らんけど。",
    "compatibility": {
      "best": "ENTJ",
      "best_reason": "INTPの「理論は完璧やねんけど実行力ゼロ」とENTJの「実行力の鬼やけどたまに考え浅い」が完璧に補い合うねん。Ti主機能のINTPがロジック組み立てて、Te主機能のENTJがそれを現実にする——この連携プレーは最強やで。Ni-Neの直観同士も相性バッチリやねん。",
      "worst": "ESFJ",
      "worst_reason": "INTPの「感情？ それ食べれるん？」とESFJの「みんなの気持ち大事にしよ！」が致命的にすれ違うんよ。ESFJが「空気読んでや」って言うたびにINTPの脳がフリーズするし、INTPの「そもそも論」にESFJが「そういう話してるんちゃうねん！」ってブチギレる無限ループやで。",
      "bestName": "やかまし上司",
      "worstName": "偽善ウミガメ"
    }
  },
  "ISTP": {
    "name": "偏屈狼",
    "emoji": "wolf",
    "tagline": "クールやなくてコミュ障なだけやのに、沈黙が勝手にかっこよく見えてしまう不器用オオカミ",
    "traits": [
      "分解して組み立てるのが快感",
      "五感バキバキの刺激中毒",
      "直感で問題解く天才（説明はできん）",
      "束縛されたら即蒸発"
    ],
    "front": "😇 寡黙で頼りがいのある「黙って背中で語る」タイプや。口数は圧倒的に少ないんやけど、やることはきっちり以上にやる実力派やで。\n\n🔧 手先がごっつ器用で、壊れたもんを直す、何かを組み立てる、DIYする、っていう「実際に手を動かす」ことに関しては16タイプ中ぶっちぎりの才能持っとる。\n\n✋ 趣味や仕事に対する集中力がえげつなくて、「ゾーンに入ったら話しかけても聞こえてへん」レベル。周囲は「あの人の集中力、人間やめてるやろ」って半分尊敬、半分恐怖しとるで。\n\n🕶️ 余計なことを言わへんから「大人やな〜」「クールやな〜」って勝手にカッコいいイメージ持たれるんやけど、実態は後で話すわ。",
    "hidden": "👿 Ti（内向的思考）主機能やから「物の仕組みを理解する」ことに異常な快感を覚えるんや。子供の頃にリモコン分解して怒られた経験、絶対あるで。大人になっても「なんでこれ動くんやろ」って気になったら止められへんねん。バイクのエンジン、PCの自作、DIY、ガジェット——全部「分解して仕組み理解して組み立て直す」が趣味や。\n\n🏍️ Se（外向的感覚）が補助機能で五感がバッキバキに鋭いんや。スリルと刺激を求めてバイク飛ばす、筋トレで限界突破する、格闘技で殴り合う。「今この瞬間」の体感を全身で味わいたいタイプやから、デスクワークだけの日常は酸欠になるで。\n\n🔮 Ni（内向的直観）が第三機能で、直感的に問題の答えがわかるんやけど、「なんでわかったん？」って聞かれても「いや…なんとなく」としか言えへんのが致命的や。本人も理由わかってへんねん。会社で「根拠は？」って聞かれた時の沈黙がごっつ長いで。\n\n💀 最大の弱点がFe（外向的感情）劣等機能や。他人の感情を読み取る機能がほぼオフライン状態で、「なんで怒ってるの？」が本気でわからへんねん。彼女が泣いてる時に「泣いてるな…で、何すればいいん？」って思ってるし、好きな人の前ではコミュ障がさらに加速して、結果的に「嫌われてるの？」って誤解される不器用さ。\n\n💨 そして束縛されたら本気で蒸発するで。「今どこ？」「何してるの？」「誰といるの？」のLINE3連投で酸素がなくなる感覚になって、最悪の場合は予告なしに連絡途絶える。行方不明届出される前に帰ってこいよって話やけど、本人は「ちょっと一人になりたかっただけ」やねん。",
    "manual": "✅ 【攻略法】一人の時間を邪魔したら即アウトや、これだけは絶対に覚えとけ。🏝️ ISTPにとって一人時間は「充電」やねん。スマホの充電中にケーブル抜くようなもんやで、邪魔したら。\n\n🎮 共通の趣味見つけて「並んで同じことする」時間を作るのが最強の攻略法やねん。Ti主機能は「一緒に考える」より「一緒にやる」で心を開くんや。ボルダリング、釣り、DIY、ゲーム——言葉やなくて「体験の共有」で距離縮めるんがコツやで。\n\n🔧 Se補助やから「実際に見せる」「一緒に体験する」のが言葉の100倍伝わるんや。「あの店美味しいらしいで」より「今から行こ」の方が効くし、「好きやで」より「壊れたから直しといたで」の方が愛情表現やねん。\n\n📱 LINEの返信が遅くても絶対に責めたらあかんで。あの人にとってLINEは「必要な情報を伝えるツール」であって「感情を共有するツール」やないねん。既読つかへんのは「スマホ見てへん」だけで、無視やないで。Fe劣等の人間にリアルタイムの感情共有を求めるのは無理ゲーや。\n\n💣 【地雷ポイント】「何考えてるん？」の詰問はFe劣等の逃走トリガーやで。あの人は考えてることを言語化するのがごっつ苦手やねん。Ti主機能の思考は「言葉」やなくて「構造」で処理されてるから、「何考えてるか言って」は「脳の設計図を口頭で説明して」と同義なんや。\n\n🚫 過度なスキンシップや感情の押し付けは窒息するで。「好きって言って」「もっと気持ち表現して」はFe劣等にとって拷問や。束縛は酸欠、監視は致命傷、予定ギチギチは窒息。Se補助は「自由」を奪われると本気で消えるからな。知らんけど。",
    "date": "🎬 【シミュレーション】ホームセンターかガジェットショップで待ち合わせや。「何これ、おもろいな」ってTi主機能が反応する場所がベストやねん。おしゃれなカフェとかは緊張してコーヒーの味もわからんくなるで。\n\n🔨 DIYワークショップで一緒に何か作るのが最高のデートプランや。Se補助が「手を動かす快感」で活性化して、普段しゃべらへんISTPが「ここはこうした方がええで」って急にイキイキし始めるから見逃すなよ。完成品見て「やるやん」って短くお互い認め合う——これがISTPにとっての「最高にロマンチックな瞬間」やで。\n\n🏍️ 帰りはドライブがええわ。Se補助はスピード感と景色の変化で気分が上がるから、「どこ行く？」「適当に走ろ」のノリが最高やねん。目的地決めんでええ、走ること自体が目的や。窓開けて風感じながら黙って隣に座る——Fe劣等のISTPにとって「沈黙が気まずくない相手」が最大の信頼の証やで。\n\n🙅 長時間のおしゃべりデート、感動系映画（泣くタイミングわからんくてパニックになる）、プラン詰め込みすぎのデートはあかん。自由に動ける余白を残しとかんと窒息するで。\n\n📍 【おすすめスポット】DIYワークショップ、ガジェットショップ巡り、ドライブ（行き先は適当でOK）、釣り、ボルダリング、バイクツーリング、キャンプ、射撃場・アーチェリー体験",
    "killer": "💘 「〇〇の手際の良さ、見てるだけでめっちゃ気持ちええわ。あの集中してる時の横顔、ごっつかっこええねん。もっとその世界教えてや。」——💥 Ti主機能の「技術」とSe補助の「行動」を同時に褒めるこの一言が最強やで。あの人は「すごい」って言われるより「見てくれてたんや」って感じた時にFe劣等が溶けるんや。自分の得意分野に本気で興味持ってくれる人にめっちゃ弱いから、「教えて」の一言で心の扉ガバッと開くで。知らんけど。",
    "love": "💑 【付き合うとこうなる】「付き合おう」って明確な宣言やなくて、気づいたらなんとなく一緒におる——っていう始まり方が多いんや。Ti主機能は「関係性にラベル貼る」のが苦手やから、「俺ら付き合ってるんかな？」を本人すら把握してへんことがあるで。\n\n🔧 愛情表現は100%行動派や。「好き」とは絶対言わへんけど、彼女の車のタイヤ交換黙ってやっとく、壊れた棚を気づいたら直しとる、重い荷物は無言で持つ。Se補助の「今この瞬間にできること」で愛を示すタイプやねん。\n\n😒 でもな、「ありがとう」って言われると照れくさくて「別に。暇やったし」って素っ気なく返すんや。Fe劣等は感謝を受け取るのも苦手やねん。「喜んでもらえた」って内心めっちゃ嬉しいくせに、顔が「確定申告終わった」くらいの無表情やから、相手は「え、迷惑やった？」ってなるわな。\n\n😵‍💫 束縛されると酸素がマジでなくなる感覚になるで。「今どこ？」「何してる？」「誰といるの？」のLINE攻撃が3日続いたら、Se補助が「自由を取り戻せ」って警報鳴らして、最悪の場合は予告なしに蒸発する。「ちょっとバイクで走ってくる」って出て行って3日帰ってけーへんとか普通にあるで。\n\n🫥 好きな人の前でこそ無愛想になる矛盾がエグくて、「嫌われてるのかな」と相手を不安にさせる天才やねん。Fe劣等は「好きな気持ちをどう表現したらええかわからん」から、結果的に塩対応になるんや。でも行動をよく見てみ？ 好きな人の話は全部覚えてるし、さりげなく相手の好きなもん買って冷蔵庫に入れとるし、朝起きたらコーヒー淹れてくれとるし——全部、言葉にでけへん「好き」の塊やで。\n\n🏍️ Ni第三が「この人とは長く一緒におれる」って直感で判断したら、言葉にはせーへんけど一生モノの覚悟決めとるで。ISTPの忠誠心は口やなくて行動に全部出てるんや。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n🏝️ 一人時間を確保してあげれば意外と長続きするタイプやで。週末に「今日は一人で好きにしいや」って言えるかどうかが分かれ道やねん。\n\n🤐 「何考えてるの？」を封印して、代わりに行動を観察したれ。あの人の「好き」は全部行動に翻訳されてるんや。\n\n🔍 愛されてる実感は正直薄いで。でもな、あの人が黙ってあんたのために動いてくれてる瞬間を見逃さへんかったら、これほど信頼できるパートナーはおらんで。知らんけど。",
    "compatibility": {
      "best": "ESTJ",
      "best_reason": "ISTPの「黙って手動かすわ」とESTJの「計画通りに仕切らせてもらうで」が意外とめっちゃ噛み合うねん。Ti-Teで論理的な思考ベースが一緒やから無駄な感情論にならへんし、ISTPの職人気質をESTJが「こいつデキるやん」って評価してくれるんよ。Se-Siの感覚共有もスムーズやで。",
      "worst": "ENFJ",
      "worst_reason": "ISTPの「一人にしてくれ」とENFJの「みんなで一緒に成長しよ！」が真っ向から激突するんよ。ENFJがFeで感情的なつながり求めてくるのがISTPには窒息レベルやし、ISTPの無愛想さがENFJには「冷たい」って映るから、お互い傷つけ合うだけの関係になりがちやねん。",
      "bestName": "爆走ライオン",
      "worstName": "ひだまりレトリバー"
    }
  },
  "ENTJ": {
    "name": "やかまし上司",
    "emoji": "bigmom",
    "tagline": "会議は15分、雑談は犯罪、5年計画は毎週アプデ中の支配欲帝王",
    "traits": [
      "支配欲∞（Te暴走）",
      "脳内5年計画アプデ中",
      "弱音吐いたら死ぬ病",
      "部下（恋人）育成ガチ勢"
    ],
    "front": "😇 会議室でもカフェでも、気づいたらこの人が仕切ってる「生まれながらのCEO」タイプやねん。\n\n💼 Te主機能がフル回転してるから、決断のスピードがえげつない。ランチの店すら3秒で決める。優柔不断？ そんな単語はこの人の辞書から物理的に削除されてるで。\n\n🎯 Ni補助が描く未来ビジョンは常に3手先を読んでて、「で、次どうすんの？」が口癖。プレゼンさせたら社内で右に出る者おらんし、飲み会の幹事やらせても店選び・予算管理・二次会手配まで完璧にこなすねん。\n\n🛡️ 困ってる人見たら「で、何が問題？ どうしたい？ 期限は？」って即・課題解決モードに入るから、相談した側は「この人に任せとけば間違いない」って安心するんよな。\n\n✨ Se第三機能のおかげで外見にも気ぃ遣うタイプやで。時計、靴、名刺入れ——細部にこだわるから、見た目の説得力もごっつある。周囲からは「あの人、なんか持ってるオーラ違うよな」って一目置かれてるわ。",
    "hidden": "👿 リーダーシップと独裁の境界線？ そんなもん、この人の脳内地図にはそもそも描かれてへんねん。\n\n👑 Te主機能が暴走すると「俺の判断＝正義」になるから、反論した瞬間に脳内で「無能フォルダ」にぶち込まれるで。会議で意見言うたら「で？ 代案は？」って即座に詰めてくるし、代案出したら「それ、3ヶ月前に俺が却下した案やん」って秒で論破してくるねん。ChatGPTより返しが速いわ。\n\n🎭 Fi劣等機能がほんまにヤバいんよ。自分の感情に向き合うのが怖すぎて、弱音吐くくらいなら仕事に逃げる。深夜2時にSlack打ってるんは「やる気がある」んやなくて「自分の弱さと向き合いたくない」だけやねん。Netflixでちょっと泣けるシーン出てきたら、速攻スマホ取り出して為替チェック始めるで。\n\n📊 恋人にもKPI設定しようとするし、友達の人生にも「それ、効率悪くない？」って口出しする。本人は「アドバイスしてあげてる」つもりやけど、周りからしたら「頼んでねぇよ」の嵐やねん。\n\n🥺 でもな、ほんまの裏の裏を言うと、この人が一番怖いんは「自分が必要とされなくなること」やで。支配してるように見えて、実は「みんなを引っ張れてる自分」に存在意義を感じてるだけやねん。チームから外された日にゃ、家で枕に顔埋めて「…俺、いらんかったんか」ってなってるわ。知らんけど。",
    "manual": "✅ 【攻略法】まず大前提——イエスマンになったら終わりやで。この人が一番嫌うんは「自分の意見ない奴」やねん。💪 自分の考えバシッと言いつつ、最終ジャッジは相手に預ける——これが黄金バランスや。「なるほど、確かにそれもアリやな。けど俺はこう思うねんけど、どう？」ぐらいの距離感が最高やで。\n\n⚖️ Ni補助にアクセスしたかったら、未来の話振ったれ。「5年後どうなりたい？」って聞いたら目ぇキラキラさせて2時間は語るわ。そこで「おもろいな、その発想はなかったわ」って本気で感心したら、「こいつ、知的に対等やん」って認定されるねん。\n\n🫂 一番大事なんはな、弱音吐いた瞬間の対応やで。年に1回あるかないかの「…ちょっと疲れた」を絶対に茶化したらあかん。スクショ撮って家宝にするレベルの激レア発言やからな。「頑張りすぎやねん、たまには休みや」って静かに言うたったら、表情には出さんけど内心で号泣してるで。ほんまに。\n\n📱 連絡はダラダラLINEより要件まとめて短く。「了解です！」のスタンプ1個で十分やねん。既読つけて返さんのは忙しいだけやから、催促は逆効果やで。\n\n💣 【地雷ポイント】公の場で恥かかせたら、一生かけても修復できへんレベルの怒りが来るで。🚫 優柔不断な態度は「無能」の烙印。「どっちでもいい〜」は禁句中の禁句や。😤 感情論でゴリ押しするのも最悪やねん、「泣けば許されると思ってんの？」って冷たくなるで。💥 あとな、この人の計画や段取りにケチつけるのは国家反逆罪レベルやからな。やるなら覚悟しとき。知らんけど。",
    "date": "🎬 【シミュレーション】まず予約困難な名店にドーンと入店するとこから始まるで。この人、Se第三機能で「いい店知ってる俺/私」にプライド持ってるから、「ここ、すごいな！ どうやって予約取ったん？」って聞いたら内心ドヤ顔MAXや。😏 メニューは聞く前に「ここのシェフのおまかせが最強やねん」って仕切り始める。ワインも「この料理にはこれや」って迷いゼロ。正直うっとうしいけど、ここは素直に「さすがやな！」って乗っかっとくのが正解やで。\n\n🌃 食後は夜景見えるルーフトップバーに移動や。カクテル片手に将来の野望語り出すから、「その計画のここがおもろいな」って具体的にツッコんだれ。曖昧に「すごいね〜」だけやと「こいつ聞いてへんな」ってバレるで。Ni的ビジョンの話に本気で乗ってくれる相手には「こいつ、俺の右腕になれるんちゃうか」って脳内評価が爆上がりするねん。\n\n🗣️ デート終わりに「次はどこ行きたい？ 私が探しとくわ」って主導権取ってみ。一瞬「は？」って顔するけど、「おっ、やるやん」って内心めっちゃ嬉しいねん。支配したいくせに、対等に立ってくれる相手にごっつ弱いのがこの人やで。ほんまに。\n\n📍 【おすすめスポット】予約困難な名店（ミシュラン星付きやと最高）、ルーフトップバー、高級ホテルのアフタヌーンティー、スポーツ観戦VIP席、ワインテイスティングイベント、話題のオムニバスレストラン",
    "killer": "💘 「あんたの描いてるビジョン、ごっつワクワクするわ。でもな、たまには肩の力抜いてもええんやで。弱いとこ見せてくれたら、もっと信頼できるわ。」——💥 前半でNi的ビジョンを認めつつ、後半でFi劣等の鎧を脱がす許可証を渡すんや。この二段構えが致命傷になるで。🔑 「ついていきたい」だけやと部下と同じ。「弱さも見せてや」まで踏み込んで初めて「こいつは特別や」って認定されるねん。知らんけど。",
    "love": "💑 【付き合うとこうなる】交際初日から「俺たちの5年計画」のGoogleスプレッドシートが共有されてくるで、覚悟しとき。\n\n📋 デート先、旅行先、記念日——全部「俺が最適解を出してやるわ」のスタンスで仕切ってくる。相手の意見？ 聞くフリはするで。議事録に残すフリまでする。けど最終決定権は絶対に手放さへん。マッチングアプリの自己紹介に「主導権は譲れません」って書いといた方がええレベルや。\n\n💪 「俺/私がいないとダメでしょ？」が口癖になって、気づいたら人生プラン全部仕切られてるんやけど、不思議と結果はちゃんと出るから文句言えへんのがまたタチ悪いねん。恋人のキャリア相談に乗ったら本気でコンサルし始めて、実際に年収上がったりするからな。\n\n🌟 相手が成果出したら、自分のことみたいに「やったやん！ 俺の見立て通りや！」って喜ぶんやけど、成長止まると「最近ダレてへん？ 目標見失ってない？」って面談始まるで。恋人ちゃうやん、もう上司やん。\n\n🌙 でもな、年に1回あるかないかの深夜の弱音タイムがあるねん。「…なぁ、俺ってやりすぎやろか」ってボソッと言うた後に「今のナシ、忘れて」って言うんやけど——これ、「聞いてほしい」のサインやからな。ここでちゃんと受け止められるかが分かれ道やで。Fi劣等が顔出した瞬間を逃したらあかん。\n\n⚠️ 【恋愛キケン度】★★★★☆\n⚔️ 主導権争いが日常化するから、戦う覚悟か任せる覚悟のどっちかが必要やで。\n\n🏰 でも「この人についていく」って決めたら、世界一頼もしくて世界一面倒見のいいパートナーになるのはガチや。\n\n📈 恋人を成長させる力は全タイプ中No.1。ただしそれが「愛」なのか「マネジメント」なのかは本人もわかってへんけどな。知らんけど。",
    "compatibility": {
      "best": "INTP",
      "best_reason": "ENTJの「ビジョンを現実にするで！」とINTPの「その理論的根拠、こうやで」が噛み合ったら無敵やねん。Te主機能のENTJが仕切って、Ti主機能のINTPが裏で完璧なロジック組む——この役割分担が天才的やで。Ni-Neの直観の掛け算でイノベーション起こしまくるわ。",
      "worst": "ISFP",
      "worst_reason": "ENTJの「効率！結果！計画通り！」とISFPの「自分のペースで感じたいねん…」が宇宙レベルで噛み合わへんのよ。ENTJがTe全開で指示出すたびにISFPのFiが傷つくし、ISFPの「今はやりたくない」がENTJには「サボり」にしか見えへんから、もう地獄絵図やで。",
      "bestName": "無愛想なロボ",
      "worstName": "雨宿りうさぎ"
    }
  },
  "ESTJ": {
    "name": "爆走ライオン",
    "emoji": "lion",
    "tagline": "ルールは神、例外は死罪、Excel管理で世界を回す完璧主義の不器用王様",
    "traits": [
      "ルール=聖典（Te-Si暴走）",
      "記念日Excel管理",
      "甘え方がわからん病",
      "完璧主義のガラスハート"
    ],
    "front": "😇 責任感の化身。この人に仕事任せたら120%で返ってくるし、約束の5分前行動は当たり前やねん。\n\n🦁 Te主機能が常にフル稼働やから、会議では「で、結論は？ アクションアイテムは？ 期限は？」の3点セットを即座に叩き出す。上司にも部下にも同じ態度やから、周囲からは「あの人、ブレへんよな」って信頼が厚いんよ。\n\n📊 Si補助が過去の経験をデータベースみたいに蓄積してるから、「前回こうやってうまくいった」「この方法は3年前に失敗した」って具体例がポンポン出てくる。マニュアル作らせたら社内で一番やで。\n\n🔥 有言実行の塊やから「この人に任せれば大丈夫」の安心感がハンパない。飲み会の幹事やらせても、店の予約・アレルギー確認・二次会手配・タクシー手配まで全部やる。頼んでもないのにやる。もはや軍隊の兵站担当やで。\n\n🤝 グループでは自然とまとめ役を買って出て、「ほな、私が仕切るわ」の一言で全員が安心する——そういう存在やねん。",
    "hidden": "👿 他人のミスを見つけた瞬間のアドレナリン、実はごっつ出てるで。心の中で「この下手くそが！ なんでマニュアル通りにでけへんねん！」ってdisるのが密かな快感になってるねん。Te主機能が「効率と正確さ」を求めるあまり、自分の基準に達してない人間は全員「レベル低い」認定やで。\n\n📋 Si補助が「過去の成功体験」に固執しすぎるから、「昔からこうやってきた」が口癖になってる。新しいやり方提案されても「それ、前にうまくいかへんかったやん」って即却下する頑固さがエグい。DXとか言われても「Excelで十分やん」って本気で思ってるタイプやで。\n\n🛡️ 完璧主義の鎧が分厚すぎて、誰にも弱みを見せられへん。「助けて」の3文字が喉から出てこーへんのよ。疲れてても「気合が足りない」で片付けるし、体調悪くても「根性で治る」って本気で言うからな。Fi劣等が自分の感情を認識させへんのよ。\n\n😤 ルール破る奴に対する怒りは火山レベルやで。遅刻した後輩に「時間も守れへん人間に何ができるねん」って心の中で死刑宣告してるし、信号無視する歩行者にすらイライラしてる。\n\n🥺 でもほんまの裏の裏はな、「こんなに頑張ってるのに誰も認めてくれへん」「助けてって言いたいのに言えへん」っていう不器用な寂しがり屋やねん。甘え方がバグってるから、イライラで表現してまうんよ。「怒ってる」んやなくて「甘えたい」だけなんやで、この人。知らんけど。",
    "manual": "✅ 【攻略法】最低条件は「時間厳守・約束厳守」やで。これができへん人間はスタートラインにすら立てへん。Si補助が「信頼＝実績の積み重ね」で判断するから、小さな約束をコツコツ守ることが一番効くねん。「来週の月曜までに送るわ」って言うたら、日曜の夜には送っとけ。それだけで信頼度爆上がりやで。\n\n🫂 この人を攻略する最大のカギは「甘えさせること」やねん。ただし直球で「甘えてええんやで」って言うたらフリーズするから、さりげなく行くんや。「今日は私が全部決めたるから、あんたは何もせんでええ」って自然に主導権奪ったれ。一瞬「は？」って顔するけど、内心では「…こういうの、ちょっと嬉しいかも」ってなってるで。\n\n😭 「頑張らんでええんやで」のひと言は核爆弾級に効く。完璧主義の鎧がボロボロ崩れて涙腺崩壊するから、その瞬間は絶対に茶化したらあかんで。年に1回あるかないかのレアイベントやからな。\n\n📝 報連相をちゃんとする人間はめっちゃ評価される。「あの件、こうなったで」って事後報告するだけでも「こいつ、ちゃんとしてるやん」って株が上がるわ。\n\n💣 【地雷ポイント】ドタキャンは死罪やで、冗談抜きで。🚫 遅刻は信頼崩壊の第一歩。Si補助が「この人は時間守れへん人」って記録したら、上書き不可能やからな。😤 「適当でええやん」「まぁなんとかなるやろ」は全存在の否定と同義やで。💥 公の場でのダメ出しは絶対アウト。プライド粉砕されたら二度と口きいてくれへん。🔥 あとな、ルールや段取り無視して「ノリでいこうぜ〜」とか言うたら、心の中の軽蔑メーターが振り切れるからな。ほんまにやったらあかんで。知らんけど。",
    "date": "🎬 【シミュレーション】まず「予約済み」が絶対条件やからな。当日ノープランとか、この人にとっては拷問レベルやで。きっちり5分前に到着して「ちゃんと来てるやん」って安心させるとこからスタートや。🥩 予約してある高級焼肉店で「ここのタン塩は最高やねん、俺/私が見つけた店やで」って仕切り始めるから、「さすがやな！ めっちゃ美味い！」って全力リアクションしたれ。Si補助が「前回ここ来た時に…」って思い出話始めたら、ちゃんと聞くんやで。\n\n📝 食後に「次のデートはいつにする？ 候補日3つ出すわ」って言い出したら脈ありやで。この人が先の予定立てようとしてくるんは、「あんたとの時間を確保したい」っていう不器用な愛情表現やねん。ここで「いいね！ じゃあ次は私が店探しとくわ」って返したら内心キュンキュンしてるわ。\n\n🎁 サプライズは諸刃の剣やで。「聞いてないんやけど？」が先に来るタイプやから、やるなら「実はサプライズ用意してるねんけど、今出してもええ？」って事前許可取るスタイルが安全やねん。ほんまめんどくさいやろ？ でもそれがこの人なんよ。知らんけど。\n\n📍 【おすすめスポット】予約済みの名店（事前にメニュー確認済みやとなお良し）、ゴルフ（スコア管理できるから）、スポーツ観戦（応援にもルールがある）、老舗旅館（伝統にSi補助が反応する）、達成感のあるハイキング",
    "killer": "💘 「いっつも完璧にこなしてるけどさ、あんたかて人間やん。私の前ではただのダメ人間でええんやで。甘えてもバチ当たらんよ？」——💥 完璧主義の鎧を脱がせる許可証と「甘えていい場所」を同時に提示するんや。Fi劣等が「感情を出してもいいの？」ってパニック起こすけど、それは心の扉が開きかけてる証拠やで。🔑 「あんただけ特別」感を添えたら、完璧主義のガラスハートが震えて涙腺決壊するわ。ほんまにこれ言えるんは選ばれし者だけやで。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋人にも「報告・連絡・相談」のフォーマットが適用されるで、覚悟しとき。\n\n📊 記念日はExcelで一元管理。初デート記念日、付き合った記念日、初キス記念日——全部タイムスタンプ付きで記録されてる。Googleカレンダーにリマインダーまでセットしてるから忘れることは100%ないねんけど、その管理方法がもはやプロジェクトマネジメントやねん。\n\n😤 Te主機能が恋愛にも発動するから、デートの感想を「フィードバック」として求めてくる。「今日のデート、10点満点で何点？ 改善点ある？」とか真顔で聞いてくるで。次のデートには本気で改善してくるから、もはやPDCAサイクル回してるわ。\n\n🛡️ 完璧主義すぎて「理想の恋人像」に自分も相手もハメようとするから、相手の小さなミスにイライラする。でも本人は「怒ってない」って言い張るねん。顔怖いけど。\n\n😭 ほんまの姿はな、自分の弱さを受け止めてくれる相手を死ぬほど求めてるガラスのライオンやねん。「甘えたい」のに「甘え方がわからない」から、代わりに完璧な自分を見せ続ける——それがこの人の不器用な愛情やで。たまに限界来て「…もう無理かも」ってポロッと言う日があるねんけど、その瞬間に「頑張らんでええよ」って抱きしめられたら一生忘れへんタイプや。\n\n🏠 家事も仕事も完璧にこなすけど、「ありがとう」が1日なかっただけで心が折れるガラスのライオン。推し活みたいに「ありがとう」連打しとくのが長続きの秘訣やで。\n\n⚠️ 【恋愛キケン度】★★★★☆\n😵 相手にも完璧を求めすぎて息苦しくなるのが最大リスクや。\n\n🫶 でも「がんばらなくていいよ」の一言で全部救われるタイプ。\n\n💕 甘えさせ上手な人が最強の相性——というか、甘えさせてくれる人にしか心開かんで。知らんけど。",
    "compatibility": {
      "best": "ISTP",
      "best_reason": "ESTJの「ルール通りにきっちりやるで！」とISTPの「黙って完璧に仕上げるわ」が最高のコンビやねん。Te-Tiで論理ベースが合うし、Si-Seの感覚機能もバランスええから、仕事でもプライベートでも「こいつとおったら安心やわ」ってなるんよ。お互い口数少なくても信頼し合えるタイプやで。",
      "worst": "INFP",
      "worst_reason": "ESTJの「ルールは絶対や！」とINFPの「自分の気持ちに正直に生きたいねん…」がバチバチにぶつかるんよ。ESTJがTe-Siで「前例通りにやれ」って言うたびに、INFPのFi-Neが「そんな画一的な生き方無理やし」って反発する。お互いの大事にしてるもんが真逆やから、歩み寄りがごっつ難しいねん。",
      "bestName": "偏屈狼",
      "worstName": "優しさ過剰装備"
    }
  },
  "ENTP": {
    "name": "ナルシスト拡声器",
    "emoji": "parrot",
    "tagline": "会話5秒で脱線、議論は勝つため、落としたら冷める知的マウントモンスター",
    "traits": [
      "議論＝脳の快楽物質",
      "落としたら即冷めハンター",
      "口だけ天才（実行力？何それ）",
      "飽き＝酸素不足"
    ],
    "front": "😇 どんな話題振っても秒で返してくる「歩くWikipedia」やねん。飲み会ではこの人がおるだけで場が5倍おもろくなる。\n\n💡 Ne主機能がアイデアの爆速生成装置やから、「こういうのどう？」「あ、待って、もっとおもろいの思いついた」が無限ループする。ブレスト会議では無双やし、雑談の中から金脈みたいなアイデア掘り当てることもあるで。\n\n📚 Ti補助で論理構築力もエグいから、話に筋が通ってて「こいつの話おもろいし、なんか賢いな」って思わせる力がある。知識の幅がバグっとるから、宇宙の話してたと思ったら急に中世ヨーロッパの税制の話になって、そっからラーメンの話に飛ぶ。全部繋がってるのがまた怖いねん。\n\n🎭 Fe第三機能のおかげで社交性もあるから、初対面の人ともすぐ打ち解ける。パーティの主役ポジションが板についてるわ。「この人と話すと人生楽しくなる」って思わせる天才やで。",
    "hidden": "👿 議論の目的？ 「正しさの追求」やなくて「相手を論破する快感」やで。Ti補助がロジックの武器を無限に製造するから、相手が感情的になればなるほど冷静になって追い詰めるねん。議論に勝った瞬間の脳汁ドバドバは、もはやソシャゲのガチャでSSR引いた時と同レベルや。\n\n🦋 Ne主機能の「新しいもの好き」が恋愛にも適用されてしまうのが最大の闇やねん。狩りの瞬間が最高潮で、口説いて口説いて口説き落とした——その瞬間に「あ、クリアしたわ」って冷め始める。マッチングアプリで右スワイプしまくって、マッチしたら満足して返信せえへんタイプそのものやで。\n\n🗣️ 口は宇宙一達者やけど、行動が伴わへん。「来月起業する」「あのプロジェクト絶対やる」「ジム通い始める」——全部口だけで終わるねん。Si劣等が過去の反省をガン無視するから、同じ失敗繰り返しても「次は違う」って本気で思ってる。学習能力ゼロちゃうで、「学習する気がゼロ」やねん。\n\n🎭 Fe第三の「みんなと仲良くしたい」が中途半端に発動するから、「友達100人」おるように見えるけど、深夜に本音で電話できる相手は実はゼロ。「親友いない」んやなくて「深い関係が怖い」のが本音やで。知らんけど。\n\n💀 一番タチ悪いのは、自分が一番おもろいと本気で信じてるとこやな。他人のスベった話に「あ〜、それはこう言えば良かったのにね」ってアドバイスしてくるけど、お前がスベった時は誰もツッコまれへんねん。空気が凍るだけやで。",
    "manual": "✅ 【攻略法】この人を落とすには「知的に対等」であることを証明するのが絶対条件やで。🧠 「それは違うと思うわ。なぜかっていうと——」って冷静に反論できる人だけが「おっ、おもろいやん」って認定されるねん。感情論はNG、あくまでロジックで戦え。\n\n⚡ 退屈が最大の敵やから、「予定通りのお付き合い」は死を意味するで。毎回同じカフェで同じ話とかしたら3回目で消えるわ。「来週、こんなイベントあるねんけど、行ってみぃへん？」って常に新しいネタ提供し続けるのが鉄則やねん。\n\n🎯 Ne主機能にアクセスしたかったら「もしも〜だったらどうする？」系の質問が最強やで。「もし100万円あったら何する？」→「1000万やったら？」→「1億やったら？」って広げていったら、目ぇキラキラさせて永遠に喋り続けるから。その時の顔、ほんまに楽しそうやで。\n\n🏃 追いかけてくる相手には冷めるから、適度に「手に入らない感」出すのも大事やねん。既読つけて30分放置とか、たまに予定合わへん日作るとか。「こいつ、俺に完全には堕ちてへんな？」って思わせたら勝ちや。\n\n💣 【地雷ポイント】「すごいなぁ〜」って褒めるだけのイエスウーマン/イエスマンは3日でポイやで。🚫 感情的に怒ったり泣いたりしたら「つまんないやつ」判定されて終了。🥱 同じ話題の繰り返しは飽き→消滅の黄金コンボやねん。💥 「ちゃんとしてよ」「約束守ってよ」の正論パンチはSi劣等を直撃するから、逃走モードに入るで。🔥 あと、この人の話を遮るのは最悪やからな。知的マウント取られてると感じた瞬間に「こいつ敵や」認定されるで。知らんけど。",
    "date": "🎬 【シミュレーション】「おもろい店見つけたんやけど、今から行かへん？」の突発召集が正解やで。Ne主機能は「予定通り」が一番テンション下がるから、当日の思いつきで動くのが最高やねん。「え、今から？ ちょっと待って…いや、行くわ！」って巻き込まれてくれる相手を求めてるんよ。\n\n🧩 デート先は脳みそ使う場所一択やで。謎解きカフェか脱出ゲームで「はい、ここのヒントはな——」って推理力バトルするのが最高のデートやねん。一緒に謎解いてる時の集中力と興奮がこの人にとっての「ロマンチック」やから。水族館とかイルミネーションとか、しっとり系は5分で飽きるで。\n\n🎲 デート中も話題が5秒で脱線するから、「さっき何の話してたっけ？」が3回は起こる。気にすんな、それがデフォルトやねん。むしろ一緒に脱線して「あ、そういえば——」って新しい話題ぶっ込んでいったら「こいつ、会話のテンポ合うやん」って好感度爆上がりやで。\n\n🍕 飯は「初めて行く店」が鉄則。「ここ前も来たよね」って言われた瞬間に目から光が消えるからな。新オープンの店、変わったコンセプトの店、外国料理の専門店——とにかく「初体験」を供給し続けるんや。\n\n📍 【おすすめスポット】脱出ゲーム、謎解きカフェ、お笑いライブ、トークイベント、新オープンの話題店、ポップアップストア、即興劇ワークショップ、変わったテーマのバー（ボードゲームバー、推理バーとか）",
    "killer": "💘 「あんたの頭ん中ってどうなってるん？ 毎回予想の斜め上いくから、脳みそハックされてる気分やわ。一生飽きひんと思うで。」——💥 知的好奇心の対象として認めつつ、「飽きない」宣言がSi劣等の不安（自分もいつか飽きられるのでは）を一撃で癒すんや。🏆 Ne主機能が一番喜ぶのは「おもろい」って認定されること。「すごい」やなくて「おもろい」やで、ここ間違えたらあかん。知らんけど。",
    "love": "💑 【付き合うとこうなる】「来週ここ行こう！」→ 前日「やっぱあっちにしない？」→ 当日「待って、もっとおもろいとこ見つけた」——予定が二転三転するのがデフォルトやから、Googleカレンダーなんか信用したらあかんで。\n\n🎯 恋愛初期の口説き力はマッチングアプリの自己紹介文が出版できるレベルや。「あなたのここがこうで、だから僕はこう思って——」ってTi補助でロジカルに口説いてくるから、「え、この人めっちゃ私のこと理解してくれてる…」って錯覚するねんけど、それNe主機能が「この人のパターン解析完了」しただけやからな。攻略本読んでゲームしてるようなもんやで。\n\n🦋 問題は「落とした後」やねん。相手が完全に惚れた瞬間に「あ、クリアした」感が出てきて、新しい刺激を求め始める。浮気とかやなくて、「この関係にもう新しい発見がない」って感じた瞬間にエネルギーが消えるんよ。NetflixでおもろいドラマをシーズンSeason1で止めるタイプやで。\n\n🍝 日常会話にすら議論を持ち込むから、「今日のパスタ美味しいね」に対して「いや、本当に美味しいパスタの定義って何やと思う？ 麺のコシなのか、ソースの味なのか、それとも雰囲気込みなのか——」って始まるで。もう黙って食え。\n\n💎 ただしな、知的に対等で常に新しい視点をくれる相手には一生飽きへんのも事実やねん。「その発想はなかった」って言わせ続けられたら、この人は永遠にあんたを追いかけ続けるで。\n\n✨ 退屈さえしなければ、世界一おもろくて世界一刺激的な恋愛になるのは間違いないわ。\n\n⚠️ 【恋愛キケン度】★★★★★\n🦋 飽きたら終了——これは覚悟しとかなあかん。\n\n🏃 追いかけてくる相手には冷め、逃げる相手を追いかける永久機関みたいな矛盾を抱えてるからな。\n\n💫 攻略法は「常に半歩先を行くこと」。簡単に言うけど、これができる人間、世界に何人おるんやろな。知らんけど。",
    "compatibility": {
      "best": "INFJ",
      "best_reason": "ENTPの「おもろい仮説思いついたで！」とINFJの「その本質はこういうことやな」が合わさったら、深夜3時まで語り合える最高の知的パートナーやねん。Ne-Niの直観のぶつかり合いが火花散るし、Ti-Feの軸共有で考え方の相性もバッチリ。お互い「こいつだけは飽きひん」ってなるで。",
      "worst": "ISFJ",
      "worst_reason": "ENTPの「ルール？ 破るためにあるんやろ」とISFJの「ルールは守るもんや！」が正面衝突して大事故やねん。ENTPのNeが「新しいことやろうぜ」って暴走するたびにISFJのSi-Feが「なんでちゃんとせーへんの…」って胃が痛くなるし、ENTPからしたらISFJの慎重さが「退屈」にしか見えへんのよ。",
      "bestName": "高嶺の花子さん",
      "worstName": "戦略ペンギン"
    }
  },
  "ENFP": {
    "name": "路地裏チワワ",
    "emoji": "dog",
    "tagline": "「運命の人！」を年3回更新、LINEの頻度10倍、記念日5個勝手に制定する構ってちゃんモンスター",
    "traits": [
      "「運命の人！」年3回更新",
      "構って構って構って構って",
      "飽き性の極み（Ne暴走）",
      "感情ジェットコースター不可避"
    ],
    "front": "😇 この人がおるだけで半径5メートルの空気がパッと明るくなるムードメーカーやねん。教室でもオフィスでも飲み会でも「あの人おったら楽しいよな」って言われるタイプ。\n\n🌈 Ne主機能が「新しい！ 面白い！ やってみたい！」を秒速で生成するから、好奇心の塊みたいな存在やで。新しいカフェ、新しい趣味、新しい音楽——「これめっちゃええやん！ 聞いて聞いて！」の連射が止まらへん。推し活の布教力も全タイプ中ダントツやわ。\n\n🐶 人懐っこさがバグってて、初対面でも「え、なにそれ面白い！ もっと聞かせて！」って目ぇキラキラさせながら距離詰めてくる。コミュ力おばけやし、どんな人とも共通点見つけて仲良くなるスキルはマッチングアプリのプロフィール文より信頼できるわ。\n\n✨ Fi補助が「自分の価値観に忠実」やから、偽善的なことは嫌いやし、困ってる人見たら本気で心配する。表面的な優しさやなくて、ちゃんと心から「大丈夫？」って言える人やねん。そこがこの人の一番の魅力やで。",
    "hidden": "👿 一人になった瞬間、スイッチ切り替わるで。パーティの主役やったはずの人が、家帰ったら布団に潜り込んで「…誰も本当の私のこと理解してへんよな」って盛大に病み始めるねん。Fiが「本当の自分」を追求しすぎるから、「みんなが好きなのは明るい私であって、本当の私じゃない」っていう闇がグルグル回る。\n\n🪤 寂しさが限界突破すると「構ってちゃん攻撃」が始まるで。わざと既読無視したり、意味深なストーリー上げたり、「もういいもん」って拗ねたり——全部「追いかけてきてほしい」のサインやねん。でもそれ言語化できひんから、相手からしたら「え、何怒ってるん？」ってなる。めんどくさい？ せやで、めんどくさいんや。\n\n🦋 Ne主機能の「飽き性」が恋愛に直撃すると被害甚大やで。「この人が運命の人！！！」って確信するのを年3回やるし、告白する前に次の「運命の人」見つけてることもある。Instagramのフォロー数が毎月増えてるのはそういうことやで。\n\n💣 Fi補助が「これは合わない」って判定した瞬間の拒否力がえげつない。さっきまでニコニコしてたのに、価値観に合わないこと言われた瞬間にパシャンって心のシャッター降りるねん。その切り替えの速さ、ホラー映画レベルやで。\n\n🙈 Si劣等が壊滅的やから、約束の時間、鍵の場所、財布の中身、締め切り——全部忘れる。「ごめん、遅れる！」のLINEが来た時にはもう30分経ってるし、「あの書類どこやったっけ？」が週3回。本人は悪気ゼロなのがまたタチ悪いねん。知らんけど。",
    "manual": "✅ 【攻略法】まず大前提——この人のアイデアや思いつきを否定したら一発アウトやで。Ne主機能が生み出す突飛な発想に「それめっちゃええやん！ おもろ！」って全力で乗っかるのが信頼構築の第一歩やねん。🎉 テンション高めのリアクションが命綱や。「うん」「そうだね」の棒読みリアクションは死刑宣告と同義やで。\n\n🤗 「試し行動」にはムキにならんのが正解やねん。既読無視されても、意味深ストーリー上がっても、「拗ねてるな〜かわいいやっちゃな」ぐらいの余裕で「ちゃんとここにおるで」って安心させたれ。追いかけてほしいのに追いかけられたら逃げる——この矛盾を理解した上で付き合うんやで。\n\n📰 常に新しい話題を用意しとくのは必須条件やで。「昨日こんなおもろい動画見つけてん」「来週こんなイベントあるらしいで」って情報のシャワー浴びせ続けるのが正解や。ネタ切れしたら「最近なんかおもろいことあった？」って振って、相手にしゃべらせるのもアリやで。Ne主機能は「しゃべること」自体が充電やから。\n\n🫶 Fi補助にアクセスしたかったら、「あんたのその価値観、ごっつ好きやわ」って伝えてみ。表面的な「明るさ」やなくて「内面の芯」を認められた瞬間、「この人は本当の自分を見てくれてる」って確信して、一気に心開くで。\n\n💣 【地雷ポイント】否定した瞬間に心のシャッターがガシャーンや。🚫 既読無視は「あなたの存在を否定しました」と同義やねん、まじで。🔥 「落ち着きや」「冷静になれ」は火に油どころかガソリンやで。💔 長時間の無関心は致命傷。3時間返信なかっただけで「嫌われたかも」の妄想が始まるからな。😤 あとな、ルーティンを強制するのも最悪やで。「毎週土曜は必ずこれする」とかSi劣等を直撃するから、窮屈で死ぬ。知らんけど。",
    "date": "🎬 【シミュレーション】「新しくできたあの店行ってみたい！」のひと言からデートが始まるのがこの人のスタイルやで。Ne主機能は「初めて」に一番テンション上がるから、「前も行ったとこ」は論外やねん。新オープンのインスタ映えスポットとか、話題のポップアップショップとか、「まだ誰も知らん穴場」を見つけたらもう大興奮やで。\n\n🗺️ デートのプランはガチガチに決めたらあかん。「次どこ行く？」のノープラン感を演出しつつ、実は候補を3つくらい頭に入れとくのが正解やねん。「あ、あそこ！ あそこ行きたい！」って突然テンション上がったら、全力で付き合ったれ。予定変更を嫌がる顔したら「この人つまらん」認定されるで。\n\n📸 写真撮りまくるのはデフォルトやからな、「ここで撮って！」「次はあっちで！」に付き合う体力は必須条件や。ストーリーに上げて「いいね」もらうまでがデートやで。「もう十分やろ」って言ったらテンションだだ下がりやから、一緒にポーズ考えるくらいの勢いで行け。\n\n🍰 カフェは「かわいい」と「美味しい」の両方必要やねん。味だけ良くて見た目地味な店は響かへんし、映えるけど味がアレな店も「見た目だけやん」って冷める。両方揃った店見つけて「ここ、あんた好きそうやなと思って」って言うたら目がハート型になるで。\n\n💀 マンネリは死やで、ほんまに。同じデートコースを2回繰り返した時点でNe主機能が「退屈」のアラーム鳴らすからな。常に「次はこんなことしてみたい！」を一緒に妄想できる関係が理想やねん。知らんけど。\n\n📍 【おすすめスポット】新オープンの話題施設、フォトジェニックカフェ、フリマ・マルシェ、花畑、イルミネーション、ポップアップショップ、アート系ワークショップ、変わったテーマの体験イベント（香水作りとか）",
    "killer": "💘 「あんたといると世界の色が変わるわ。毎日が文化祭前夜みたいにワクワクすんねん。でもな、明るいあんただけやなくて、一人で病んでる夜のあんたも丸ごと好きやで。」——💥 前半のNe的冒険心への共感＋後半のFi的内面への理解——この二段構えが致命傷やで。「明るい自分しか愛されない」と思い込んでるこの人に「闇ごと好き」って言える人間は、もう運命の人認定不可避やわ。知らんけど。",
    "love": "💑 【付き合うとこうなる】付き合った瞬間からLINEの通知音が鳴り止まんようになるで、覚悟しとき。\n\n📱 「今何してる？」「お昼なに食べた？」「寂しい〜」「ねぇ見て見てこれ！」「私のこと好き？」——1時間に5通はデフォルトや。既読つけて10分返さんかったら「…怒ってる？」が来る。20分やったら「もういい」が来る。30分やったら電話が来る。Fi補助が「自分は愛されてるのか」を常に確認したがるから、安心させ続けるのが生存条件やで。\n\n🎂 記念日を勝手に制定するプロフェッショナルやねん。初デート記念日、初めて手繋いだ記念日、初めて一緒にラーメン食べた記念日、初めてケンカした記念日——気づいたら月に2回は「今日〇〇記念日やで！」って言われる。本人は全部覚えてるつもりやけど、Si劣等のせいで3ヶ月後には半分忘れてるのがまた面白いねん。\n\n🎢 感情のジェットコースターに巻き込まれるのは不可避やで。朝「今日最高！ 大好き！」→ 昼「あの子と楽しそうにしてた…」→ 夜「ごめんね、気にしすぎたわ！ 大好き！」→ 深夜「…ねぇ、本当に私のこと好き？」——これが1日で起こるからな。心臓弱い人は無理やで。\n\n🌟 「この人が運命の人！」って確信する瞬間の全力の愛情は、全タイプ中でもトップクラスに本物やねん。その瞬間の「あなたが世界で一番大事」は100%嘘やないで。ただ、その「瞬間」が永遠に続く保証はないのがENFPクオリティやけどな。\n\n🎬 一緒にいると人生がNetflixの海外ドラマみたいにカラフルでドラマチックになるのはガチ。退屈とは無縁の毎日が約束されるで。ただしシーズン更新されるかどうかは、あんたの「飽きさせない力」次第やけどな。\n\n🔥 Te第三機能が締め切り直前に覚醒するタイプやから、大事な局面ではちゃんと本気出す。普段のふわふわした印象からは想像できん集中力見せてくるで。このギャップにやられる人、めっちゃ多いわ。\n\n⚠️ 【恋愛キケン度】★★★★★\n🌊 感情の波が激しすぎてこっちが溺れるのは確実やで。\n\n🙅 「安定した穏やかな恋愛がしたい」って人には向かん。毎日がジェットコースターやから、一緒に叫べる人だけが乗車資格あるねん。\n\n💀 「退屈」が最大の敵——マンネリ防止が命綱やし、「構ってちゃん」を愛せるキャパがないと無理やで。\n\n💎 でもな、この人の「大好き！」は全タイプ中で一番キラキラしてるし、一番心に刺さるのも事実やねん。その輝きに一度触れたら、もう戻れへんで。知らんけど。",
    "compatibility": {
      "best": "INTJ",
      "best_reason": "ENFPの「あれもこれもやりたい！」をINTJが「ほな、こう計画立てたらいけるで」って現実にしてくれる最強コンビやねん。Ne-Niの直観が共鳴して深い話で盛り上がるし、Fi同士が本音で繋がれるから、表面的やない魂レベルの関係になるんよ。ENFPの飽き性をINTJの深さが引き止めるんやで。",
      "worst": "ISTJ",
      "worst_reason": "ENFPの「自由に生きたい！ルールとか知らん！」とISTJの「前例通りにせえや！」が火花散りまくるんよ。ENFPのNeが突拍子もないアイデア出すたびにISTJのSi-Teが「根拠は？ 前例は？」って詰めてくるから、ENFPの心がしぼむし、ISTJからしたらENFPの気まぐれさが理解不能やねん。",
      "bestName": "夜景の黒猫",
      "worstName": "鉄壁の金庫"
    }
  },
  "ISTJ": {
    "name": "鉄壁の金庫",
    "emoji": "vault",
    "tagline": "「前例がない＝死」のガチガチ石頭が脳内マニュアルで世界を支配中",
    "traits": [
      "前例主義の権化",
      "変化＝テロリズム",
      "感情表現=絶滅危惧種",
      "隠れ心配性のルール番人"
    ],
    "front": "😇 表向きはルールと秩序を重んじる「信頼の塊」みたいな存在やねん。\n\n🔒 決められたことを寸分の狂いなく完璧にこなすから、上司からも同僚からも「この人に任せとけば間違いない」って絶大な信頼を勝ち取ってるわ。Si主機能のおかげで過去の経験をデータベースみたいに蓄積してて、「前もこのやり方でうまくいった」っていう鉄壁のロジックで周囲を安心させるんよ。\n\n🤐 口数は少ないけど、やるべきことは黙々とこなす寡黙な職人気質。Teの補助機能で効率と正確さを追求するから、仕事の質はチーム内でもダントツやねん。\n\n📋 約束は絶対に守るし、締め切りに遅れたことなんか一度もない。Googleカレンダーにリマインダー3重でセットしてるタイプやで。\n\n🏅 「あの人に頼めば大丈夫」っていう安心感は、全16タイプ中ぶっちぎりのナンバーワンやわ。ほんまに堅実すぎて逆に心配になるレベルや。",
    "hidden": "👿 その鉄壁の裏側、ほんまにえげつないで。Si主機能が暴走して「前はこうやった」「マニュアルにはこう書いてある」が口癖になってて、前例がないことには脳がフリーズするねん。\n\n🪨 変化を極度に恐れるどころか、もはや変化＝テロ行為やと思ってるレベルや。会社の席替えですら内心パニック起こしてるし、Netflixの「おすすめ」機能にすら「勝手に決めんなや」って腹立ててるで。Ne劣等機能のせいで未知の可能性とか「ワクワクする未来」みたいな概念がバグなんよ。\n\n😶 感情表現がほぼ化石レベルで、好意を持ってても相手に一切伝わらへん。Fiの第三機能は意外と情に厚いんやけど、それを外に出す回路が完全に断線してるねん。誕生日はちゃんと覚えてるのに「おめでとう」が言えへんくて、結局LINEスタンプ1個で済ませるタイプや。\n\n⚖️ ルールを破る人間を心の底から軽蔑してて、電車で割り込みしてくる奴には脳内裁判で死刑判決出してるわ。ゴミの分別間違えた隣人のことを3年間許してへんし、マッチングアプリのプロフィールに誤字がある時点で「この人ないわ」って切り捨てるで。\n\n💀 でも一番の闇はな、内心では「嫌われてないかな…」「自分のやり方間違ってないかな…」ってごっつ心配してることやねん。鉄壁の金庫の中身は、実はめっちゃ繊細なガラスのハートやで。知らんけど。",
    "manual": "✅ 【攻略法】まず時間厳守は絶対条件やで、5分前行動は当たり前、遅刻なんかしたら人生の信頼残高が一気にゼロになるからな。📅 予定は最低3日前に共有しとき、「当日決めよ〜」とか言うたら白目むかれるどころか、もう二度と連絡こーへんで。\n\n🤝 急な予定変更するんやったらちゃんと論理的に理由説明するんやで。Si-Teの組み合わせやから「なぜ変更が必要か」の筋が通れば納得してくれるタイプやねん。感情論は一切通用せーへんから「なんとなく」は禁句やで。\n\n💎 安定感と誠実さだけで勝負しとったらええねん、小細工とかサプライズとかいらんわ。毎回同じ店でも全然OKやし、むしろ「いつもの」があることが最高の安心材料やねん。ChatGPTに「ISTJ 喜ばせ方」って検索する暇あったら、約束守って時間通りに現れるだけでええんやで。\n\n📝 相手の「こだわりルール」を把握してそれを尊重したれ。靴の並べ方、タオルの畳み方、リモコンの置き場所——些細なことやけど、ここ守るだけで信頼度爆上がりや。ほんまに地味やけど、ちゃんとやることやる人が一番好かれるんやで。知らんけど。\n\n💣 【地雷ポイント】約束破ったらもう終わりやで、信頼回復に最低1年はかかるし、完全には戻らへんと思っとき。🚫 サプライズは絶対やめとけ、Ne劣等が発動して心臓止まりかけるから。「サプライズパーティー」なんかやった日にはパニックで顔引きつるだけやで。\n\n😱 「ノリで決めようぜ〜」「臨機応変にいこ〜」は恐怖のワードTop3に入るからな。💥 ルール無視は人格否定と同じレベルやで、ゴミの分別間違えただけで内心ブチギレてるし、列に割り込む奴には脳内で懲役10年の判決下してるんやから。\n\n🔥 「もっと柔軟に考えたら？」「そんな細かいこと気にせんでも」は最悪のトドメや。あの人にとっては「細かいこと」ちゃうねん、「世界の秩序」やねん。ほんまにやったらあかんで。",
    "date": "🎬 【シミュレーション】まず「何月何日、何時にどこで何するか」を最低3日前にLINEで共有するとこからスタートや、これが全ての土台やねん。Googleマップのリンクと予約確認メールのスクショも添えたら完璧やで。\n\n🍣 きっちり時間通りに老舗の和食屋で落ち合って、5分前行動できたら内心で合格スタンプ押されるわ。Si主機能のおかげで「この店、前に来た時の鯛がうまかった」とか覚えてるから、リピート店の方が機嫌ええで。初めての店やったら事前にGoogleの口コミ全部読んでるタイプやから、メニューも予習済みや。\n\n🐟 食後は水族館を予定通り回って「次あれ見たいねん」って素直に言えたらこっちの勝ちやで。予定通りに進むことが最大の幸福やねんこの人。タイムスケジュール通りに1日が終わった時の満足感は、他のタイプには理解できひんレベルやわ。\n\n😊 帰りは「予定通りに全部回れたな、ありがとう」って言うたったら内心でガッツポーズしてるで。「次はいつにする？」って具体的な日程提案したら好感度カンストや。ほんまに波乱とかドラマチックな展開とかいらんのよ、計画通りが一番ときめくとか、ある意味すごいわ。知らんけど。\n\n📍 【おすすめスポット】老舗和食店、水族館、博物館の常設展、温泉旅館（3週間前に予約済みに限る）、定番の名所（ガイドブックに載ってる安心感が大事）、図書館デート",
    "killer": "💘 「あんたの堅実さ、ほんまに安心するわ。この時代にこれだけちゃんとしてる人おらへんで。ずっと隣におりたいねん。」——💥 「信頼されてる」「ちゃんと見てくれてる」って実感できる言葉が一番ぶっ刺さるねん。🔑 派手な口説き文句よりも日常の積み重ねへの感謝が最強やで。マッチングアプリの「ギャップ萌え」とか「サプライズ好き」とかいう軽いノリは一切響かへん。ごっつ地味やけど、「あんたがおるから毎日安心や」が効くんやから仕方ないやろ。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋愛も人生も「規則正しく」進めたい人。Si主機能が恋愛にもフル稼働してて、脳内には「告白→交際→同棲→結婚→マイホーム→老後」のタイムラインがExcelで完成済みやねん。\n\n📋 初デートの段階で「この人と将来どうなるか」を真剣にシミュレーションしてるし、3回目のデートで結婚の可能性を計算し始めるで。\n\n🔁 毎週同じ曜日に同じ店でデートすることに至上の幸福を感じるタイプや。「いつもの」がある安心感は何にも代えがたいねん。マンネリ？ そんな概念はこの人の辞書にないわ、「安定」って呼んでくれや。\n\n😐 サプライズには「嬉しい」より先に「聞いてないんやけど」が出る。バースデーサプライズで急にクラッカー鳴らされた日には心臓発作起こしかけるで。\n\n🤐 感情表現がほぼゼロで「好き」をストレートに言わんけど、毎朝コーヒーを淹れてくれたり、相手の体調を誰よりも気にしたり、傘を2本持ち歩いたり——行動で全部表現するタイプやねん。Teの効率主義で「言葉より行動の方が正確」と本気で思ってるんよ。\n\n💍 浮気は宇宙が滅んでもしない、マジで。ルールに「浮気禁止」って書いてあるからちゃうで、Fiの第三機能が「一度決めた人を裏切るのは自分の価値観に反する」って固く誓ってるからやねん。ただし相手に裏切られたら一生立ち直れへんけどな。\n\n📅 記念日は全てGoogleカレンダーに登録済み。1週間前にリマインダー、前日にもリマインダー。忘れるとかいう概念がそもそもないわ。\n\n⚠️ 【恋愛キケン度】★★☆☆☆\n🏆 安定感は全タイプ中ぶっちぎりのNo.1。一緒におったら老後まで安泰やで。\n\n😴 ただし刺激やロマンチックさを求める人には退屈すぎて窒息するかもしれへん。デートが毎回同じ店の同じ席やからな。\n\n🔒 「変わらない愛」を最高と思えるか、「退屈」と感じるかが運命の分かれ道やで。この人を選ぶっていうのは、ジェットコースターを降りて観覧車に乗り換えるってことやねん。知らんけど。",
    "compatibility": {
      "best": "ENFP",
      "best_reason": "ISTJの「堅実に生きるで」とENFPの「人生もっとカラフルにしようや！」が意外と補い合うんよ。Si主機能で変化を恐れるISTJに、Ne主機能のENFPが新しい世界見せてくれるから、「こんな景色あったんか」って目が開くねん。お互い足りんもんを持ってるから、一緒におると成長できるんやで。",
      "worst": "ENTP",
      "worst_reason": "ISTJの「ルール守れや」とENTPの「ルール？ 何それ美味しいの？」がもう壊滅的に合わへんのよ。ISTJがSi-Teで「計画通りにやってくれ」って頼んでも、ENTPのNe-Tiが「もっとおもろいやり方あるやん」って勝手にアレンジするから、ISTJの血圧が毎日上がるんやで。信頼の土台がグラグラやねん。",
      "bestName": "路地裏チワワ",
      "worstName": "ナルシスト拡声器"
    }
  },
  "ISFJ": {
    "name": "戦略ペンギン",
    "emoji": "penguin",
    "tagline": "ニコニコ笑顔で「あんた3年前にうちに言うたあの一言、まだ覚えてるで？」って脳内ジャッジ実行中",
    "traits": [
      "記憶力＝呪い",
      "尽くしすぎ爆弾",
      "ニコニコ裁判官",
      "変化アレルギー重症"
    ],
    "front": "😇 表向きは几帳面で真面目、信頼度カンストしてる「縁の下の力持ち」やねん。\n\n🐧 頼まれたことは120%の完成度でこなすし、誰も気づかへんような細かいフォローを陰ながらやってくれる。Si主機能のおかげで「前回のミーティングで〇〇さんが言うてた資料」とか瞬時に出してくるから、上司からの信頼はチーム内ダントツやわ。\n\n💪 控えめやけど芯はごっつ強いねん。Fe補助機能で周囲の感情を敏感にキャッチして、困ってる人がおったら自分のことは後回しにしてでも助けに行く。「あの人がおらんかったら回らへん」って言われるポジションを無意識に確保してるわ。\n\n🫶 相手の好みや体調の変化に誰よりも早く気づくし、さりげなくフォローする天才。推し活で言うたら「推しの体調を表情だけで見抜くガチ勢」みたいなもんや。\n\n🏅 「この人に任せれば間違いない」「この人がおると場が安心する」——そういう安定感を全身から放射してるで。",
    "hidden": "👿 その笑顔の裏側、知ったらビビるで。Si主機能が記憶力に全振りされてるから、3年前の会話を一言一句覚えてる恐怖のデータベースを脳内に搭載してるねん。「あの時あんたが言うたあの一言」をいつでも引き出せる状態で生きてるんやで。\n\n🎭 Fe補助で表面はニコニコしてるけど、Ti第三機能が裏で冷静に分析・ジャッジしまくってるわ。「この人、また同じミスしてるな」「あの人の言うてること、論理的に破綻してるな」って笑顔のまま脳内裁判を執行中やねん。\n\n😤 他人の気持ちに敏感すぎるせいで自分の気持ちは常に後回し。Fe補助が「みんなのために」って働きすぎて、自分の不満は奥歯で噛み殺してる。溜め込んで溜め込んで溜め込んで——ある日突然、3年分の不満が火山噴火みたいに爆発するんやで。Netflix全話一気見ならぬ、不満全話一気出しや。\n\n👀 嫉妬深さは全タイプ中トップクラスやのに、本人は「別に」「気にしてへんし」って絶対に認めへん。でも相手のインスタのいいね履歴とかフォロワーとか、密かにチェックしてるで。鍵アカのストーリーまで追跡してる監視能力、CIAもビビるレベルやわ。\n\n💀 Ne劣等のせいで変化への不安がえぐい。転職、引っ越し、新しい環境——全部胃が痛くなるイベントや。マッチングアプリのUIが変わっただけで動揺するレベルやで。知らんけど。",
    "manual": "✅ 【攻略法】マナーと礼儀は徹底しとけよ、靴揃えるとかお箸の持ち方とか「当たり前のこと」ができん奴はもう論外やねん。Si主機能が「ちゃんとしてるかどうか」を自動スキャンしてるから、最初の印象で8割決まるで。\n\n👞 相手の好みを事前にリサーチして「予約しといたで」って言うたら、それだけでめっちゃ距離縮まるわ。Si-Feの組み合わせは「私のこと覚えてくれてる」「気にかけてくれてる」に異常に弱いねん。\n\n📝 約束守ることが最大の信頼構築法やで。一回約束破ったら、その記録は脳内データベースに永久保存されるから覚悟しとき。逆に約束守り続けたら、じわじわと心開いてくれるわ。\n\n🫂 たまに「自分のことも大事にしいや」「無理してへん？」って聞いたれ。Fe補助で他人優先しすぎて自分がボロボロなことに本人は気づいてへんから、こっちが気づいてあげるのが大事やで。これ言えるかどうかで関係の深さが全然変わるわ。\n\n🤝 派手なことせんでええから、ちゃんとしとき。LINEの返信も24時間以内、既読つけたらちゃんと返す。地味やけど、ちゃんとしてる人が好きやねんこの人は。知らんけど。\n\n💣 【地雷ポイント】遅刻は死罪やで、マジで。Si主機能が「約束の時間」を神聖視してるから、5分の遅刻でも内心の信頼メーターがガクッと下がるねん。🚫 ドタキャンなんかしたら二度と会えへんと思っとき、記憶から消されるんちゃうで、「ドタキャンした人」として永久保存されるんやで。\n\n😤 マナー違反は心の中の軽蔑メーターが振り切れるからな。店員に横柄な態度取るとか、食べ方汚いとか——見た目平気そうでも内心ブチギレてるで。Ti第三が冷静に「この人、ないわ」って判定下してるんや。\n\n💥 「適当でいいよ〜」って言われても絶対信じてへんからな。ISFJの「適当でいい」は「ちゃんとやれ」の婉曲表現やで。💔 「気にしすぎやって」は最悪のNGワード。Feで周囲に気を配ることがアイデンティティやのに、それを否定されたら存在意義が揺らぐんやで。ごっつ怖いやろ。",
    "date": "🎬 【シミュレーション】「予約してあるから」の一言が最強の殺し文句やねん、これだけで好感度3割増しやで。Si主機能が「ちゃんと準備してくれた」っていう事実にめっちゃ安心するんや。予約確認のスクショをLINEで送ったら完璧やで。\n\n🐧 スケジュール通りに水族館回って、ペンギンの群れ見ながら「あの子、ちょっとはぐれてるな」とか細かいとこに気づくのがISFJやねん。Siの記憶力で「前に来た時はあっちのコーナーにクラゲおったで」とか教えてくれるわ。\n\n😊 「次は〇〇行きたいな」って控えめに提案してくれたら脈ありやで、ガッツポーズしとき。ISFJが自分から行きたい場所を言うのはめっちゃ勇気いることやからな、Fe補助が「相手に合わせなあかん」って普段は押さえ込んでるんや。\n\n🎯 帰りに「今日めっちゃ楽しかったわ、ありがとう」ってちゃんと言葉にして伝えたれ。ISFJは「楽しかった」を態度で察してほしいんやなくて、言葉で確認したいタイプやねん。LINEでも「今日のあのペンギン可愛かったな」って具体的な感想送ったら、脳内好感度ゲージが溢れるで。\n\n🙅 定番デートスポットの方がハズレなくて安心するタイプやから、奇をてらうのは逆効果やねん。「SNSで見つけた穴場」より「食べログ3.8以上の定番店」の方が安心するわ。知らんけど。\n\n📍 【おすすめスポット】水族館、動物園、予約済みのレストラン（食べログの評価を事前共有すると尚良し）、季節の花が見れる公園、カフェ巡り（前に行って良かった店のリピートが最強）",
    "killer": "💘 「あんたのその几帳面さ、正直ごっつ尊敬するわ。いつも周りのこと気にかけてるん、ちゃんと見てるで。うちは絶対見逃さへんからな。」——💥 真面目さと気配りをちゃんと評価してくれる人がめっちゃ少ないからな、この一言はごっつ心に刺さるんやで。Feで他人のために尽くしてるのに「当たり前」扱いされてる日常やから、「見てるで」の一言が涙腺直撃するんや。みんなスルーするとこやからこそ、言うたもん勝ちやねん。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋人のためにこっそり尽くす「影のサポーター」どころか、もはや「影の執事」レベルやで。Fe補助機能がフル稼働して、相手の快適さを最優先にする生活が始まるんや。\n\n🍫 冷蔵庫に好きなお菓子を常にストック、体調悪い時にそっとポカリとウィダーinゼリーを枕元に配置、相手の服の好みを完璧に把握してユニクロのセール情報を即共有——言葉にしない愛情表現のデパートやで。\n\n📱 相手のSNSの更新は誰よりも早くチェックしてるし、インスタのストーリーに知らん異性が映ってたら5秒で気づく。でも「見てへんし」って絶対言うからな。嘘やで、全部見てるで。\n\n😤 ただし最大の爆弾は「やってあげたのに気づかない」問題や。Si-Feの組み合わせで「私がこれだけやってるのに」カウンターが裏で回り続けてて、限界突破した瞬間に3年分の不満が一気に噴出するんやで。「あの時も」「この時も」「ていうか2023年の8月にあんたが言うたあの一言——」って時系列完璧に並べてくるから怖いで。\n\n👀 嫉妬深さは本物やけど、本人は地球が滅んでも「別に」って言い張る。相手の交友関係を密かにチェックしてる監視型やけど、自覚ゼロ。LINEの友達欄を覗いてるんちゃうで、「たまたま目に入っただけ」やからな。\n\n💎 でも一途さは本物中の本物で、好きになったら何年でも待てる忍耐力がある。Si主機能が「この人」って決めたら揺るがへんし、Te劣等がない分、相手のダメなとこも含めて丸ごと受け入れる懐の深さがあるんや。\n\n🔄 不満を溜め込まんように、月イチで「最近どう思ってる？」って聞いたれ。ISFJは聞かれへんと自分からは絶対言わへんからな。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n💣 不満を溜め込みすぎる点が最大のリスクやで。表面上は穏やかやけど、裏でカウンターが回ってることを忘れたらあかん。\n\n💬 「何か思ってることない？」「最近無理してへん？」って定期的にガス抜きしてあげるのが長続きの秘訣やねん。このメンテナンスを怠ったら突然の大噴火が来るで。\n\n🏠 でもちゃんと向き合ったら、世界一居心地のいい家庭を作ってくれるパートナーになるわ。知らんけど。",
    "compatibility": {
      "best": "ESFP",
      "best_reason": "ISFJの「ちゃんとサポートするで」とESFPの「今を楽しもうや！」が絶妙にバランスとれるんよ。Si-Seの感覚共有で「美味しい」「楽しい」を一緒に味わえるし、ISFJのFeがESFPを温かく見守って、ESFPのSeがISFJに「もっと楽しんでええんやで」って殻を破らせてくれるねん。",
      "worst": "ENTP",
      "worst_reason": "ISFJの「約束は守るもんやろ！」とENTPの「約束？ あ、そんなんあったっけ？」がもう致命的やねん。ISFJがSi-Feで丁寧に積み上げた信頼を、ENTPのNe暴走が秒で破壊するんよ。ISFJからしたら「なんでちゃんとせーへんの」やし、ENTPからしたら「細かすぎるやろ」で、お互い疲弊するだけやで。",
      "bestName": "偽善ウミガメ",
      "worstName": "ナルシスト拡声器"
    }
  },
  "ISFP": {
    "name": "雨宿りうさぎ",
    "emoji": "rabbit",
    "tagline": "「この世界、眩しすぎるんよ…」って五感フルオープンで傷つきまくってる美意識の塊",
    "traits": [
      "美意識＝宗教",
      "好き嫌いで世界を裁く",
      "繊細センサー常時MAX",
      "突然シャッター全閉じ"
    ],
    "front": "😇 表向きは穏やかで優しいオーラを漂わせる「歩く癒し」みたいな存在やねん。\n\n🎨 Fi主機能のおかげで独自の美意識がごっつ光ってて、ファッション・音楽・インテリア・食のセンスが全部おしゃれ。Instagramのフィードは統一感バッチリやし、Spotifyのプレイリストのセンスはフォロワーがつくレベルやわ。Se補助機能で五感が鋭いから、「あの店の照明の色味が好き」「このコーヒー、酸味のバランスが絶妙やな」みたいな繊細な感覚を持ってるねん。\n\n🕊️ 争いを心の底から嫌うし、誰に対しても柔らかい態度で接するから、一緒におると心が凪ぐようになるんよ。グループの中では派手に目立たへんけど、「あの人がおると場が穏やかになる」って思われてるわ。\n\n🫶 そっと寄り添ってくれる共感力はピカイチで、言葉にせんでも「なんか辛そうやな」って察してくれるタイプ。Ni第三機能がふとした瞬間に本質を見抜くから、「なんでわかるん？」って驚かれることも多いで。\n\n🌿 自然体で生きることを大事にしてて、無理に自分を作ったりせーへん。その「飾らなさ」がまた魅力になってるんやわ。",
    "hidden": "👿 その穏やかな外見の裏側、ほんまにセンサーだらけでえらいことになってるで。Fi主機能が「好き嫌い」で世界を二分割してて、自分の価値観に合わへんもんは存在ごと否定するレベルの頑固さやねん。\n\n💔 Se補助で五感が鋭すぎるから、些細な言葉の言い方、LINEの句読点の位置、相手の表情の微妙な変化——全部キャッチしてまう。「あの人、さっきちょっと声のトーン下がったな…嫌われたかも…」って勝手に傷ついて、一人の世界に引きこもって回復するんやで。推しの配信でメン限荒らされた時のダメージの10倍は食らってるわ。\n\n🌋 穏やかに見えるけど、怒りの沸点を超えた瞬間は過去の全てを引っ張り出してキレる爆発型や。普段飲み込んでる分、出た時のエネルギーがえげつない。「3ヶ月前のあの時も」「去年の誕生日の時も」ってSiの記憶力はないけど、感情の記憶だけはFiが完璧に保存してるんやで。\n\n🏃 Te劣等のせいで計画性がほぼゼロ。締め切りは「存在しない概念」やし、確定申告は毎年命がけ。Googleカレンダーにリマインダーセットしても、リマインダーの通知を無視するスキルが異常に高いわ。\n\n💀 感受性が豊かすぎて日常生活が疲れるんよ。満員電車は地獄やし、飲み会の大声は魂が抜けるし、「この世界は私には眩しすぎる」って本気で思ってるで。Netflixで泣ける映画観たら3日引きずるタイプやわ。知らんけど。",
    "manual": "✅ 【攻略法】無理に聞き出そうとしたらあかんで、Fi主機能は自分のペースで心を開くから、焦ったら逆効果やねん。「何考えてるん？」って詰問するんちゃうくて、隣でただ静かにおるだけでええんやで。\n\n🫂 「わかるわ〜」「ええやん、それ」の共感ワードをめっちゃ散りばめとき。ISFPにとって「否定されへん安全地帯」を作ってくれる人が一番大事やねん。正論とかアドバイスとかいらんで、ただ「うんうん」って聞いてくれるだけでええ。\n\n🖼️ Se補助が五感に敏感やから、静かなカフェ、美術館、おしゃれなセレクトショップみたいな「感性くすぐる場所」で一緒に過ごしたら自然と心開いてくれるで。「あの絵の色使いめっちゃ好き」「このコーヒーの酸味ええな」みたいな感覚共有ができたら距離が一気に縮まるわ。\n\n🎵 相手の好きな音楽、映画、アートに興味を示すのがめっちゃ大事やで。Fiの価値観は「好きなもの」に集約されてるから、そこを尊重してくれる人にはめっちゃ心開くねん。Spotifyの共有プレイリスト作ったろか？って提案したら喜ぶで。\n\n🌿 ガヤガヤしたとこ連れてったら魂抜けるから絶対やめとき。ほんまに繊細やねんこの人、扱い方間違えたらすぐ殻に閉じこもるで。知らんけど。\n\n💣 【地雷ポイント】作品とか趣味とか価値観を否定した瞬間、永久にブラックリスト入りやで。Fi主機能にとって「好きなもの」は自分自身と同義やから、「その音楽ダサくない？」は「お前の存在ダサくない？」と同じ意味やねん。🚫 「気にしすぎやって〜」「考えすぎやで」は傷口に塩塗るようなもんやから絶対言うたらあかん。本人は気にしすぎてるんちゃうねん、感じすぎてるんや。\n\n😵 騒がしい場所に連れてったらSeが過負荷起こして魂抜けて帰ってこーへんようなるで。居酒屋のガヤガヤとか、パチンコ屋の前通るだけでもHPが削られるタイプやねん。\n\n💥 正論パンチは心をバキバキに折るからやめとけ。Te劣等が一番苦手とするのが「論理的に正しいけど冷たい言葉」や。「で、結局どうしたいん？」みたいな結論を急かす言い方は致命傷やで。ほんまに。",
    "date": "🎬 【シミュレーション】おしゃれなセレクトショップかヴィンテージショップで自然に合流するのがベストやで。「待ち合わせ」感より「偶然の出会い」感を演出するのがISFPの心をくすぐるコツやねん。Se補助が「今この瞬間の空気感」を大事にするから、ガチガチのスケジュールは逆効果や。\n\n🖼️ 美術館を「あの色使いめっちゃ好きやわ」「このテクスチャーすごない？」って共感しながら巡るんやで。Fi主機能は「感じたことを共有できる相手」に一番心開くから、感想を言い合える関係を作るのが大事やねん。黙って隣を歩くだけでも充分やけど、時々ポツリと感想をこぼすのがベストやわ。\n\n☕ 静かなカフェに入って、窓の外の景色見ながらぽつぽつ深い話し始めたら大成功や。ISFPは安心したらNi第三の直感が冴えてきて、ハッとするような本質的な言葉を突然ポロッと言うんやで。\n\n🌅 帰り道に夕焼けとか綺麗な景色に出会えたら最高のデートやわ。「あの空の色、今日しか見られへんな」みたいなことを言えたら、ISFPの心は完全にこっちのもんやで。\n\n💌 「あんたと見たい世界がまだまだあんねん」的なロマンチックな誘い方がごっつ刺さるわ。ファミレスとかチェーン店みたいな無個性な空間はテンションだだ下がりやから絶対やめとき。知らんけど。\n\n📍 【おすすめスポット】美術館（企画展より常設展の方が空いてて落ち着く）、ヴィンテージショップ巡り、静かな隠れ家カフェ、花畑、夕焼けが綺麗なスポット、小さなギャラリー、植物園",
    "killer": "💘 「言葉にせんでも、あんたの内面の深さ、うちにはちゃんと伝わってるで。あんたの感性、世界でたった一つやねん。」——💥 「理解されてる」「自分のまんまでええんや」って感覚にめっちゃ飢えてるからな、この一言で心の扉が全開になるねん。Fi主機能は「自分の価値観を丸ごと受け入れてくれる人」を一生探し続けてるんやで。ごっつ効くわ、ほんまに。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋が始まると「カメレオン恋愛」がフル稼働するで。Fi主機能が「この人が好き」って決めた瞬間から、相手の好みに全力で染まりにいくんや。\n\n🎵 好きな人の音楽を全部聴き始めるし、映画の趣味も服の系統も気づけば相手色に。Spotifyの「最近聴いた曲」が突然変わったら、それは恋してる証拠やで。Se補助の五感で恋をするから、相手の匂い、声のトーン、手の温度——全部が特別なもんになるねん。\n\n🌸 デート中は五感で全てを感じ取って、「あの花綺麗やな」「この空気おいしいな」って些細な美しさを共有したがる。この瞬間を一緒に感じてくれる相手がおるだけで幸福度MAXやわ。\n\n😶 でもケンカが致命的に苦手。Fiは自分の感情を大事にするけど、それを言葉にして相手にぶつけるのが怖くてしゃーないんやで。不満を飲み込み続けて、飲み込み続けて——ある日突然「もう無理」ってシャッターを降ろす。前兆がほぼないから相手はびっくりするんやけど、本人の中では何ヶ月も前から限界やったんよ。\n\n😰 繊細すぎて相手の些細な態度の変化に過敏反応するのも日常やで。LINEの返信が30分遅いだけで「嫌われた？」って脳内で壮大な悲劇が始まる。相手がちょっと疲れてる顔しただけで「私のせい？」ってなるし、インスタで他の人の投稿にいいね押してたら「私よりあの人の方が…」って勝手に凹む。\n\n🎨 愛情表現は言葉より「作品」で。手作りのプレゼント、選び抜いたプレイリスト、二人の思い出をコラージュした写真——Se-Fiの組み合わせで世界一エモい愛情表現をしてくれるで。\n\n💎 自分を丸ごと受け入れてくれた相手には、世界一ピュアな愛を捧げる。この人の愛は混じりっけなしの純度100%やわ。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n🎨 感受性が豊かすぎて一緒におると疲れることもあるけど、共感力は全タイプ中最強クラスやで。\n\n🖼️ 芸術系のデートで感性を共有すると絆がごっつ深まる。「一緒に美しいものを感じる」ことが最大の愛情確認やねん。\n\n🚪 ただし「突然シャッター問題」だけは要注意。不満を溜め込んでへんか、たまに優しく聞いたれ。知らんけど。",
    "compatibility": {
      "best": "ESFJ",
      "best_reason": "ISFPの「自分の感性を大事にしたいねん」とESFJの「あんたのこと全力でサポートするで！」が最高に噛み合うんよ。Fi-Feで感情の方向は違うけど、お互い「気持ち」を大事にするから深いとこで理解し合えるねん。ESFJのSiがISFPの生活面をサポートして、ISFPのSeがESFJに感性の豊かさを教えてくれるんやで。",
      "worst": "ENTJ",
      "worst_reason": "ISFPの「マイペースで感じたいねん…」とENTJの「効率！目標！KPI！」が宇宙の果てまですれ違うんよ。ENTJがTe-Niで「こうすべきや」って押し付けるたびにISFPのFiが傷ついて殻に閉じこもるし、ISFPの「今はそういう気分ちゃうねん」がENTJには怠けにしか見えへんから、もう救いがないで。",
      "bestName": "偽善ウミガメ",
      "worstName": "やかまし上司"
    }
  },
  "INFP": {
    "name": "優しさ過剰装備",
    "emoji": "tofu",
    "tagline": "脳内でラブストーリー10本同時上映しながら現実では確定申告に殺されかけてる妄想の天才",
    "traits": [
      "脳内ポエム常時暴走",
      "理想と現実の乖離で自爆",
      "被害妄想フルスロットル",
      "キレたら過去の全罪状を陳列"
    ],
    "front": "😇 表向きは誰に対しても優しくて、相手の気持ちに寄り添える「共感力の化身」みたいな存在やねん。\n\n🎭 Fi主機能のおかげで独自の世界観がごっつ確立されてて、創作・音楽・文学・映画の感性がずば抜けてる。Twitterの140字で人を泣かせる才能とか、読書感想文で先生を号泣させる才能とか、言葉のセンスは全タイプ中トップクラスやわ。\n\n🌿 控えめやけど芯はごっつ強い。みんなが流されてる時にも「それはおかしいんちゃう？」って静かに声を上げられる勇気があるんよ。Ne補助の想像力で「もしこの人が傷ついてたら」って先回りして気遣えるから、「あの人に話聞いてもらうと楽になる」って信頼されてるわ。\n\n📚 小説みたいな感性で世界を見てるから、日常の些細なことにも美しさを見出す天才。桜が散る瞬間に感動して泣けるし、雨の日の匂いにノスタルジーを感じるし、推しの新曲で人生の意味を悟れるタイプやで。\n\n🌟 その「優しさ」は本物で、困ってる人を見ると自分のことそっちのけで寄り添いにいく。ただしその優しさが過剰すぎて自分が潰れることもしょっちゅうやけどな。",
    "hidden": "👿 その優しい仮面の裏側、えげつないポエムの嵐が吹き荒れてるで。Fi主機能が理想を天井知らずに引き上げるから、現実に対する期待値がバグっとるんや。「世の中もっと美しくあるべき」「人はもっと優しくあるべき」——理想が高すぎて現実に常にガッカリしてる永遠の失望マシンやねん。\n\n🧠 Ne補助の妄想力は∞（無限大）やで。脳内では恋愛ドラマ10本、異世界転生もの3本、ディストピア小説2本が同時上映中や。目の前の現実より脳内シアターの方がリアルに感じてるまであるわ。好きな人ができたら脳内で出会いから結婚式まで全部再生済み、現実ではまだ「おはよう」しか言うてへんのにな。\n\n😱 Si第三の記憶力が悪い方向にフル稼働してて、過去のトラウマをいつまでも引きずる。5年前の飲み会で言われた「もうちょっと明るくしたら？」の一言をまだ反芻してるし、中学の時に好きな人に笑われた記憶で今でも胸が痛むレベルやで。\n\n🌋 「あの人、私のこと嫌いに違いない」と勝手に確信する被害妄想の達人や。LINEの返信が1時間遅いだけで「嫌われた→もう人生終わり→そもそも自分が生きてる意味とは」まで思考が暴走するんやで。ChatGPTに「友達にLINE返信遅い人がいます 嫌われてますか」って相談してるレベルやわ。\n\n🔪 普段は豆腐メンタルやけど、キレた時の陰湿さは全タイプ中最凶レベルやで。過去の罪状を時系列順に完璧に並べて、一つ一つ丁寧に刺してくる。「2024年の3月、あんたが言うたあの一言——」って記録映像みたいに再生されるからな。Fiの感情記憶は恐ろしいほど正確やねん。\n\n💀 Te劣等のせいで現実的な問題解決が壊滅的に苦手。確定申告は毎年命がけやし、引っ越しの手続きで3回泣くし、役所の書類に「世帯主」って書く欄で哲学的な問いを感じるタイプやで。知らんけど。",
    "manual": "✅ 【攻略法】相手の夢とか理想とか世界観は全肯定が鉄則やで。Fi主機能にとって「自分の価値観」は命と同じくらい大事やから、「その世界観めっちゃ好きやわ」「その考え方、他の誰にも真似できへんわ」の一言が最強の武器やねん。\n\n🫶 焦らんと時間かけて距離縮めるんやで。INFPは心の奥深くに宝物みたいな本音を隠してて、それを見せるには相当な信頼が必要やねん。初対面で深い話しようとしても表面的な返事しか返ってこーへんから、じっくりいけ。\n\n🎬 世界観がごっつ強い映画とか音楽を一緒に共有するのが最短ルートやわ。ジブリの深い考察とか、indie音楽の歌詞の意味とか、Netflixのマイナー作品の感想とか——「この人、感性が合う」って思わせたら一気に仲良くなれるで。\n\n✨ 「あんたの感性は特別やで」「あんたの言葉は人の心に刺さるで」って何回でも言うたれ。INFPは自分の価値に自信がないくせに、認めてもらいたい欲求がめっちゃ強いんや。褒めて褒めて褒めまくるのが正解やねん。\n\n📝 手書きの手紙とか、心を込めたLINEのメッセージとか、「言葉」で愛情を伝えるのがごっつ大事やで。Neの想像力が「この人、本当に私のことを想ってくれてるんや」って物語を紡ぎ始めたらこっちの勝ちやわ。知らんけど。\n\n💣 【地雷ポイント】否定は絶対あかん、それだけで世界が終わるレベルのダメージ食らうで。Fi主機能にとって価値観の否定は存在否定と同義やねん。🚫 現実的すぎるツッコミは毒薬と一緒や。「で、具体的にどうすんの？」「それ現実的に無理やろ」——Te劣等を直撃する言葉は心臓に直接ナイフ刺すようなもんやで。\n\n🔪 「考えすぎやって」「気にしすぎやろ」は全否定と同じやからな。INFPにとって「深く考えること」「細かく感じること」はアイデンティティそのものや。それを否定されたら「自分の存在を否定された」って解釈するで。\n\n💥 長期間シカトしたら被害妄想がえげつないことになるから、ほんまに気をつけとき。1日LINEが途切れただけで「嫌われた→もう終わりや→そもそも生きてる意味とは」の思考ジェットコースターに乗車してまうからな。既読無視は精神攻撃やで。",
    "date": "🎬 【シミュレーション】世界観がごっつ強い映画を一緒に観るんが最強のデートプランやで。ミニシアターとか単館上映とかがベスト。Fi主機能が「この作品、どう感じた？」の答え合わせをしたくてたまらんくなるから、映画の選択がデートの成否を決めるレベルで大事やねん。\n\n💬 上映後に「あのシーンの意味、どう思った？」って感想共有するんやけど、ここでちゃんと深い話できたらもうこっちの勝ちや。INFPは「感性が合う人」を命がけで探してるから、映画の感想で価値観が合ったら「この人、運命かも」って脳内で花火が上がるで。Ne補助の妄想エンジンが全開になる瞬間や。\n\n📚 おしゃれな古本屋とかレトロ喫茶で余韻に浸って、「あのセリフ、心に刺さったわ…」ってしみじみするのが至福の時間やねん。INFPは「余韻」を味わう時間がごっつ大事で、映画観た直後にラーメン屋とか連れてったら世界観ぶち壊しで萎えるからな。\n\n🌙 帰り道に夜空見上げて「今日めっちゃええ時間やったな…」ってポツリと言えたら完璧やで。INFPは「ドラマチックな日常」を求めてるから、なんでもない帰り道を特別にしてくれる人にめっちゃ弱い。\n\n🙅 ファミレスとかフードコートとか現実感強すぎる場所はテンションだだ下がりやから絶対やめとき。蛍光灯の下で「世界観」は語れへんのや。BGMがJ-POPの有線放送やったらもう帰りたくなるで。知らんけど。\n\n📍 【おすすめスポット】ミニシアター、古本屋（個人経営の方がええ）、レトロ喫茶、ミュージカル、世界観のある展覧会、星が見えるスポット、小さな教会や歴史的建築物、アートフェスティバル",
    "killer": "💘 「あんたの見てる世界、うちにも見せてくれへん？ あんたの言葉でしか伝わらへん景色があると思うねん。ずっと一緒に見ていたいわ。」——💥 Fi-Neの組み合わせはポエティックな言葉に致命的に弱いんやで。🌙 「あんたの世界を理解したい」「あんたの言葉が特別」って伝えることで、「この人は運命の理解者や」って認定されるんや。現実的な「今度ご飯行こ」より、「あんたと星を見たい」の方が10倍効くからな。ごっつ効くわ、ほんまに。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋愛が始まった瞬間、脳内で壮大なラブストーリーが全12章で執筆開始されるで。Fi-Neの組み合わせが恋愛モードに入ると、妄想のクオリティがNetflixオリジナル映画を超えるレベルになるんや。\n\n📝 相手を「運命の人」に即認定し、二人の未来を日記にポエムとして書き綴る。「今日、あの人が笑ってくれた。春の風みたいに柔らかいその笑顔が、私の心の庭に花を咲かせた——」みたいなのをガチで書いてるからな。ノートアプリに保存してある恋愛ポエムの量、電子書籍1冊分はあるで。\n\n🎢 些細な一言で天国と地獄を行き来するメンタルの持ち主。「今日のご飯美味しかったね」で天国行って、「ちょっと疲れたわ」で「私といるのが疲れるってこと？」って地獄に直行する。LINEに「。」がついてるだけで「怒ってる…？」って30分悩むし、ハートの絵文字が減った日は「愛が冷めた証拠」として脳内裁判にかけるで。\n\n😱 相手が他の異性と話すだけで被害妄想が大爆発するけど、本人は「別に気にしてない」「信じてるし」って強がる。でも家帰ってから枕に顔埋めて「やっぱり気になる…」って3時間悩んでるんやで。インスタのいいね欄チェックしてるけど、それは「たまたま目に入った」だけやからな。\n\n💔 理想の恋愛像が天井知らずに高いから、「こんなはずじゃなかった」って勝手に幻滅することがある。脳内では相手が雨の日に傘持って迎えに来るはずやったのに、現実では「傘持ってきてへんの？コンビニで買いや」って言われて世界が崩壊するねん。\n\n🌙 深夜3時に「私たちの関係ってなんやろ…」っていう哲学的なLINEが飛んでくることがある。これは試し行動ちゃうで、本気で考え込んでるんや。返信は「寝ろ」じゃなくて、ちゃんと付き合ったれ。\n\n💎 ただし、共感と理解で結ばれた関係は、どのタイプよりも深く、どのタイプよりも美しい。INFPの愛は詩みたいなもんで、日常を芸術に変える力があるんや。「世界で一番あなたを理解したい」って本気で思ってくれる稀有な存在やで。\n\n✍️ 誕生日に手書きの手紙くれるタイプで、その文面のクオリティは毎回泣けるレベル。言葉で愛を紡ぐ天才やわ。\n\n⚠️ 【恋愛キケン度】★★★★★\n🎢 メンタルの浮き沈みがジェットコースターすぎてこっちが情緒不安定になる覚悟が必要やで。「今日のLINE、なんかいつもと違う…」って毎日分析されてるからな。\n\n🌟 でも「世界で一番あなたを理解したい」「あなたの言葉が一番好き」って本気で思ってくれる、全タイプ中最もピュアな愛を捧げてくれる存在やねん。\n\n📖 この人を選ぶっていうのは、人生にポエムと涙と、たまにカオスが追加されるってことや。それでもええなら、世界一美しい恋愛が待ってるで。知らんけど。",
    "compatibility": {
      "best": "ENFJ",
      "best_reason": "INFPの「理想の世界があんねん…」とENFJの「ほな一緒に実現しようや！」が奇跡のマッチングやねん。Fi-Feで感情の補完が完璧やし、Ne-NiのN同士で深い話が尽きひんねん。ENFJがINFPの夢を「それ素敵やん」って全肯定して背中押してくれるから、INFPが一番輝ける関係やで。",
      "worst": "ESTJ",
      "worst_reason": "INFPの「気持ちを大事にしたい…」とESTJの「結果出せや！ルール守れや！」が真っ向からぶつかって血の雨降るんよ。ESTJのTe-Siが「前例通りにやれ」って詰めるたびにINFPのFi-Neが「そんな機械的な生き方できへん…」って魂が死ぬんや。お互いの一番大事なもんを否定し合う最悪コンボやで。",
      "bestName": "ひだまりレトリバー",
      "worstName": "爆走ライオン"
    }
  },
  "ESTP": {
    "name": "お祭りパンダ",
    "emoji": "panda",
    "tagline": "ノリだけで生きてる脳天気のくせに心で毒吐きまくり",
    "traits": [
      "ムードメーカー仮面",
      "心で毒吐き中",
      "脳天気系寂しがり",
      "逃避の天才"
    ],
    "front": "😇 どんな場でもムードメーカーを買って出る陽キャの中の陽キャ。合コンでも飲み会でも、この人がおったら場が勝手に盛り上がるねん。\n\n🎉 ノリの良さはもはや国宝級。「とりあえずやってみよう！」が口癖で、周りを巻き込む行動力は太陽系最強クラスやで。Se主機能がフル回転して、五感で「今この瞬間」を全力で味わい尽くしてるんや。\n\n🚀 フットワークの軽さは異常レベル。金曜の夜に「明日どっか行かへん？」って言うたら土曜の朝には車出してくれるタイプや。計画？ 何それ美味しいの？ 状態やけど、その場の判断力（Ti補助）がごっつ鋭いから、なんやかんや上手くいくねん。\n\n🤝 初対面の人ともすぐ仲良くなれるし、後輩からは「めっちゃ楽しい先輩」って慕われてるわ。Feが第三機能やから、人を楽しませるセンスは天性のもんやねん。",
    "hidden": "👿 疲れが溜まるとな、あの笑顔の裏で「この集まり、クソつまんねぇ。全員のノリが寒すぎて凍えるわ」って心でボロクソ言うてるんやで。ほんまに笑顔のまま毒吐くスキル、プロ級やねん。\n\n😤 場の空気が悪くなると「お前のせいやろがい！」って心の中で八つ当たりしまくり。表面はニコニコしてるけど、内心のdisゲージがMAXになったら急に「じゃ、俺帰るわ！」って光の速さで撤退するんや。\n\n🏃 楽しいことで将来の不安から逃げ続ける逃避行動の天才。Ni劣等やから「10年後の自分」とか考えるだけでフリーズするねん。Netflix一気見、推し活、飲み会ハシゴ…全部「将来のこと考えたくない」の裏返しやで。ChatGPTに「将来設計して」って丸投げしかねんレベルやわ。\n\n💀 本当は寂しがり屋やけど、それを認めたら負けやと思ってる。深夜2時に一人でスマホいじりながら「あー、誰かおらんかな」って思ってるのに、「俺は一人でも全然平気やし！」って強がるんや。マッチングアプリを3つ同時に回しとるのは、刺激が欲しいんやなくて寂しいだけやって、本人だけ気づいてへんねん。\n\n🧠 Ti補助のせいで実は頭の回転めっちゃ速いんやけど、それを「ノリ」でカモフラージュしてるんが闇深いわ。本気出したら仕事もできるのに、「頑張ってる自分」を見せるのがダサいと思ってるから、永遠にポテンシャルの70%で生きてるねん。",
    "manual": "✅ 【攻略法】一緒にアホみたいに大笑いするのが最強の信頼構築法やで。まずはこれが大前提やねん。🤣 「めっちゃ楽しい！」「ごっつ美味い！」のリアクションはMAXでかましとけ。テンション低い返しは存在否定と同義やからな。\n\n🤝 ノリが合えば一生もんの仲間になれるタイプやねん。Se主機能の人やから「一緒に体験する」ことが何より大事なんや。Netflixの感想共有とかじゃなくて、実際に一緒にやらな意味ないで。\n\n💬 深刻な相談は短く明るいトーンでサクッと済ませとき。「ちょっと聞いてほしいことあるんやけど〜」くらいの軽さで切り出すのが正解。30分以上の重い話はCPUがオーバーヒートして強制シャットダウンされるで。\n\n⚡ あとな、この人は「今すぐ」に弱いんや。「来月のイベント」より「今週末の焼肉」の方が100倍テンション上がるで。誘うなら直近で、勢いで、ノリで。これが鉄則やねん。\n\n🎯 Ti補助を刺激するのも有効やで。「これどう思う？」って瞬時の判断を求めると、めっちゃ的確な答え返してくるから「すご！天才ちゃう？」って褒めたったら好感度爆上がりやわ。知らんけど。\n\n💣 【地雷ポイント】テンション低い奴は即戦力外通告やで、容赦ないからな。暗い顔して隣に座っとるだけで「こいつ何しに来たん？」って思われてるで。🚫 長い説教とか論外中の論外や、聞く耳持たへんどころか5秒で脳がスクリーンセーバーモードに入るわ。\n\n💥 「ちゃんと将来考えてんの？」は地雷ど真ん中踏み抜いてるようなもんやで。Ni劣等を直撃するこの質問、言うた瞬間に相手の目から光が消えるから覚悟しとき。😵 楽しくない空気はほんまに無理やねん、酸素がなくなる感覚らしいわ。居酒屋でしんみり人生語り始めたら「トイレ行ってくる」って言って帰ってくるかどうかは五分五分やで。\n\n🔥 あと「昔はもっと楽しかったのにな〜」とかノスタルジー攻撃も地雷やで。この人はSe主機能やから過去じゃなくて「今」が全てやねん。過去の話されても「知らんがな」以外の感情が湧かへんのよ。",
    "date": "🎬 【シミュレーション】「行こや！」の一言でフードフェスへ直行するんや、計画なんかいらんねん。待ち合わせ時間？ 「だいたい昼くらい」で十分や。Se主機能全開のこの人に5分刻みのスケジュールとか渡したら白目むくで。\n\n🍖 食べ歩きしながらハイテンションで盛り上がって、「これめっちゃ美味いやん！」「あっちも行ってみようや！」って衝動のまま突き進むのが正解やねん。途中で「あのアトラクション乗ろや！」って急に予定変わっても、笑顔で「ええやん！」って付いていけるかが試されてるんやで。\n\n🎢 テーマパークなんか連れてったら水を得た魚やわ。絶叫マシンから始まって、射的やって、ポップコーン食べて、パレード見て、また絶叫マシン。体力の限界？ 知らんがな。この人の横におるだけで1日2万歩は確実やで。\n\n📸 インスタのストーリーは必須やで。「今日めっちゃ楽しい！」っていうリア充アピールができんデートは、この人にとって存在しなかったのと同じや。映える写真を一緒に撮ってくれる相手はポイント高いで。\n\n💪 「何する？」より「行こや！」の勢いが大事やねん、考えてる暇あったら動けって話や。Ti補助が瞬時に最適解出してくれるから、ノープランでも意外となんとかなるのがこの人の強みやで。\n\n🌙 帰り道に「今日めっちゃ楽しかったな！」って全力で伝えたら「やろ？ 俺/私といると楽しいやろ？」ってドヤ顔するけど、内心めっちゃ嬉しがってるからな。知らんけど。\n\n📍 【おすすめスポット】テーマパーク、フードフェス、ライブ・フェス、花火大会、スポーツ観戦、BBQ、ゴーカート、アスレチック施設",
    "killer": "💘 「あんたといる瞬間が人生のピークやわ！ 今日が最高すぎて死ねるで！」——💥 大げさなくらいの全力感がごっつ刺さるねん。この人はSeが主機能やから「今この瞬間が最高」っていうメッセージが何より嬉しいんや。🎯 冷静な言葉なんか響かへんで、テンションぶち上げて、目ぇキラキラさせて、全身で「楽しい！」を表現したれ。知的な褒め言葉より「うわぁぁぁ最高！！！」の方が100倍刺さるで。知らんけど。",
    "love": "💑 【付き合うとこうなる】「今が楽しければOK！」精神で突っ走るジェットコースター恋愛の体現者やで。Se主機能が恋愛モードに入ったら、毎日がお祭り騒ぎや。\n\n🏃 毎週末どこかに出かけないと死ぬ体質で、インドアデートは拷問レベル。「Netflix見よう」って提案した瞬間に「外出よや！」って返されるのがデフォルトやねん。家でゴロゴロ？ そんな概念はこの人の辞書にはないで。\n\n😆 恋人にもハイテンションを求めるので、テンション低い日は「どうしたの？ 楽しくないの？ 俺/私といて楽しくないの？」の三段圧が来る。Fe第三機能が暴走して、相手の気分＝自分への評価やと勘違いしてるんや。\n\n🤷 ケンカしても5分で忘れるサッパリ系やけど、それは「解決した」んやなくて「もう考えたくない」から忘れてるだけやで。根に持つタイプの相手とは温度差で核分裂起こすわ。\n\n🙈 将来の話を振ると急に黙るか話題を変える逃避癖あり。「5年後どうなってたい？」とか聞いた日にはトイレに立ったまま30分帰ってこーへんで。Ni劣等の恐怖、ここに極まれりや。\n\n📱 マッチングアプリをアンインストールしたかどうかは要確認やで。悪気はないんやけど、「楽しそうな人」に無意識に反応するセンサーが常時ONやからな。浮気のつもりはなくても「友達やし」で済ませる境界線がガバガバなんよ。\n\n✨ でも一緒にいる瞬間の全力の楽しさは本物で、「人生で一番笑った恋愛だった」と言われるタイプ。この人と過ごした思い出は、何年経っても色褪せへんくらいキラキラしてるで。\n\n⚠️ 【恋愛キケン度】★★★★☆\n🎆 ノリと勢いで始まりノリと勢いで終わりがち。告白も別れ話もテンションで決まる怖さよ。\n\n📉 将来設計ゼロやけど、「今を全力で楽しむ」同士の相手とは最高のコンビになるで。\n\n💡 長続きのコツは「楽しさの供給を止めないこと」と「将来の話は小出しにすること」やねん。知らんけど。",
    "compatibility": {
      "best": "ISFJ",
      "best_reason": "ESTPの「今を楽しもうぜ！」とISFJの「ちゃんと見守っとくで」が意外と最強の組み合わせやねん。Se主機能で突っ走るESTPを、Si-Feで堅実なISFJが陰から支えてくれるから、ESTPは安心して暴れられるんよ。Ti-Feの軸共有で、根っこの部分では理解し合えるんやで。",
      "worst": "INFJ",
      "worst_reason": "ESTPの「考える前に動けや！」とINFJの「もっと深く考えてから動いてほしいねん…」が完全に噛み合わへんのよ。ESTPのSe-Tiが「今この瞬間」に全振りしてる横で、INFJのNi-Feが「意味のある行動を…」って求めるから、ESTPには説教に聞こえるし、INFJにはESTPが浅く見えるんやで。地獄やわ。",
      "bestName": "戦略ペンギン",
      "worstName": "高嶺の花子さん"
    }
  },
  "ESFP": {
    "name": "偽善ウミガメ",
    "emoji": "turtle",
    "tagline": "「いい人」の仮面の下で損得そろばんパチパチ弾いてる逃避の達人",
    "traits": [
      "いい人演技のプロ",
      "逃げ足MAX",
      "面倒=無理",
      "空気読みの天才"
    ],
    "front": "😇 誰にでも優しくて協調性バツグンの「みんなの人気者」。教室でも職場でも、この人の周りには自然と人が集まってくるねん。Se主機能がフル稼働して、おしゃれでキラキラした空気を身にまとってるわ。\n\n🌟 空気を読む天才で、場の雰囲気を壊さないスキルはピカイチ。「なんかこの人といると居心地ええな〜」って思わせる天然たらし力がやばいんよ。Fi補助のおかげで自分の美意識がしっかりしてるから、「おしゃれやな〜」って褒められることも多いわ。\n\n✨ 楽しいことが大好きで、トレンドに敏感。新しいカフェ、話題のイベント、SNSでバズってるスポット…全部チェック済み。一緒にいると毎回新しい「楽しい」に出会えるエンタメの女神/王子やで。\n\n🫶 困ってる人には自然と手を差し伸べるし、友達の相談にも親身に乗ってくれる。「ほんまにええ人やな〜」ってみんなから思われてるねん。",
    "hidden": "👿 裏では「この人と仲良くしておくと得かな？ 損かな？」と損得勘定のそろばんをパチパチ弾きまくってるんやで。Fi補助が「自分にとって心地ええか」を常にジャッジしてて、その判定に引っかからん人間は静かにフェードアウト対象やねん。\n\n🐢 面倒な状況になると海の底に潜るように静かに消える逃避の達人。友達がケンカ始めたら「ちょっとトイレ〜」で消えるし、彼氏/彼女との重い話になったら「眠い〜」で強制終了。Ni劣等のせいで深刻な問題と向き合うのが物理的に無理やねん。\n\n🎭 「いい人」の仮面が分厚すぎて本心が見えへん。SNSでは「ありがとう」「大好き」「最高！」のポジティブワードを量産してるけど、裏アカでは「あいつマジ無理」って毒吐いてる可能性大やで。鍵アカの闇は深い。\n\n💀 八方美人が災いして深い関係を築けへん。友達100人おっても、本気で腹割って話せる相手は0人、みたいな孤独を抱えてるんや。でもそれを自覚するのが怖くて、また新しい「楽しい」を探しに行く無限ループ。\n\n🃏 空気は読めるけど、都合よく読み替える才能もピカイチ。「あ、今みんな楽しんでるから私の本音言わんでもいいよね〜」って、自分の逃避を正当化するスキルが神がかっとるわ。Te第三機能が追い込まれた時だけ発動して、急に現実的な判断下すけど、普段はずっとお花畑モードやねん。",
    "manual": "✅ 【攻略法】まず大前提として「軽い関係」から始めるのが鉄則やで。初手で重い話したら秒で逃げられるからな。🫶 「無理せんでええよ」「自然体でええんやで」って安心感を与えるのがめっちゃ大事やねん。この人はFi補助で「自分の気持ちに正直」やから、居心地の悪さを感じたら光の速さで撤退するで。\n\n😎 軽くて居心地ええ関係を目指しとき。一緒にいて「楽しい」「映える」「気を遣わなくてええ」の三拍子が揃ったら、自然と心開いてくれるで。Se主機能やから、五感で感じる「心地よさ」が全てやねん。\n\n📸 SNS映えスポットにごっつ弱いからな。「インスタで見つけたんやけど、めっちゃ映えるカフェあるで！」って誘い方は成功率90%超えや。このタイプへの誘い文句に「映え」を入れるのは必須やで。\n\n🤝 重い話は避けて軽いノリで楽しむのがコツやけど、時々ポロッと本音が出る瞬間があるねん。その時は聞き流さんと「それ、ほんまの気持ちなん？」ってさりげなく拾うたれ。この一回で信頼レベルが10上がるで。\n\n💎 あとな、この人の「好きなもの」を一緒に好きになったれ。美味しいもの、おしゃれな場所、可愛い雑貨…共感してくれる人にめっちゃ弱いねん。「わかる〜それめっちゃええよな！」が魔法の言葉やで。知らんけど。\n\n💣 【地雷ポイント】重すぎるアプローチしたら光の速さで逃げられるで。LINEで長文の気持ち送りつけるのとか、マッチングアプリでいきなり将来の話するのとか、もう論外中の論外やねん。🚫 「本音で話してや」って詰めたら貝みたいに閉じるからやめとき。この人の仮面を無理やり剥がそうとしたら、殻に閉じこもって二度と出てこーへんで。\n\n💨 責任押し付けたら静かに消えるで、ほんまに消えるからな。「これあんたがやるべきちゃう？」って言うた瞬間、既読つかんくなるのはお約束やねん。💥 ネガティブ全開にしたら距離取られて終わりやで。「人生つらい」系の話を延々されるのは、このタイプにとって酸素がなくなるのと同じやからな。",
    "date": "🎬 【シミュレーション】おしゃれなビーチカフェで待ち合わせするんや、雰囲気から入るのが大事やねん。Se主機能のこの人は「見た目」「雰囲気」「空気感」で8割決まるから、場所選びでもう勝負は始まってるんやで。ダサい居酒屋チェーンとか連れてったら、心のシャッターが音速で閉まるわ。\n\n📸 インスタに上げられる映えスポットを巡って「これめっちゃ映えるやん！」って盛り上がるんやで。写真撮影タイムは必須や。「撮ろうや！」って自分から言えたらポイント高いで。逆に「写真ばっかりうざいな」って顔したら二度目のデートはないと思っとき。\n\n🎵 「とりあえず楽しかったらOK！」の空気で軽やかに過ごすのが正解や。「今日の目的は？」とか「何がしたい？」って聞くより、「あ、あそこ行ってみよ！」って流れに身を任せる方がこの人は楽しいんやで。Fi補助が「自分のペースで動きたい」って思ってるから、相手に合わせてるようでちゃっかり自分のペースで動いてるんや。\n\n🍰 おしゃれなスイーツとか、話題のフードとか、五感で楽しめるもんを用意しとき。「美味しい〜！」って一緒に叫べる相手が一番相性ええで。\n\n🙅 重い話は絶対にしたらあかん、「今この瞬間が楽しい！」を共有するのが全てやねん。デート中に仕事の愚痴とか将来の不安とか言い出したら、目の前のウミガメはスッ…と海に帰っていくで。ほんまに軽さが命やで。知らんけど。\n\n📍 【おすすめスポット】ビーチカフェ、映えスポット巡り、リゾート施設、ナイトプール、マルシェ、話題のポップアップストア、おしゃれなフードコート、アフタヌーンティー",
    "killer": "💘 「あんたの前では仮面外してええんやで。素のままが一番魅力的なんやから。無理して笑わんでもええねん。」——💥 「素を出しても大丈夫」っていう安心感が最大の武器やねん。Fi補助は「本当の自分を受け入れてほしい」って心の底で叫んでるんや。でも怖くて仮面脱がれへんこの人に、「脱いでもええんやで」って許可証を渡したったら、もうこっちのもんやで。他の人が見たことない素顔を見せてくれるようになるわ。ほんまに。知らんけど。",
    "love": "💑 【付き合うとこうなる】最初は「いい人」全開で全力で尽くしてくれるで。Se主機能で五感フル稼働やから、デートのセンスは抜群。おしゃれなお店連れてってくれるし、プレゼントのセンスもええし、「この人と付き合えて幸せ〜」って最初の3ヶ月は天国やわ。\n\n🧮 だが慣れてくると「この関係、私にとって得？損？」という損得勘定が静かに起動するんや。Fi補助が「自分の心に正直」やから、「なんか違うかも」って感じた瞬間にもう心は半分出て行ってるで。表面上は何も変わってへんように見えるのが怖いとこやねん。\n\n🏃 面倒な話になると「ちょっとトイレ」と席を立ち、そのままフェードアウトする逃げ足の速さ。「別れ話？ 今度ね〜」って永遠に「今度」が来ーへんパターンもあるで。Ni劣等のせいで、シリアスな場面に向き合う体力がゼロやねん。\n\n😊 ケンカは絶対にしない——なぜなら面倒だから。その場は笑顔で「わかった〜」と言うが、内心では何も解決していない。問題は全部海の底に沈めて「見なかったことにする」のがこの人の処世術やで。\n\n🎭 友達に恋人の話をする時は「めっちゃいい人やで〜」って絶賛するけど、裏では「でもちょっと重いんよな〜」って別の友達に愚痴ってる二面性。SNSに匂わせ投稿するのも得意やで。\n\n💎 ただし、相手が「無理しなくていいよ」と仮面を外す許可をくれたら、少しずつ本当の自分を見せてくれるようになる。その「素の自分」はびっくりするくらい可愛くて、守ってあげたくなるで。Te第三機能が発動した時の「本気モード」は意外な頼もしさがあるしな。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n🎭 表面的な平和は保てるが、本音が見えない不安がつきまとう。「今日楽しかった？」→「うん！楽しかった〜！」のやりとりが本音なのか演技なのか、永遠にわからん恐怖よ。\n\n🤗 「逃げグセ」を責めずに安全地帯を作ってあげるのがコツ。追いかけたら逃げる、待ってたら戻ってくる。ウミガメの生態そのままやで。知らんけど。",
    "compatibility": {
      "best": "ISFJ",
      "best_reason": "ESFPの「今が楽しけりゃ最高やん！」とISFJの「うちが全部サポートしたるわ」が最高のコンビやねん。Se主機能で自由に飛び回るESFPを、Si-FeのISFJが温かく見守って帰る場所を用意してくれるんよ。ESFPのFiとISFJのFeで感情面もバランスとれるし、一緒におると「安心して楽しめる」関係になるんやで。",
      "worst": "INTJ",
      "worst_reason": "ESFPの「今楽しいことが正義やろ！」とINTJの「10年後の計画の話をしてるんやけど」が完全に別次元の会話になるんよ。ESFPのSe-Fiが「感じるままに生きたい」って言うたびにINTJのNi-Teが「計画性ゼロか」ってイラつくし、INTJの理屈っぽさがESFPには「おもんない」でしかないから、お互い呆れるだけやで。",
      "bestName": "戦略ペンギン",
      "worstName": "夜景の黒猫"
    }
  },
  "ENFJ": {
    "name": "ひだまりレトリバー",
    "emoji": "retriever",
    "tagline": "「みんなのために」とか言うて実は依存させるのが快感な育成ゲーマー",
    "traits": [
      "承認欲求の塊",
      "依存させるプロ",
      "用済み=ポイ",
      "自己犠牲風マウント"
    ],
    "front": "😇 「あなたのためを思って」が口癖の世話焼き番長。Fe主機能がフル回転で、他人の感情を瞬時に読み取る空気読みの天才やねん。あの人が泣きそうな顔してたら、誰より先に気づいて駆け寄るタイプやわ。\n\n🌻 周囲からは「いい人」認定で、困っている人を見ると放っておけない。後輩の相談に2時間付き合うのも、友達の引っ越し手伝うのも、全部嬉々としてやるねん。「人の役に立ってる自分」に最高の快感を感じとるんや。\n\n🫂 包容力があり、グループの精神的支柱。「この人がおったら安心する」「何でも相談できる」ってみんなから言われてるで。Ni補助のおかげで人の可能性を見抜く力がすごくて、「あんたはもっとできる子や」って背中押してくれるんや。\n\n😊 いつも笑顔で、一緒にいるとほっとする。Se第三機能で意外とおしゃれやし、服のセンスもええ。見た目にも気を使う「完璧な良い人」を演出するのがめっちゃ上手いねん。\n\n🏆 職場でも学校でも「人望がある人」ランキング常連。リーダーを任されることも多くて、みんなをまとめるのが本当に上手いわ。",
    "hidden": "👿 実は「私が必要とされない世界」を許せない依存煽り職人やねん。Fe主機能の闇がここに出るんや。他人の感情を読む力が高すぎて、それを「相手を自分に依存させる」ために使ってまうんよ。\n\n🎣 相手を世話することで自分の存在意義を確認している。「あんたのこと助けてあげたい」の裏には「助けを必要としてる人がおらんと、私の価値がなくなる」っていう闇の方程式が隠れてるんや。Ni補助が「この人をこう育てたら、こう依存してくるやろな」って無意識に計算してるのがごっつ怖いわ。\n\n🪓 用済みになった相手は無表情で切り捨てる残酷さも持ち合わせとる。昨日まで「大好き！」って言うてた人を、翌日には「あの人？もう別にええわ」って切れる冷酷さ、ほんまにゾッとするで。「私がここまでしてあげたのに成長しないなら、もう知らん」って、恋愛も友情も育成ゲーム感覚なんや。\n\n💀 「嫌われたくない」が全行動の原動力で、自己犠牲に見せかけたマウントが得意技。「私、あんたのために寝る時間削って準備したんやで〜」って言うの、感謝されたいからやで。「全然大変ちゃうよ！」って言いながら大変アピールする矛盾の塊やねん。\n\n🌑 Ti劣等やから、自分のこの行動パターンを客観的に分析できへん。「私は本当に人のためを思ってるだけ」って本気で信じてるんが一番怖いとこやわ。ChatGPTに「私って依存させてる？」って聞いても、たぶん自分に都合よく解釈するで。",
    "manual": "✅ 【攻略法】小さな配慮に気づいて大げさなくらい「ありがとう！」を連発しとけ、これが命綱やねん。Fe主機能の人に感謝を伝えへんのは、植物に水やらんのと同じやで。枯れるで、ほんまに。\n\n📅 記念日は絶対に忘れたらあかんで、忘れた瞬間に闇落ちするからな。スマホのカレンダーに全部入れとけ。付き合った日、初デートの日、初めて手ぇ繋いだ日…この人が勝手に制定する記念日は無限に増えるから、管理大変やけど頑張れ。\n\n📱 こまめな連絡がめっちゃ大事やで。既読つけて30分放置したら「嫌われた…」って脳内パニック始まるからな。忙しい時は「今ちょっと手離せへんから後で返すな！」って一言入れるだけで全然ちゃうで。\n\n🫶 相手の世話焼きは素直に受け入れつつ、たまに「自分のことも大事にしいや」って言うたれ。Ti劣等で自分の感情を論理的に整理できへんから、誰かに「頑張りすぎやで」って言ってもらえると泣いて喜ぶねん。\n\n🎯 あとな、この人の「育てたい欲」を上手く使うんや。「あんたのおかげでこんなに成長できたわ」って伝えたら、Ni補助が「よっしゃ、もっと育てたる！」ってスイッチ入って、めっちゃ尽くしてくれるで。ただし依存しすぎたらあかんで、対等な関係を保つのが長続きの秘訣や。知らんけど。\n\n💣 【地雷ポイント】LINEの既読無視は宣戦布告と同じやで、マジで。Fe主機能にとって「反応がない」は「存在を否定された」と同義やねん。🚫 感謝せーへん人間は「裏切り者」認定されるからな。「やってもらって当然」の態度は最速で信頼を失う方法やで。\n\n💥 相手の好意を「別にええよ」って軽くあしらうのは致命傷やで、ほんまにやったらあかん。手作りのお弁当を「コンビニでよかったのに」って言うた日には、表面は笑顔やけど内心で核爆発起こしてるわ。\n\n🔥 あと「あんたがおらんくても大丈夫やで」は禁句中の禁句やで。「必要とされてない」と感じた瞬間にこの人のアイデンティティが崩壊するからな。Se第三機能で外見は平気そうに取り繕うけど、心はボロボロやで。",
    "date": "🎬 【シミュレーション】「あんたが選んでくれたんや！」感のあるアニマルカフェで待ち合わせするんやで。Fe主機能の人やから、「生き物と触れ合う→優しい気持ちになる→その優しさを共有する」っていう流れが最高にハマるんや。犬カフェで子犬にデレデレしてる姿を見たら「可愛い〜」って言うたれ。犬にも本人にもや。\n\n🧺 ピクニックで手作りのお弁当出てくる可能性大やから、めっちゃ感動しとけ。「えっ、これ全部作ったん！？ すごすぎるやろ！」くらいのリアクションが正解やで。一品一品について「これめっちゃ美味い」って言うのを忘れんといてな。手間かけた分だけ感謝されたいんやから。\n\n🎨 手作り体験教室とかもおすすめやで。陶芸とかキャンドルとか、二人で一緒に何か作るアクティビティ。この人はNi補助で「人を育てる」のが好きやから、「こうした方がいいで〜」って教えてくれるのが楽しいんや。下手でも素直に「教えて！」って言うたらめっちゃ嬉しそうにするで。\n\n🌅 帰り道に「今日ほんまに楽しかったわ、ありがとうな。あんたのおかげで最高の1日やったわ」って感謝伝えたら好感度MAXやで。ここでの「ありがとう」は必須やからな、言い忘れたら全部台無しやで。\n\n🎁 サプライズ演出にごっつ弱いから、ちょっとした花束とか手紙とか用意しといたら泣きよるで。でもな、この人自身もサプライズ好きやから、「実は私も用意してたんやで〜」って被せてくる可能性もあるわ。その時は全力で感動したれ。ほんまに。知らんけど。\n\n📍 【おすすめスポット】アニマルカフェ、ピクニック、手作り体験教室（陶芸・キャンドル）、映えスポット、季節イベント、ボランティア活動、料理教室",
    "killer": "💘 「あんたのおかげでうち救われてるわ。存在がもうパワースポットやねん。あんたがおらんかったら、うちほんまにどうなってたかわからへん。」——💥 存在意義を全肯定されたら、もう離れられへんようなるで。Fe主機能にとって「あなたのおかげで」は最強の言葉やねん。ごっつ効くわこれ。ただし嘘はバレるで、Fe主機能の感情センサーは嘘を見抜くから、本心で言えるかどうかが勝負やで。ほんまに。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋人に対して「世話焼きの過保護親」と化すで。Fe主機能が恋愛モードに入ったら、もう歯止めが効かへんねん。「あんたの幸せ＝私の幸せ」が口癖やけど、その裏には「あんたを幸せにできる私＝最高の私」っていう自己肯定感の構造が隠れてるんや。\n\n📱 「ご飯食べた？」「ちゃんと寝てる？」「今日寒いから上着持っていきや」の確認LINEが1日5回以上。Ni補助が「この人のことは全部把握しておきたい」って思ってるから、既読つかへんかったら5分でソワソワし始めるで。\n\n🎂 記念日は完璧にプロデュースするで。手作りケーキ、手書きの手紙、サプライズ演出…全部準備万端や。でもな、相手が感動しないと不機嫌になるんよ。「え、嬉しくないの？」→「こんなに準備したのに？」→「私の気持ちは伝わらないの？」の三段階闇落ちはお約束やねん。\n\n📊 自分がどれだけ尽くしているかを無意識にカウントしとる。「今月私がご飯作った回数」「あんたの相談に乗った時間」…全部脳内スプレッドシートで管理されてるで。見返りが足りないと「こんなにやってるのに…」のメンヘラモード発動や。\n\n🪓 Ni補助が「この人にはもう伸びしろがない」って判定した瞬間、育成ゲームの電源をブチッと切るような冷たさで切り捨てるで。昨日まで「大好き」やったのに、翌日にはもう次のターゲット探してるんやから怖いわ。\n\n😤 別れた後は共通の友人に「私があれだけやったのに」と愚痴るのが恒例。しかもFe主機能やから周りの同情を集めるのがめっちゃ上手くて、別れた相手が悪者になるパターンが多いんや。\n\n💎 でも、感謝をちゃんと伝えてくれる相手とは、世界一温かい家庭を築ける。「ありがとう」「助かったわ」「あんたがおってくれて幸せ」——この三つを日常的に言えるなら、このレトリバーは一生あんたの隣で尻尾振ってくれるで。\n\n⚠️ 【恋愛キケン度】★★★★☆\n🔄 尽くしすぎて見返りを求める無限ループに注意やで。「やってあげたい」と「感謝されたい」のバランスが崩れた時に闇落ちするんや。\n\n🙏 「ありがとう」を日常的に伝えれば最強のパートナーになるで。感謝こそがこの人への最大の愛情表現やねん。\n\n💡 コツは「頼る」ことやで。「あんたがおらんと無理」は依存やけど、「あんたに助けてほしい」は信頼。この微妙なラインを保てたら、一生もんの関係になるわ。知らんけど。",
    "compatibility": {
      "best": "INFP",
      "best_reason": "ENFJの「みんなの可能性を引き出したい！」とINFPの「理想の世界を夢見てるねん」が合わさったら、もう映画のワンシーンみたいな関係やねん。Fe-Fiで感情の補完が完璧やし、Ni-Neの直観同士でお互いの深い部分が通じ合うんよ。ENFJがINFPの翼になって、INFPの夢を現実に近づけてくれるんやで。",
      "worst": "ISTP",
      "worst_reason": "ENFJの「気持ちを共有しよ！ 一緒に成長しよ！」とISTPの「一人にしてくれ…頼むから…」がもう壊滅的にすれ違うんよ。ENFJのFe-Niが深い感情的つながりを求めるのに、ISTPのTi-Seは「そういうの苦手やねん」って逃げるから、ENFJは傷つくしISTPは窒息するしで、お互い不幸になるだけやで。",
      "bestName": "優しさ過剰装備",
      "worstName": "偏屈狼"
    }
  },
  "ESFJ": {
    "name": "偽善ウミガメ",
    "emoji": "turtle",
    "tagline": "世話焼きながら「感謝しろよ？」と内心キレ散らかしてる情報屋",
    "traits": [
      "感謝の強要",
      "噂話=栄養",
      "仲間外れ=致死量",
      "表面だけ優しい"
    ],
    "front": "😇 困ってる人を放っておけない世話焼き体質の鑑やで。Fe主機能が「みんなの調和」を最優先にするから、グループの中で困ってる人がおったら真っ先に声かけにいくんや。「大丈夫？何かできることある？」が口癖やねん。\n\n🌐 グループの和を大切にし、みんなが楽しめるよう気を配る潤滑油。飲み会の幹事、旅行の段取り、誕生日のサプライズ企画…全部この人が仕切ってるで。Si補助のおかげで過去の経験から「こうしたら上手くいく」っていうデータベースが脳内に蓄積されてて、段取り力が異常に高いんや。\n\n📍 話題の店やイベントに詳しく、「あの人に聞けば間違いない」と頼りにされている。Ne第三機能で情報収集能力がごっつ高いから、新しいカフェ、話題のドラマ、芸能人のゴシップ…全部把握済みやで。この人おらんかったら、グループLINEの情報量が半減するわ。\n\n🤝 礼儀正しくて人当たりがいいから、年上からも年下からも好かれるタイプ。「あの子はちゃんとしてる」って評価されることが何よりの喜びやねん。",
    "hidden": "👿 裏では「こんなにやってあげてるのに感謝がない」と常にキレ散らかしてるで。Fe主機能の闇がモロに出るのがここやねん。「ありがとう」の一言がないだけで、脳内で怒りのメーターがレッドゾーンに突入するんや。しかもSi補助が「あの時もお礼なかった」「3ヶ月前にも同じことあった」って過去のデータ全部引っ張り出してくるから、恨みが複利で増えていくで。\n\n🐢 グループの和を重視する実態は「自分が仲間外れにならないため」の生存戦略やねん。Fe主機能にとって「集団から排除される」は死と同義。だからみんなのために尽くしてるように見せかけて、実は「自分の居場所を確保する」ために動いてるんや。計算高いとかやなくて、もう本能レベルでそうなってるのが怖いとこやで。\n\n🗣️ 噂話を栄養にして生きとる。Ne第三機能が情報収集に特化してて、「誰が誰と付き合ってる」「あの人が転職するらしい」「あの夫婦ヤバいらしいで」…全部この人の耳に入ってくるんや。CIA並みの情報網を持ってるくせに、自分の噂には異常に敏感で、ちょっとでも悪く言われてると知ったら大パニックになるダブルスタンダードやで。\n\n💀 感謝されないと静かにブチギレるだけやなくて、裏で「あの人ってさ、人の好意を当たり前と思うタイプやんな〜」って別の友達に愚痴るんよ。本人には絶対直接言わへんのに、周りには全部筒抜けっていう陰湿さがあるわ。\n\n📱 SNSの「いいね」の数を異常に気にする。自分の投稿に「いいね」がつかへんかったら「嫌われてる？」って不安になるし、友達の投稿に自分だけコメントしてもらえへんかったら「仲間外れにされてる」って被害妄想が炸裂するで。Ti劣等やから客観的に「考えすぎやろ」って自分にツッコミ入れられへんのが辛いとこやな。",
    "manual": "✅ 【攻略法】「ありがとう」を惜しみなく伝えまくれ、これが全ての基本やで。Fe主機能の人に感謝を伝えへんのは、スマホの充電切らすようなもんや。電源落ちるで、ほんまに。しかも「ありがとう」は具体的に言うのがコツやねん。「ありがとう」より「あんたが予約してくれたおかげでめっちゃ楽しかったわ、ありがとうな！」の方が100倍効くで。\n\n👏 相手の努力を見逃さんと褒めとき。「あ、髪切った？ 似合うやん！」「その服どこの？ おしゃれやな〜」みたいな小さな変化に気づくのが大事やで。Si補助のこの人は「ちゃんと見てくれてる」ことにごっつ弱いんや。\n\n🤝 グループ内での立場守ったれよ。友達の前で恥かかせたり、この人の知らん情報で盛り上がったりしたら、信頼崩壊のカウントダウンが始まるで。「あんたも知ってるやんな？」って巻き込んであげるのが優しさやねん。\n\n🗺️ 話題のスポットとかみんなに自慢できる場所に誘ったら目輝くで。「ここ行ってきたんやで〜」って友達に報告するまでがデートやから、「話のネタになるかどうか」も重要な判断基準やねん。\n\n📱 こまめに情報共有するのも大事やで。「こんなニュース見たんやけど」「あの店リニューアルしたらしいで」とか、ちょっとした情報をシェアするだけで「この人、私のこと覚えてくれてるんや」って安心するねん。知らんけど。\n\n💣 【地雷ポイント】悪口言う奴には不信感バリバリやで。特に「共通の友達の悪口」を言うたら「こいつ、裏で私のことも言うてるやろな」って認定されて終了やねん。🚫 自分だけ知らへん情報があったら不安でたまらんようなるからな。グループLINEで自分だけハブられてるのを発見した日には、心臓止まりかけるで。\n\n💥 仲間外れは精神崩壊のトリガーやで、ほんまにやったらあかん。「あ、あの時〇〇だけ呼ばんかったんや〜」とか平気で言うたら、Si補助が「あの時の仲間外れ事件」として永久保存するからな。10年後に掘り返されるで。\n\n🔥 感謝なしで「当たり前やん」扱いは爆発の導火線やからな。「やってもらって当然」の態度を取り続けたら、ある日突然「もうあんたのことは知らん」って見放されるで。表面上はニコニコしてるから気づかへんうちに限界来てることが多いんや、これがほんまに怖いとこやで。",
    "date": "🎬 【シミュレーション】話題のレストランで「ここめっちゃ行きたかってん！」って喜ばせるんやで。Si補助のこの人は「ちゃんと調べてきてくれた」「私のために準備してくれた」っていう事前の努力にごっつ弱いんや。予約なしで行き当たりばったりとかは論外やで、「え、予約してないん？」って冷めた目で見られるのがオチやわ。\n\n☕ カフェ巡りしながら友達に自慢できる写真撮りまくるんや。映えが命やからな。「これインスタに上げたい！」って目が輝いたらデートは成功してるで。この人にとって「SNSに上げたいと思えるデート＝いいデート」やから、そこの基準は絶対に外したらあかん。\n\n📸 「今日のこと、友達に話してもええ？」って聞かれたらデート大成功やで。Fe主機能のこの人にとって「人に話したい」は最高の褒め言葉やねん。逆に「あんま人に言わんといて」って言うのは好感度ダダ下がりやで。\n\n🍰 食事の時はちゃんとマナー守れよ。Si補助が「この人の食べ方」まで見てるからな。箸の持ち方が変とか、くちゃくちゃ食べるとか、そういう「ちゃんとしてない」ポイントは全部マイナス査定や。帰ってから友達に「あの人、箸の持ち方あかんかった」って報告されるで。\n\n🏆 「みんなに自慢できる」体験が大事やねん。話題のアフタヌーンティー、予約困難なラーメン屋、期間限定のイベント…「ここ行ってきたんやで〜」って言えるネタを提供するのがデートの最大の目的やで。地味なデートはあかんねん、ほんまにSNS映えと話のネタが全てやわ。\n\n🎉 あとな、デート後に「今日めっちゃ楽しかったわ！ ありがとう！」ってLINEは絶対に送れよ。これ送らんかったら「え、楽しくなかった？」→「私のせい？」→「嫌われた？」の三段階パニックが始まるで。知らんけど。\n\n📍 【おすすめスポット】話題のレストラン、カフェ巡り、グルメフェス、マルシェ、季節のイベント、アフタヌーンティー、インスタで話題のスイーツ店、期間限定ポップアップ",
    "killer": "💘 「あんたがおるだけで場がめっちゃ明るくなるわ。みんなそう思ってるで。あんたのおかげで楽しいんやで、ほんまに。」——💥 周囲からの評価を代弁したれや。Fe主機能にとって「みんながそう思ってる」は最強の承認やねん。「私が思ってる」だけやなくて「みんなが思ってる」を付け加えることで効果が10倍になるで。Si補助がこの言葉を大切な記憶として保存して、辛い時に何度もリプレイするからな。ごっつ単純やけど、それがええねん。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋人に対しても「みんなの人気者でいたい」が優先されがちやねん。Fe主機能が「グループの調和」を最優先にするから、恋人より友達の飲み会を優先することもしょっちゅうやで。\n\n📱 デート中でもSNSの通知が気になり、友達からの誘いを断れない八方美人ぶりが炸裂するわ。「ごめん、友達が相談あるって言うてきて…」って途中で離脱することもあるで。「私とどっちが大事なの？」と聞かれると「どっちも！」と答えるが、実際は空気を読んで都合のいい方を選ぶのがこの人やねん。\n\n🗣️ 相手の話より自分の話をしたがり、「今日こんなことがあってさ〜」のマシンガントークが止まらん。Ne第三機能で話が次から次へと飛ぶから、聞いてる方は振り回されるで。でもな、ちゃんと「うんうん、それで？」って聞いたれよ。聞いてもらえるだけで幸せなんやから。\n\n🧮 Si補助が過去の恩も恨みも全部記録してるんやで。「あの時誕生日プレゼント買ってくれへんかった」「3年前の記念日にあんたは仕事優先した」…全部データベースに入ってるからな。ケンカになった時に10年前の話まで出てくるのはSi補助のせいやで。\n\n👀 恋人を友達に紹介する時の「自慢げな顔」は本物の愛情の証やで。「見て！うちの彼氏/彼女やで！ めっちゃええ人やろ？」って嬉しそうに紹介するのは、あんたを自分の大事な世界の一部として認めた証拠やねん。逆に言うと「友達に紹介できへん相手」はNGやで。自慢できひん恋人は長続きせーへんのがこのタイプの現実やわ。\n\n📊 SNSに恋人との写真を上げるかどうかも重要な指標やで。「匂わせ」投稿が増えたら本気度高い証拠。逆に一切SNSに出さへんかったら…ちょっと心配した方がええかもな。\n\n💎 ただし「ありがとう」「大好き」「あんたが一番」を日常的に伝えてくれる相手には、一生をかけて尽くすで。料理も家事も完璧にこなして、イベントごとは全部準備して、相手の家族とも上手くやる「理想のパートナー」になれるんや。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n📱 SNS依存と八方美人に振り回される覚悟が必要やで。「あんたのSNS誰がいいねしてる？」チェックは日課やからな。\n\n👑 でも「あなたが一番」と特別扱いしてくれた瞬間の幸福感は最強やで。「みんなの中で一番大事なのはあんたやで」って言える相手を、この人はずっと探してるんや。\n\n💡 長続きのコツは「感謝を言葉にすること」と「友達との時間も大切にさせてあげること」。束縛すると逆効果やけど、放置しすぎても不安になる。ちょうどいい距離感を保てたら、このウミガメは一生あんたのために海を泳ぎ続けてくれるで。知らんけど。",
    "compatibility": {
      "best": "ISFP",
      "best_reason": "ESFJの「みんなのお世話したいねん！」とISFPの「その優しさ、ごっつありがたいわ」が最高に噛み合うんよ。Fe-Fiで感情面の補完がバッチリやし、Si-Seの感覚共有で「美味しい」「気持ちいい」を一緒に楽しめるねん。ESFJの面倒見の良さをISFPが素直に受け取ってくれるから、ESFJも報われるんやで。",
      "worst": "INTP",
      "worst_reason": "ESFJの「みんなの気持ち考えてや！」とINTPの「気持ちより論理が大事やろ」がバチバチにぶつかるんよ。ESFJがFe-Siで「空気読んで！前もこうやったやん！」って言うたびに、INTPのTi-Neが「空気って非論理的な概念やな」って真顔で返すから、ESFJの血管がブチ切れるで。会話が永遠に平行線やねん。",
      "bestName": "雨宿りうさぎ",
      "worstName": "無愛想なロボ"
    }
  }
}