{
  "INTJ": {
    "name": "ラグジュアリー猫",
    "emoji": "cat",
    "tagline": "クールぶってるが、脳内は「俺様が一番正しい」の特権意識モンスター",
    "traits": ["選民意識の塊", "他人の成功に毒づく", "完璧主義の皮を被った臆病者", "孤高気取りの寂しがり屋"],
    "description": "表面はクールで知的な雰囲気を漂わせているが、その仮面の裏には「自分以外全員バカ」という壮大な勘違いが潜んでいる。他人の成功を見ると「運が良かっただけ」と陰で毒づき、自分の失敗は「周りのレベルが低いせい」と責任転嫁。でも本人は「論理的に正しいことを言っているだけ」と本気で思っている。",
    "weakness": "クールぶってるが、脳内は「俺様が一番正しい」という特権意識の塊。他人の成功を見ると「運が良かっただけ」と陰で毒づく。承認欲求が異常に高いくせに、自分からは絶対にそれを見せない。",
    "date": "刺激の少ない静かなブックカフェ。知的な空間で「私はあなたのレベルに合わせてあげてる」感を出させてあげるのがコツ。美術館の特別展や、隠れ家的なバーも◎。間違っても騒がしい居酒屋に連れて行ってはいけない。",
    "attractive": "質問攻めを封印し、「沈黙の美学」を貫く。余計なことを喋らず、たまに深い一言を落とすのが最強ムーブ。「わかってる感」を出せれば勝ち。相手の専門分野を事前にリサーチしておくと尊敬ポイント爆上がり。",
    "approach": "「〇〇の独自理論、誰も真似できないね。天才じゃない？」——この一言で承認欲求のダムが決壊する。知性を褒められることに飢えているので、ピンポイントで刺せ。"
  },
  "ENFP": {
    "name": "路地裏チワワ",
    "emoji": "dog",
    "tagline": "明るいふりして、一人になると盛大に拗ねる構ってちゃんモンスター",
    "traits": ["笑顔の裏の闇", "構ってちゃん攻撃", "飽き性の権化", "感情のジェットコースター"],
    "description": "どこにいても中心にいたがる目立ちたがり屋。「面白い」「楽しい」が口癖だが、一人になった途端「誰も本当の自分を理解してない」と盛大に病む。新しいもの好きだが、飽きるスピードも異常。恋愛でも同じパターンを繰り返す。",
    "weakness": "明るいふりして、一人になると「誰も自分を理解してない」と盛大に拗ねる。寂しさから相手を試すような「構ってちゃん攻撃」を仕掛ける。飽きっぽいくせに捨てられるのは死ぬほど怖い。",
    "date": "毎日変わる新オープン施設や謎のイベント。とにかく「初めて」と「刺激」に弱い。インスタ映えスポットは必須。予定はガチガチに決めず、ノープランで「次どこ行く？」のワクワク感を演出。",
    "attractive": "突飛なアイデアを「神の啓示！」と全力で全肯定。どんなに意味不明な提案でも「天才じゃん！」と目をキラキラさせろ。否定した瞬間、心のシャッターが音を立てて閉まる。",
    "approach": "「〇〇といると毎日が冒険！ 世界が派手に輝いて見えるよ」——特別感と冒険心をくすぐれば、尻尾を振って寄ってくる。"
  },
  "ESTJ": {
    "name": "爆走ライオン",
    "emoji": "lion",
    "tagline": "完璧主義の仮面の下で「誰も私を助けてくれない」と被害妄想中",
    "traits": ["支配欲の権化", "部下disが趣味", "弱み見せたら死ぬ病", "隠れ甘えん坊"],
    "description": "「俺についてこい」が生きがいの自称リーダー。有言実行で頼りがいがあるように見えるが、他人のミスを心の中で「この下手くそが！」とdisるのが実は快感。完璧主義の鎧を脱げない不器用さが最大の弱点。",
    "weakness": "完璧主義の仮面の下で「誰も私を助けてくれない」と被害妄想。部下や他人のミスを心の中で「この下手くそが！」とdisるのが趣味。本当は甘えたいけど甘え方がわからない不器用な王様。",
    "date": "予約困難な名店や、達成感のあるスポーツ。「自分が一番」と思える場所に連れて行け。ゴルフ、高級焼肉、スポーツ観戦のVIP席。安っぽい店は即アウト。",
    "attractive": "基本は尊重しつつ、たまに「今日は私が全部仕切るね」と甘えさせる。普段は絶対に弱みを見せないので、「頑張らなくていいよ」の一言で思わず涙腺が崩壊する。",
    "approach": "「いつも完璧だけど、私の前ではただのダメ人間でいいんだよ？」——鎧を脱がせる一言。これを言えるのはあなただけ、という特別感が致命傷になる。"
  },
  "ESFJ": {
    "name": "ひだまりレトリバー",
    "emoji": "retriever",
    "tagline": "「みんなのために」が口癖だが、実は依存煽り職人",
    "traits": ["承認欲求の化身", "依存させるプロ", "切り捨て上手", "自己犠牲風マウント"],
    "description": "「あなたのためを思って」が殺し文句の世話焼き番長。周囲からは「いい人」認定だが、実は「私が必要とされない世界」を許せない依存煽り職人。用済みになった相手は無表情で切り捨てる残酷さも持ち合わせている。",
    "weakness": "「みんなのために」が口癖だが、実は「私が必要とされない世界」を許せない依存煽り職人。用済みになった相手は無表情で切り捨てる。「嫌われたくない」が全行動の原動力。",
    "date": "ほっこりできるアニマルカフェやピクニック。「あなたが選んでくれたんだ」感がある場所なら何でも喜ぶ。サプライズ演出にめちゃくちゃ弱い。SNSに上げられる映えスポットも◎。",
    "attractive": "小さな配慮に気づき、大げさなくらい「ありがとう！」を連発。記念日は絶対に忘れるな。LINEの既読無視は宣戦布告と同義。こまめな連絡が命綱。",
    "approach": "「〇〇のおかげで私は救われてる。存在がもう、パワースポット。」——存在意義を全肯定されると、もう離れられなくなる。"
  },
  "ISTJ": {
    "name": "戦略ペンギン",
    "emoji": "penguin",
    "tagline": "真面目な顔して「ルール守れないヤツ全員消えろ」と呪ってる",
    "traits": ["ルール至上主義", "むっつりスケベ", "感情表現バグ", "裏オタク気質"],
    "description": "几帳面で真面目、信頼の塊に見えるが、内心では「ルールを守れないヤツ、全員いなくなればいいのに」と呪っている。表面はポーカーフェイスだが、裏ではかなりの妄想家。真面目すぎて逆に変態寄り。",
    "weakness": "真面目な顔して、裏では「ルールを守れないヤツ、全員いなくなればいいのに」と呪っている。下ネタや卑猥な妄想を一人で楽しむむっつり派。感情表現がバグっているので、嬉しくても無表情。",
    "date": "スケジュールが完璧に組まれた水族館。事前にプランを共有しておくと安心感MAX。「予約してあるから」の一言が最強の媚薬。定番デートスポットの方がハズレがなくて安心する。",
    "attractive": "マナーと礼儀を徹底。靴を揃えるレベルの「当たり前」で信頼を得る。遅刻は死罪。約束を守ることが最大の愛情表現。ドタキャンしたら二度と会えないと思え。",
    "approach": "「〇〇のその几帳面さ、正直ガチで尊敬する。真似したい。」——真面目さを評価してくれる人が圧倒的に少ないので、この一言は心に深く刺さる。"
  },
  "INFP": {
    "name": "雨宿りうさぎ",
    "emoji": "rabbit",
    "tagline": "穏やかに見えて、内面の「自分だけの正義」が暴走すると一生粘着",
    "traits": ["脳内妄想族", "自分正義の暴走", "ダーク趣味持ち", "怒ると一生粘着"],
    "description": "穏やかで繊細な芸術家タイプに見えるが、脳内では壮大なダークファンタジーが展開中。「自分だけの正義」に火がつくと一生粘着してくる執念深さを秘めている。誰も知らないダークな趣味で密かにストレス発散中。",
    "weakness": "穏やかに見えるが、内面の「自分だけの正義」が暴走すると一生粘着してくる。誰も知らないダークな趣味で、密かに外界のストレスを発散中。キレたら過去の罪状を全部引っ張り出してくる。",
    "date": "感性を刺激する美術館や、お洒落なセレクトショップ。「あなたと見たい世界がある」的な誘い方が刺さる。静かなカフェで深い話をする時間が何より幸せ。騒がしい場所は魂が抜ける。",
    "attractive": "無理に聞き出そうとせず、相手のペースにひたすら寄り添う。「わかるよ」の共感ワードを散りばめろ。作品や価値観を否定した瞬間、永遠にブラックリスト入り。",
    "approach": "「言葉にしなくても、〇〇の内面の深さ、私には伝わってくるよ。」——「理解されている」感覚に飢えているので、この一言で完全に心を開く。"
  },
  "ISTP": {
    "name": "職人ウルフ",
    "emoji": "wolf",
    "tagline": "無愛想をクールで片付けてるコミュ障、論破マウントが快感",
    "traits": ["コミュ障をクールと勘違い", "論破マウント中毒", "束縛されたら死ぬ", "不器用な愛情表現"],
    "description": "寡黙でクールな一匹狼を気取っているが、実態はただのコミュニケーション不全。マニアックな知識で他人を論破してマウントを取るのが密かな快感。束縛されると本気で消える。",
    "weakness": "無愛想を「クール」で片付けているが、実際はただのコミュニケーション不全。マニアックな知識で他人を論破してマウントを取るのが快感。好きな人の前だと更にコミュ障が加速する。",
    "date": "工作ワークショップや、ガジェット巡り。一緒に何かを「作る」体験が最強。ドライブやホームセンター巡りでも可。会話より「並んで同じことをする」時間を重視。",
    "attractive": "一人時間を絶対に邪魔しない。「束縛ゼロ」が最大のプレゼント。LINEの返信が遅くても絶対に責めるな。「放っておいてくれる人」が一番好き。",
    "approach": "「〇〇の専門的な話、もっと聞かせて。マジでハマるわ。」——自分の得意分野に興味を持ってくれる人に弱すぎる。これだけで心の扉が開く。"
  },
  "ESFP": {
    "name": "お祭りパンダ",
    "emoji": "panda",
    "tagline": "脳天気に見えて「この集まりクソつまんねぇ」と心で毒吐いてる",
    "traits": ["ムードメーカー仮面", "心の八つ当たり常習犯", "寂しがり屋の脳天気", "逃避行動の天才"],
    "description": "どんな場でもムードメーカーを買って出る陽キャの鑑。だが疲れが溜まると「この集まり、クソつまんねぇ」と心で毒を吐いている。場の空気が悪くなると「お前のせいだ！」と心で八つ当たり。楽しいことで不安を紛らわせる逃避行動の天才。",
    "weakness": "脳天気に見えて、実は場の空気が悪くなると「お前のせいだ！」と心で八つ当たり。疲れが溜まると「この集まり、クソつまんねぇ」と毒を吐く。楽しいことで将来の不安から逃げ続けている。",
    "date": "ライブやフェス。五感を揺さぶる賑やかな場所。食べ歩き、テーマパーク、花火大会は鉄板。「何する？」より「行こう！」の勢いが大事。インスタ映えは必須条件。",
    "attractive": "一緒に馬鹿みたいに大笑いする。感情を120%共有。「楽しい！」「美味しい！」のリアクションはMAXで。テンション低い人は即戦力外通告。",
    "approach": "「〇〇といる瞬間が人生のピーク！ 今日が最高すぎて死ねる！」——大げさなくらいの全力感が一番刺さる。冷静な告白は響かない。"
  }
}
