{
  "INTJ": {
    "name": "夜景の黒猫",
    "emoji": "cat",
    "tagline": "「俺以外全員バカ」を心の中で100回唱えてる闇の選民",
    "traits": [
      "脳内選民思想",
      "他人の成功=許せない",
      "完璧主義（笑）",
      "孤高ぶった寂しがり"
    ],
    "front": "😇 表向きは冷静で知的なオーラをまとった「できる人」。\n\n✨ 余計なことは言わず、的確なアドバイスで周囲から一目置かれている。\n\n🧊 感情に流されず、常にロジカルに物事を判断するクールな存在。\n\n🎯 趣味や仕事に対してストイックで、「あの人は別格」と思われている。",
    "hidden": "👿 その仮面の裏には「自分以外全員バカ」という壮大な勘違いが潜んでいる。\n\n🤮 他人の成功を見ると「運が良かっただけ」と陰で毒づき、自分の失敗は「周りのレベルが低いせい」と責任転嫁。\n\n💀 承認欲求が異常に高いくせに、自分からは絶対にそれを見せない。\n\n😭 孤高を気取っているが、実は「誰か俺の凄さに気づいてくれ」と心の中で叫んでいる。",
    "manual": "✅ 【攻略法】議論で感情論ぶつけたら一発アウトやで。🧠 「なるほど、その視点はなかったわ」ってまず受け止めてから反論したら、こっちの話も聞いてくれるようになるねん。👑 最初に知性を認めるひと言入れるんが鉄則や、これ絶対やで。📚 相手の専門分野をリサーチしとくと尊敬ポイントがごっつ上がるわ。知らんけど。\n\n💣 【地雷ポイント】頭ごなしに否定したら一生口きいてくれへんくなるで。🚫 「みんなそう言うてるで」とかいう同調圧力は最大の侮辱やねん。😤 感情的に泣いたり怒ったりしたら「こいつレベル低いわ」って判定されて終了や。ほんまに気ぃつけや。",
    "date": "🎬 【シミュレーション】隠れ家みたいなブックカフェで待ち合わせや → 🖼️ 美術館の特別展でお互い無言で鑑賞するねん → 🍷 静かなバーで「あの作品の解釈やけどな…」って議論スタートや。🤩 ここで知的な会話できたら内心ニヤニヤが止まらんようになるで。🙅 間違ってもうるっさい居酒屋やカラオケに連れてったらあかん。ほんまあかんで。\n\n📍 【おすすめスポット】美術館・博物館の企画展、隠れ家バー、天体観測スポット、古書店巡り",
    "killer": "💘 「〇〇の独自理論、誰にも真似できへんよな。天才ちゃう？」——💥 この一言で承認欲求のダムが決壊するで。🎯 知性を褒められることに飢えてるから、ピンポイントで刺したれ。知らんけど。",
    "love": "💑 【付き合うとこうなる】表面上は「放っておいてくれ」と言いながら、裏ではLINEの返信速度を0.1秒単位で計測している。\n\n📅 記念日には興味ないフリをしつつ、1ヶ月前から脳内でプランを練り上げている完璧主義。\n\n🫠 「俺の理論を理解できるのはお前だけ」と言い出したら完全に堕ちた証拠。\n\n⚔️ ケンカになると論理武装で相手を完全論破するが、3日後に「言い過ぎた…」と小声で謝るツンデレ極振り。\n\n📖 愛情表現は壊滅的に下手だが、相手の好きな本をこっそり全巻揃えるタイプ。\n\n⚠️ 【恋愛キケン度】★★★★☆\n🌀 自分の世界に入り込みすぎて相手の存在を忘れることがある。\n\n😢 「俺といても楽しくないだろ？」という自虐が始まったら、実は構ってほしいサイン。"
  },
  "INFJ": {
    "name": "高嶺の花子さん",
    "emoji": "flower",
    "tagline": "「誰も私を理解できない」に酔ってるメンヘラ理想主義者",
    "traits": [
      "理想高すぎ問題",
      "自己犠牲に酔う",
      "温厚の皮被った腹黒",
      "被害妄想マスター"
    ],
    "front": "😇 穏やかで優しく、困っている人を放っておけない理想主義者。\n\n👂 聞き上手で、相手の気持ちを深く理解してくれる「心の拠り所」的存在。\n\n🌟 グループでは控えめだが、いざという時に核心を突く発言をして皆を驚かせる。",
    "hidden": "👿 内心では「こんなに深い私を理解できる人はいない」と常にどこか上から目線。\n\n🔄 人間関係に深入りしすぎて、勝手に期待して勝手に失望する無限ループの住人。\n\n🪓 自分の世界観に合わない人間は静かに切り捨てる冷酷さを持ち、裏切られたと感じると一生許さない執念深さがある。\n\n💀 自己犠牲に酔っている自分に気づいていない。",
    "manual": "✅ 【攻略法】表面的な会話はむしろ逆効果やで。💬 「最近どう？」より「あの件どう思った？」って深い話題振ったら心開くねん。🤫 二人きりの方が本音しゃべるから、大人数のとこでは距離縮まらへんで。🫶 「あんたの考え、深いなぁ」って本気で共感したったら信頼勝ち取れるわ。\n\n💣 【地雷ポイント】嘘の共感は速攻バレるで、なめたらあかん。🚫 裏切りは絶対NG、一回信頼失ったら二度と戻らへんねん。😱 大人数の飲み会に無理やり誘うのは魂抜ける行為やで。🔪 「考えすぎちゃう？」は最悪のひと言や。ほんまにこれだけは言ったらあかん。",
    "date": "🎬 【シミュレーション】雰囲気ええプラネタリウムで待ち合わせや → 🍽️ 静かな湖畔のレストランで人生観について語り合うねん → 🌙 帰り道に「今日、特別やったわ」って伝えたら心の扉全開になるで。🎁 事前に相手の好みリサーチしとく「計画的サプライズ」が最強やねん。知らんけど。\n\n📍 【おすすめスポット】プラネタリウム、静かな水辺のレストラン、個室のある隠れ家カフェ、小さな映画館のレイトショー",
    "killer": "💘 「〇〇みたいに、本質見抜ける人は初めてやわ。もっとその世界知りたいねん。」——💥 「唯一の理解者」ポジション取れたら圧勝や。知らんけど。",
    "love": "💑 【付き合うとこうなる】「運命の人に出会えた」と確信した瞬間から、相手を理想のパートナー像に仕立て上げるプロジェクトが始まる。\n\n🌃 深夜3時に「私たちの関係の本質って何だと思う？」と哲学的LINEを送りつけてくる。\n\n😮‍💨 相手の悩みを自分の痛みとして引き受けすぎて、勝手に疲弊→「こんなに尽くしてるのに…」と被害者モードに突入。\n\n📓 ケンカすると一切口を利かず、日記に恨みを書き連ねるタイプ。\n\n💎 ただし本気で愛した相手には、人生を捧げるレベルの献身を見せる。\n\n⚠️ 【恋愛キケン度】★★★★★\n🌋 理想と現実のギャップに苦しみ、「あなたは私が思っていた人と違う」と突然の失望宣言をする。\n\n📉 期待値コントロールが崩壊しがち。"
  },
  "INTP": {
    "name": "無愛想なロボ",
    "emoji": "robot",
    "tagline": "感情? なにそれ食えんの? な天然マウントロボ",
    "traits": [
      "感情=エラー",
      "空気? 読めません",
      "屁理屈の神",
      "興味ないことは無"
    ],
    "front": "😇 物静かで知的なオーラを漂わせるインテリタイプ。\n\n🧠 専門分野の知識は圧倒的で、聞けば何でも論理的に説明してくれる頼れる存在。\n\n🧊 感情に左右されない冷静さがあり、トラブル時にも動じない安定感がある。",
    "hidden": "👿 他人の感情は「処理不能なバグ」として脳内で弾かれている。\n\n🤖 悪気はないが「それ、論理的におかしくない？」が口癖で、周囲を地味に傷つけ続けている自覚がゼロ。\n\n🔬 興味があることには異常な集中力を見せるが、興味がないことは存在しないかのように無視。\n\n💀 「正しければ何を言ってもいい」と本気で思っている。",
    "manual": "✅ 【攻略法】「これってなんでなん？」って知的好奇心くすぐる質問で距離縮めるんが正解やで。🎯 議論を楽しめる相手やって認識されたら勝ちやねん。📱 返信遅いんは嫌いやからちゃうで、「返す必要感じてへん」だけやから催促したら逆効果や。ほんまにせんといてな。\n\n💣 【地雷ポイント】感情論で攻めたら即シャットダウンやで。🚫 「空気読んでや」は処理不能エラー起こす禁句やねん。💥 催促LINE3連投したら「めんどくさい人」フォルダに永久追放されるで。知らんけど。",
    "date": "🎬 【シミュレーション】科学館かボードゲームカフェで待ち合わせや → 🧩 一緒に何かの仕組み考える体験型イベント行くねん → 🗣️ 「あの理論って実はな…」って議論盛り上がったら大成功や。💔 しっとりしたデートは相手がバグるで。🤝 会話より「一緒に考える」体験が大事やねん。ほんまそれ。\n\n📍 【おすすめスポット】科学館、ボードゲームカフェ、VR体験施設、プログラミングワークショップ、謎解きイベント",
    "killer": "💘 「〇〇の頭ん中、覗いてみたいわ。その思考回路、めっちゃおもろいねん。」——💥 知性への好奇心見せるんが最短ルートやで。",
    "love": "💑 【付き合うとこうなる】恋愛をロジックで解こうとして盛大にバグる。\n\n🤔 「好きという感情の定義とは？」と真顔で考え始めたら、それはもう恋。\n\n📊 デートプランをスプレッドシートで管理し、「最適化されたルート」を提案してくるが、相手の感情を読むセンサーが壊れているので「今日楽しかった？」のタイミングが常にズレている。\n\n📅 記念日を忘れるのではなく「記念日という概念の必要性」を疑問視している。\n\n🖥️ ただし、一度ハマると相手の全データを分析して「この人の幸福度を最大化するにはどうすべきか」を本気で計算し始める。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n🔀 感情のすれ違いが日常茶飯事だが、悪気はゼロ。\n\n😶 「なんで怒ってるの？」が本気で分かっていない。\n\n💪 根気強い相手じゃないと持たない。"
  },
  "ISTP": {
    "name": "偏屈狼",
    "emoji": "wolf",
    "tagline": "「クールでしょ?」いや、ただのコミュ障やで",
    "traits": [
      "コミュ障=クール（笑）",
      "論破中毒",
      "束縛=酸欠",
      "不器用MAX"
    ],
    "front": "😇 寡黙で頼りがいのある実力派。\n\n🔧 口数は少ないが、やることはきっちりやるタイプ。\n\n✋ 手先が器用で、趣味や仕事に対する集中力は凄まじい。\n\n🕶️ 余計なことを言わない「大人の男/女」という印象。",
    "hidden": "👿 クールを気取っているが、実態はただのコミュニケーション不全。\n\n🏆 マニアックな知識で他人を論破してマウントを取るのが密かな快感。\n\n😶 好きな人の前だと更にコミュ障が加速して、結果「嫌ってるの？」と誤解される不器用さ。\n\n💨 束縛されると本気で消える。",
    "manual": "✅ 【攻略法】一人の時間を絶対に邪魔したらあかん。🏝️ 「放っといてくれる人」が一番仲良くなれるねん。🎮 共通の趣味見つけて「並んで同じことする」時間大事にしたら勝手に心開くで。📱 LINEの返信遅くても絶対責めたらあかんで。ほんまこれ鉄則や。\n\n💣 【地雷ポイント】「何考えてるん？」の詰問は逃走トリガーやで。🚫 過度なスキンシップや感情の押し付けは致命傷やねん。😵 予定ギチギチに詰め込んだら窒息するで。知らんけど。",
    "date": "🎬 【シミュレーション】ホームセンターかガジェット店で待ち合わせや → 🔨 工作ワークショップで一緒になんか作るねん → 👊 完成品見て「やるやん」って短くお互い認め合う。🏆 これが最高のデートやで。🤝 会話より「並んで同じことする」時間が至福やねん。ほんまそれ。\n\n📍 【おすすめスポット】DIYワークショップ、ガジェットショップ巡り、ドライブ（行き先は適当でOK）、釣り、アウトドア",
    "killer": "💘 「〇〇の専門的な話、もっと聞かせてや。マジでハマるわ。」——💥 自分の得意分野に興味持ってくれる人にめっちゃ弱いねん。🔑 これだけで心の扉開くで。知らんけど。",
    "love": "💑 【付き合うとこうなる】「付き合おう」ではなく気づいたらなんとなく一緒にいる、という始まり方が多い。\n\n🔧 愛情表現は言葉ではなく行動派——黙って車を直す、壊れた棚を修理する、重い荷物を持つ。\n\n😒 だが「ありがとう」と言われるのが照れくさくて「別に、暇だったし」と素っ気ない。\n\n😵‍💫 束縛されると酸素がなくなる感覚になり、最悪の場合は予告なしに蒸発する。\n\n🫥 好きな人の前でこそ無愛想になる矛盾で、「嫌われてるのかな」と相手を不安にさせる天才。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n🏝️ 一人時間を確保してあげれば長続きする。\n\n🤐 「何考えてるの？」を封印できるかが分かれ道。\n\n🔍 愛されてる実感は薄いが、行動をよく見れば答えが分かる。"
  },
  "ENTJ": {
    "name": "やかまし上司",
    "emoji": "bigmom",
    "tagline": "「俺に従え」が口癖の支配欲モンスター",
    "traits": [
      "支配欲∞",
      "有能だけど独裁者",
      "弱み見せたら死ぬ",
      "隠れ面倒見いい"
    ],
    "front": "😇 生まれながらのリーダー気質。\n\n💪 決断力があり、グループを引っ張る頼もしい存在。\n\n🔥 仕事もプライベートも常に全力で、その行動力に周囲は圧倒される。\n\n🛡️ 困った時に相談すれば、必ず具体的な解決策を出してくれる。",
    "hidden": "👿 リーダーシップと独裁の区別がついていない。\n\n👑 「俺に従えば全員幸せになれる」と本気で信じており、反論されると「こいつ無能だな」と内心で見下す。\n\n🎭 完璧じゃない自分を絶対に見せたくないので、疲れても弱音を吐けない。\n\n💀 実は仲間の成長を誰よりも喜ぶツンデレ支配者。",
    "manual": "✅ 【攻略法】自分の意見しっかり言いつつ、最終判断は相手に任せるんが黄金パターンやで。⚖️ 「対等に議論できる相手」って認められたら一目置かれるねん。🫂 弱音吐いた瞬間は絶対に茶化したらあかん。😢 たまに「頑張りすぎやで」って言うたったら内心泣いてるわ。ほんまにな。\n\n💣 【地雷ポイント】イエスマンになったら見下されるで。🚫 優柔不断な態度は「無能認定」のフラグや。💥 公の場で恥かかせたら二度と許されへん。知らんけど。",
    "date": "🎬 【シミュレーション】予約困難な名店にドーンと入店や → 😏 「ここ、俺/私のおすすめやねん」ってドヤ顔で案内するで → 🌃 食後は夜景見えるバーで将来の野望語り出すわ。🤝 相手のビジョンに共感しつつ、自分の意見もバシッと言えたら好感度MAXやで。🙅 安っぽい店やったら二度目はないで。ほんまに。\n\n📍 【おすすめスポット】予約困難な名店、ルーフトップバー、高級ホテルのラウンジ、スポーツ観戦のVIP席",
    "killer": "💘 「〇〇についていきたいわ。でもたまには弱いとこ見せてや。」——💥 支配者の仮面外す許可証やで。🔑 このひと言で心崩れるねん。知らんけど。",
    "love": "💑 【付き合うとこうなる】交際初日から「5年後のビジョン」を共有しようとしてくる。\n\n📋 デート先も旅行先も相手の意見を聞くフリをしつつ最終決定権は絶対に手放さない。\n\n💪 「俺/私がいないとダメでしょ」が口癖になり、気づいたら人生プランを全部仕切られている。\n\n🌟 ただし、その裏で相手のキャリアを本気で応援し、出世したら自分のことのように喜ぶ面倒見の良さも。\n\n🌙 深夜に弱音を吐いた日は「聞かなかったことにして」と言うが、本当は聞いてほしくてたまらない。\n\n⚠️ 【恋愛キケン度】★★★★☆\n⚔️ 主導権争いが日常化する覚悟が必要。\n\n🏰 ただし「この人についていこう」と決めたら、世界一頼もしいパートナーになる。"
  },
  "ESTJ": {
    "name": "爆走ライオン",
    "emoji": "lion",
    "tagline": "完璧主義こじらせて「誰も助けてくれへん」って被害妄想中",
    "traits": [
      "完璧主義の暴君",
      "他人dis大好き",
      "弱み見せたら終わり",
      "実は甘えたい"
    ],
    "front": "😇 責任感が強く、約束は絶対に守る信頼の塊。\n\n🦁 有言実行で頼りがいがあり、グループでは自然とまとめ役を買って出る。\n\n🔥 仕事も遊びも全力で、「この人に任せれば大丈夫」と思われている。",
    "hidden": "👿 他人のミスを心の中で「この下手くそが！」とdisるのが実は快感。\n\n🛡️ 完璧主義の鎧を脱げない不器用さが最大の弱点で、「誰も私を助けてくれない」と被害妄想に陥りがち。\n\n💀 本当は甘えたいけど甘え方がわからない不器用な王様。",
    "manual": "✅ 【攻略法】時間厳守・約束厳守が信頼構築の絶対条件やで。🫂 基本は尊重しつつ、たまに「今日は私が全部仕切ったるわ」って甘えさせたりな。😭 「頑張らんでええんやで」のひと言で涙腺崩壊するで。ほんまに。\n\n💣 【地雷ポイント】ドタキャンは死罪やで。🚫 遅刻は信頼崩壊の始まりやねん。💥 「適当でええやん」は全存在を否定する言葉や。ほんまこれだけは言ったらあかん。知らんけど。",
    "date": "🎬 【シミュレーション】予約してある高級焼肉店にきっちり5分前到着や → 🥩 「ここのタン塩は最高やで」って仕切り始めるねん → 📝 食後は「次の計画も立てとくな」って言えたら内心キュンキュンやで。😌 予定通りに進むデートが安心するねん。🎁 サプライズは嬉しいより「聞いてないんやけど？」が先に来るわ。ほんまめんどくさいやろ。\n\n📍 【おすすめスポット】予約済みの名店、ゴルフ、スポーツ観戦、達成感のあるアクティビティ",
    "killer": "💘 「いっつも完璧やけど、私の前ではただのダメ人間でええんやで？」——💥 鎧脱がせるひと言や。🔑 これ言えるんはあんただけ、っていう特別感が致命傷になるで。知らんけど。",
    "love": "💑 【付き合うとこうなる】恋人にも「報告・連絡・相談」を求めてくる元上司タイプ。\n\n📊 デートの感想をフィードバックのように求め、「次はもっと良くしよう」と改善提案を始める。\n\n😤 完璧主義すぎて相手の小さなミスにもイライラするが、本人は「怒ってない」と言い張る。\n\n😭 だが本当は、自分の弱さを受け止めてくれる相手を死ぬほど求めていて、甘えられた瞬間に涙腺が崩壊する。\n\n🏠 家事も仕事も完璧にこなすが、「ありがとう」がないと心が折れるガラスのライオン。\n\n⚠️ 【恋愛キケン度】★★★★☆\n😵 相手に完璧を求めすぎて息苦しくなる。\n\n🫶 でも「がんばらなくていいよ」の一言で救われる。\n\n💕 甘えさせ上手な人が最強の相性。"
  },
  "ENTP": {
    "name": "ナルシスト拡声器",
    "emoji": "parrot",
    "tagline": "論破が趣味で飽きたら即バイバイの知的クズ",
    "traits": [
      "論破=快感",
      "飽きたら即撤退",
      "口だけ番長",
      "刺激なしは死"
    ],
    "front": "😇 話題が豊富で、どんな場でも会話を盛り上げるエンターテイナー。\n\n💡 アイデアマンで、新しい企画や提案を次々と生み出す。\n\n📚 知識の幅が広く、「この人と話すと面白い」と思われる人気者。",
    "hidden": "👿 議論の目的は「正しさの追求」ではなく「相手を論破する快感」。\n\n🦋 新しいアイデアを次々生み出すが、実行する前に飽きて次へ。\n\n🗣️ 口は達者だが行動が伴わない知的口だけ番長。\n\n💀 自分が一番面白いと本気で思っている。\n\n🎭 表面的な知り合いは多いが本当の友達は少ない。",
    "manual": "✅ 【攻略法】「それは違うと思うわ。なんでかっていうとな…」って冷静に反論できる人に一目置くねん。🧠 知的なツッコミが一番距離縮めるで。⚡ 退屈が最大の敵やから、予定通りの付き合いより突発的なイベントの方がええねん。ほんまに刺激命やで。\n\n💣 【地雷ポイント】「すごいなぁ」って褒めるだけの人はなめられるで。🚫 感情的に怒ったら「つまらんやつ」判定されて終了やねん。🥱 同じ話題繰り返したら飽きて消えるわ。知らんけど。",
    "date": "🎬 【シミュレーション】「おもろい店見つけたんやけど、今から行かへん？」って突発的に誘うのが正解や → 🧩 謎解きカフェや脱出ゲームで知的バトルするねん → 🎲 「次は〇〇やってみぃひん？」って次の刺激提案し合うんや。😴 予定通りのデートは退屈で死ぬから、ハプニング歓迎する姿勢が大事やで。ほんまそれ。\n\n📍 【おすすめスポット】脱出ゲーム、謎解きカフェ、お笑いライブ、トークイベント、新オープンの話題の店",
    "killer": "💘 「〇〇の発想力、マジで化け物やわ。一緒におったら脳バグるねん。」——💥 知的に認められたい欲求を直撃やで。🏆 退屈させへん相手やと思わせたら勝ちや。知らんけど。",
    "love": "💑 【付き合うとこうなる】「来週〇〇行こう！」→ 当日「やっぱ△△にしない？」→ 結局□□に行く。\n\n🔄 予定が二転三転するのがデフォルト。\n\n🎯 恋愛初期は全力で口説いてくるが、相手が完全に堕ちた瞬間に「なんか違うかも」と冷め始めるハンター気質。\n\n🍝 議論好きすぎて「ここのパスタ美味しいね」にすら「いや、本当に美味しいパスタとは何かを考えると…」と反論が始まる。\n\n💎 ただし、知的に対等な相手には一生飽きない。\n\n✨ 退屈さえしなければ、世界一楽しい恋愛になる。\n\n⚠️ 【恋愛キケン度】★★★★★\n🦋 飽きたら終了。\n\n🏃 追いかけてくる相手には冷め、逃げる相手を追いかける矛盾。\n\n💫 常に新鮮さを供給し続けないと消える。"
  },
  "ENFP": {
    "name": "路地裏チワワ",
    "emoji": "dog",
    "tagline": "笑顔の裏で「私のこと好き？ ねぇ好き？」が止まらん",
    "traits": [
      "笑顔の裏は闇",
      "構って攻撃",
      "飽き性の権化",
      "感情ジェットコースター"
    ],
    "front": "😇 どこにいても場を明るくするムードメーカー。\n\n🌈 好奇心旺盛で新しいことが大好き、一緒にいると楽しいことが次々起こる。\n\n🐶 人懐っこくて誰とでもすぐ仲良くなれる、グループのアイドル的存在。",
    "hidden": "👿 一人になった途端「誰も本当の自分を理解してない」と盛大に病む。\n\n🪤 寂しさから相手を試す「構ってちゃん攻撃」を仕掛けるくせに、飽きっぽいので自分から離れることも多い。\n\n💀 捨てられるのは死ぬほど怖いのに、自分は平気で新しい人間関係に飛びつく矛盾の塊。",
    "manual": "✅ 【攻略法】突飛なアイデアを「それめっちゃええやん！」って全力で全肯定したれ。🎉 テンション高めのリアクションが命綱やで。🤗 「試し行動」にはムキにならんと「ちゃんとここにおるで」って安心させたるんが正解やねん。📰 常に新しい話題用意しとき。ほんまにネタ切れしたらあかんで。\n\n💣 【地雷ポイント】否定した瞬間、心のシャッターがガシャーンって閉まるで。🚫 既読無視は存在否定と同義やねん。🔥 「落ち着きや」は火に油やで。💔 長時間の無関心は致命傷や。ほんまに構ったって。知らんけど。",
    "date": "🎬 【シミュレーション】新オープンのインスタ映えスポットへ直行や → 🗺️ 「次どこ行く？」のノープラン感演出するねん → 🏃 突然「あそこ行ってみたい！」に全力で付き合ったれ。📋 予定はガチガチに決めんと、ワクワク感演出するんがコツやで。💀 マンネリは死やで。ほんまに。\n\n📍 【おすすめスポット】新オープン施設、フォトジェニックカフェ、フリマ・マルシェ、花畑、イルミネーション",
    "killer": "💘 「〇〇といると毎日が冒険やわ！ 世界がめっちゃ派手に輝いて見えるで」——💥 特別感と冒険心くすぐったら、尻尾振って寄ってくるで。知らんけど。",
    "love": "💑 【付き合うとこうなる】付き合った瞬間、LINEの頻度が10倍になる。\n\n📱 「今何してる？」「寂しくない？」「私のこと好き？」の3連投が日課。\n\n🎢 常にテンションMAXで愛情を表現してくるが、相手の反応が薄いと即座に「もう飽きた？」と病み始める。\n\n🎂 サプライズ好きで記念日を5個くらい勝手に制定するが、自分の飽き性のせいで3ヶ月後には全部忘れている。\n\n💯 でもその瞬間の愛情は100%本物。\n\n🎬 一緒にいると人生が映画みたいにカラフルになる。\n\n⚠️ 【恋愛キケン度】★★★★★\n🌊 感情の波が激しすぎてこっちが溺れる。\n\n🙅 安定を求める人には向かない。\n\n💀 「退屈」が最大の敵なので、マンネリ防止が命綱。"
  },
  "ISTJ": {
    "name": "鉄壁の金庫",
    "emoji": "vault",
    "tagline": "ルール破ったやつ全員死刑にしたいガチガチ石頭",
    "traits": [
      "ルール=命",
      "変化=恐怖",
      "感情表現=化石",
      "実は超心配性"
    ],
    "front": "😇 ルールと秩序を重んじる、信頼と安定の象徴。\n\n🔒 決められたことを完璧にこなし、約束は絶対に守る。\n\n🤐 口数は少ないが、やるべきことは黙々とやる堅実な人柄。\n\n🏅 「この人に任せれば間違いない」と思われている。",
    "hidden": "👿 変化を極度に恐れ、新しいことに挑戦する前に10個くらいリスクを並べる。\n\n🪨 感情表現がほぼゼロなので、好意を持っていても相手に一切伝わらない。\n\n⚖️ ルールを破る人間を心の底から軽蔑している。\n\n💀 でも内心では「嫌われてないかな…」と常に心配している。",
    "manual": "✅ 【攻略法】時間厳守は当たり前やで、遅刻なんかしたら一発退場やからな。📅 予定は事前にきっちり共有しとき、「当日決めよ〜」とか言うたら白目むかれるで。🤝 急な変更するんやったらちゃんと理由説明せえや、筋通せば聞いてくれるタイプやねん。💎 安定感と誠実さだけで勝負しとったらええねん、小細工いらんわ。ほんまに地味やけど、ちゃんとやることやる人が一番好かれるんやで、知らんけど。\n\n💣 【地雷ポイント】約束破ったらもう終わりや、信頼回復に1年はかかるで覚悟しとき。🚫 サプライズとかやめとけ、心臓止まりかけるから。😱 「ノリで決めようぜ〜」とか言うたら恐怖で固まるねん、あの人。💥 ルール無視は人格否定と同じレベルやからな、ほんまにやったらあかんで。",
    "date": "🎬 【シミュレーション】まず「何時にどこで何するか」を事前に共有しとくんや、これが一番大事やねん。🍣 きっちり時間通りに老舗の和食で落ち合って、5分前行動できたら合格や。🐟 食後は水族館を予定通り回って「次あれ見たいねん」って素直に言えたらこっちの勝ちやで。😊 予定通りに進むことが最大の幸福やねんこの人、波乱とかいらんのよ。ほんまに計画通りが一番ときめくとか、ある意味すごいわ。知らんけど。\n\n📍 【おすすめスポット】老舗和食店、水族館、博物館、温泉旅館（予約済みに限る）、定番の名所",
    "killer": "💘 「あんたの堅実さ、ほんまに安心するわ。ずっと隣におりたいねん。」——💥 「信頼されてる」って実感できる言葉が一番ぶっ刺さるねん。🔑 派手な口説き文句よりも日常の積み重ねが最強やで。ごっつ地味やけど、それが効くんやから仕方ないやろ。",
    "love": "💑 【付き合うとこうなる】恋愛も「規則正しく」進めたい人。\n\n📋 告白→交際→同棲→結婚のタイムラインを脳内で作成済み。\n\n🔁 毎週同じ曜日に同じ店でデートすることに至上の幸福を感じる。\n\n😐 サプライズには「嬉しい」より先に「聞いてないけど」が出る。\n\n🤐 感情表現がほぼゼロなので「好き」を言わないが、☕ 毎朝コーヒーを淹れてくれたり、相手の体調を誰よりも気にしたりと、行動で全部表現する。\n\n💍 浮気は宇宙が滅んでもしないが、相手に裏切られたら一生立ち直れない。\n\n⚠️ 【恋愛キケン度】★★☆☆☆\n🏆 安定感は全タイプ中No.1。\n\n😴 ただし刺激やロマンチックさを求める人には物足りない。\n\n🔒 「変わらない愛」を最高と思えるかどうかが分かれ道。"
  },
  "ISFJ": {
    "name": "戦略ペンギン",
    "emoji": "penguin",
    "tagline": "真面目な顔して「お前ら全員消えろ」って心で呪ってる",
    "traits": [
      "ルール原理主義",
      "むっつり",
      "感情バグってる",
      "隠れオタク"
    ],
    "front": "😇 几帳面で真面目、信頼の塊。\n\n🐧 頼まれたことは完璧にこなし、陰ながら周囲をサポートする縁の下の力持ち。\n\n💪 控えめだけど芯が強く、困った時に静かに助けてくれる安心感のある存在。",
    "hidden": "👿 内心では「ルールを守れないヤツ、全員いなくなればいいのに」と呪っている。\n\n🎭 表面はポーカーフェイスだが、裏ではかなりの妄想家。\n\n😶 感情表現がバグっているので、嬉しくても無表情。\n\n💀 自分の趣味を一人でこっそり楽しむむっつり派。",
    "manual": "✅ 【攻略法】マナーと礼儀は徹底しとけよ、靴揃えるとかそういう「当たり前」ができん奴はもう論外やねん。👞 相手の好みを事前にリサーチして「予約しといたで」って言うたら、それだけでめっちゃ距離縮まるわ。📝 約束守ることが最大の信頼構築法やで、ほんまにこれだけでええねん。🤝 派手なことせんでええから、ちゃんとしとき。地味やけど、ちゃんとしてる人が好きやねんこの人は。知らんけど。\n\n💣 【地雷ポイント】遅刻は死罪やで、マジで。🚫 ドタキャンなんかしたら二度と会えへんと思っとき。😤 マナー違反は心の中の軽蔑メーターが振り切れるからな、見た目平気そうでも内心ブチギレてるで。💥 「適当でいいよ〜」とか言うても絶対信じてへんからな、あの人。ごっつ怖いやろ。",
    "date": "🎬 【シミュレーション】「予約してあるから」の一言が最強の殺し文句やねん、これだけで好感度爆上がりやで。🐧 スケジュール通りに水族館回って、ペンギンとか見ながらニコニコしてたら合格や。😊 「次は〇〇行きたいな」って控えめに提案してくれたら脈ありやで、ガッツポーズしとき。🎯 定番デートスポットの方がハズレなくて安心するタイプやから、奇をてらうのは逆効果やねん。知らんけど。\n\n📍 【おすすめスポット】水族館、動物園、予約済みのレストラン、季節の花が見れる公園、カフェ巡り",
    "killer": "💘 「あんたのその几帳面さ、正直ごっつ尊敬するわ。ほんまに真似したいねん。」——💥 真面目さをちゃんと評価してくれる人がめっちゃ少ないからな、この一言はごっつ心に刺さるんやで。みんなスルーするとこやからこそ、言うたもん勝ちやねん。",
    "love": "💑 【付き合うとこうなる】恋人のためにこっそり尽くす「影のサポーター」。\n\n🍫 冷蔵庫に好きなお菓子を補充する、体調悪い時にそっとポカリを置く、など言葉にしない愛情表現が得意。\n\n😤 ただし「やってあげたのに気づかない」と内心イラッとしていることが多く、不満を溜め込みすぎて突然爆発する。\n\n👀 嫉妬深いが本人は「別に」と絶対に認めない。\n\n🔍 相手の交友関係を密かにチェックしている監視型。\n\n💎 でも一途さは本物で、好きになったら何年でも待てる忍耐力がある。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n💣 不満を溜め込みすぎる点が最大のリスク。\n\n💬 「何か思ってることない？」と定期的にガス抜きしてあげるのが長続きの秘訣。"
  },
  "ISFP": {
    "name": "雨宿りうさぎ",
    "emoji": "rabbit",
    "tagline": "「この世界、眩しすぎるんよ…」って嘆いてるメンヘラうさぎ",
    "traits": [
      "繊細センサー過敏",
      "引きこもり常習",
      "芸術肌の変人",
      "突然キレる"
    ],
    "front": "😇 穏やかで優しいオーラを漂わせる癒し系。\n\n🎨 芸術的なセンスが光り、ファッションや音楽の趣味がおしゃれ。\n\n🕊️ 争いを嫌い、誰に対しても柔らかい態度で接する。\n\n🫶 そっと寄り添ってくれる存在。",
    "hidden": "👿 内面は過敏なセンサーだらけ。\n\n💔 些細な言葉で深く傷つき、一人の世界に引きこもって回復する。\n\n🌋 穏やかに見えるが、怒りの沸点を超えると過去の全てを引っ張り出してキレる。\n\n💀 感受性が豊かすぎて疲れやすく、「この世界は私には眩しすぎる」と嘆いている。",
    "manual": "✅ 【攻略法】無理に聞き出そうとしたらあかんで、相手のペースにひたすら寄り添うんや。🫂 「わかるわ〜」の共感ワードをめっちゃ散りばめとき。🖼️ 静かなカフェとか美術館とか、感性くすぐる場所で一緒に過ごしたら自然と心開いてくれるで。ガヤガヤしたとこ連れてったら魂抜けるから絶対やめとき。ほんまに繊細やねんこの人、扱い方間違えたらすぐ殻に閉じこもるで。知らんけど。\n\n💣 【地雷ポイント】作品とか価値観を否定した瞬間、永久にブラックリスト入りやで。🚫 「気にしすぎやって〜」は傷口に塩塗るようなもんやからな、絶対言うたらあかん。😵 騒がしい場所に連れてったら魂抜けて帰ってこーへんようなるで。💥 正論パンチは心をバキバキに折るからやめとけ、ほんまに。",
    "date": "🎬 【シミュレーション】おしゃれなセレクトショップで偶然を装って合流するんや、「あ、おったん？」みたいな感じがええねん。🖼️ 美術館を「あの色使いめっちゃ好きやわ」「わかる〜」って共感しながら巡るんやで。☕ 静かなカフェで深い話し始めたら大成功や、もうこっちのもんやで。💌 「あんたと見たい世界があんねん」的な誘い方がごっつ刺さるわ。ほんまにロマンチストやねんこの人。知らんけど。\n\n📍 【おすすめスポット】美術館、セレクトショップ巡り、静かなカフェ、花畑、夕焼けが綺麗なスポット",
    "killer": "💘 「言葉にせんでも、あんたの内面の深さ、うちにはちゃんと伝わってるで。」——💥 「理解されてる」って感覚にめっちゃ飢えてるからな、この一言で完全に心開くねん。ごっつ効くで、ほんまに。",
    "love": "💑 【付き合うとこうなる】相手の好みに全力で染まる「カメレオン恋愛」タイプ。\n\n🎵 好きな人の趣味を全部試し、音楽も映画も気づけば相手色に。\n\n🌸 デート中は五感で全てを感じ取り、「あの花綺麗だね」と些細な美しさを共有したがる。\n\n😶 ケンカが苦手すぎて不満を飲み込み続け、ある日突然「もう無理」とシャッターを降ろす。\n\n😰 繊細すぎて相手の些細な態度の変化に過敏反応し、「嫌われたかも」と脳内で壮大な悲劇が始まる。\n\n💎 でも、自分を丸ごと受け入れてくれた相手には、世界一ピュアな愛を捧げる。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n🎨 感受性が豊かすぎて疲れるが、共感力は最強。\n\n🖼️ 芸術系のデートで感性を共有すると絆が深まる。"
  },
  "INFP": {
    "name": "優しさ過剰装備",
    "emoji": "tofu",
    "tagline": "脳内ポエムが暴走して現実についていけてない妄想族",
    "traits": [
      "脳内ポエマー",
      "被害妄想の達人",
      "理想で自爆",
      "キレたら陰湿"
    ],
    "front": "😇 誰に対しても優しく、相手の気持ちに寄り添える共感力の持ち主。\n\n🎭 独自の世界観を持ち、創作や音楽、文学に造詣が深い。\n\n🌿 控えめだけど芯があり、大切なことには静かに声を上げる。",
    "hidden": "👿 メンタルが豆腐並みに柔らかく、ちょっとした批判で3日寝込む。\n\n🌋 理想が高すぎて現実に常にガッカリしている。\n\n🧠 「あの人、私のこと嫌いに違いない」と勝手に確信する被害妄想の達人。\n\n💀 優しさは本物だが過剰すぎて自分が潰れる。\n\n🔪 キレたら過去の罪状を全部引っ張り出す陰湿さも持つ。",
    "manual": "✅ 【攻略法】相手の夢とか理想は全肯定しとけ、「その世界観めっちゃ好きやわ」の一言が最強やねん。🫶 焦らんと時間かけて距離縮めるんやで。🎬 世界観ごっつ強い映画とか音楽を一緒に共有したら一気に仲良くなれるわ。✨ 「あんたの感性は特別やで」って何回でも言うたれ、それで信頼ゲットや。ほんまに褒めて褒めて褒めまくるのが正解やねん。知らんけど。\n\n💣 【地雷ポイント】否定は絶対あかん、それだけで終わりやで。🚫 現実的すぎるツッコミは毒薬と一緒やねん。🔪 「考えすぎやって」は全否定と同じやからな、絶対言うたらあかんで。💥 長期間シカトしたら被害妄想がえげつないことになるから、ほんまに気をつけとき。",
    "date": "🎬 【シミュレーション】世界観ごっつ強い映画を一緒に観るんや、ミニシアターとかがええで。💬 上映後に「あのシーンの意味、どう思った？」って感想共有するんやけど、ここでちゃんと深い話できたらもうこっちの勝ちやねん。📚 おしゃれな古本屋とかレトロ喫茶で余韻に浸って、「ええ映画やったな〜」ってしみじみするのが最高やで。🙅 ファミレスとか現実感強すぎる場所はテンションだだ下がりやから、絶対やめとき。知らんけど。\n\n📍 【おすすめスポット】ミニシアター、古本屋、レトロ喫茶、ミュージカル、世界観のある展覧会",
    "killer": "💘 「あんたの見てる世界、うちにも見せてくれへん？ ずっと一緒におりたいねん。」——💥 ポエティックに攻めるのが正解やで。🌙 現実的な言葉よりも、感性にぶっ刺さる表現で行け。ごっつ効くわ、ほんまに。",
    "love": "💑 【付き合うとこうなる】恋愛が始まると脳内で壮大なラブストーリーが展開される。\n\n📝 相手を「運命の人」に認定し、二人の未来を日記にポエムとして書き綴る。\n\n🎢 些細な一言で天国と地獄を行き来するメンタルの持ち主。\n\n😱 相手が他の異性と話すだけで被害妄想が爆発するが、本人は「別に気にしてない」と強がる。\n\n💔 理想の恋愛像が高すぎて「こんなはずじゃなかった」と勝手に幻滅することがある。\n\n💎 ただし、共感と理解で結ばれた関係は、どのタイプよりも深く、どのタイプよりも美しい。\n\n⚠️ 【恋愛キケン度】★★★★★\n🎢 メンタルの浮き沈みに巻き込まれる覚悟が必要。\n\n🌟 でも「世界で一番あなたを理解したい」と本気で思ってくれる稀有な存在。"
  },
  "ESTP": {
    "name": "お祭りパンダ",
    "emoji": "panda",
    "tagline": "ノリだけで生きてる脳天気のくせに心で毒吐きまくり",
    "traits": [
      "ムードメーカー仮面",
      "心で毒吐き中",
      "脳天気系寂しがり",
      "逃避の天才"
    ],
    "front": "😇 どんな場でもムードメーカーを買って出る陽キャの鑑。\n\n🎉 ノリが良く、一緒にいると楽しいことしか起こらない。\n\n🚀 行動力抜群で、「とりあえずやってみよう！」と周囲を巻き込む太陽のような存在。",
    "hidden": "👿 疲れが溜まると「この集まり、クソつまんねぇ」と心で毒を吐いている。\n\n😤 場の空気が悪くなると「お前のせいだ！」と心で八つ当たり。\n\n🏃 楽しいことで将来の不安から逃げ続ける逃避行動の天才。\n\n💀 本当は寂しがり屋だが、それを認めたら負けだと思っている。",
    "manual": "✅ 【攻略法】一緒にアホみたいに大笑いするのが最強の信頼構築法やで。🤣 「めっちゃ楽しい！」「ごっつ美味い！」のリアクションはMAXでかましとけ。🤝 ノリが合えば一生もんの仲間になれるタイプやねん。💬 深刻な相談は短く明るいトーンでサクッと済ませとき、長々やったらあかんで。ほんまにテンション命やからな、この人。知らんけど。\n\n💣 【地雷ポイント】テンション低い奴は即戦力外通告やで、容赦ないからな。🚫 長い説教とか論外中の論外や、聞く耳持たへんで。💥 「ちゃんと将来考えてんの？」は地雷ど真ん中踏み抜いてるようなもんやで。😵 楽しくない空気はほんまに無理やねん、酸素がなくなる感覚らしいわ。",
    "date": "🎬 【シミュレーション】「行こや！」の一言でフードフェスへ直行するんや、計画とかいらんねん。🍖 食べ歩きしながらハイテンションで盛り上がって、「これめっちゃ美味いやん！」って叫んどけ。🎢 テーマパークのアトラクションに片っ端から乗りまくるんやで。💪 「何する？」より「行こや！」の勢いが大事やねん、考えてる暇あったら動けって話や。📸 インスタ映えは必須条件やで、地味なとこ連れてったら二度目ないわ。知らんけど。\n\n📍 【おすすめスポット】テーマパーク、フードフェス、ライブ、花火大会、スポーツ観戦、BBQ",
    "killer": "💘 「あんたといる瞬間が人生のピークやわ！ 今日が最高すぎて死ねるで！」——💥 大げさなくらいの全力感がごっつ刺さるねん。🎯 冷静な言葉なんか響かへんで、テンションぶち上げて言うたれ。",
    "love": "💑 【付き合うとこうなる】「今が楽しければOK！」精神で突っ走る。\n\n🏃 毎週末どこかに出かけないと死ぬ体質で、インドアデートは拷問レベル。\n\n😆 恋人にもハイテンションを求めるので、テンション低い日は「どうしたの？ 楽しくないの？」の圧が来る。\n\n🤷 ケンカしても5分で忘れるサッパリ系だが、相手が根に持つタイプだと温度差で崩壊する。\n\n🙈 将来の話を振ると急に黙るか話題を変える逃避癖あり。\n\n✨ でも一緒にいる瞬間の全力の楽しさは本物で、「人生で一番笑った恋愛だった」と言われるタイプ。\n\n⚠️ 【恋愛キケン度】★★★★☆\n🎆 ノリと勢いで始まりノリと勢いで終わりがち。\n\n📉 将来設計ゼロだが、「今を全力で楽しむ」相手とは最高のコンビになる。"
  },
  "ESFP": {
    "name": "偽善ウミガメ",
    "emoji": "turtle",
    "tagline": "「いい人」の仮面の下で損得そろばんパチパチ弾いてる",
    "traits": [
      "いい人演技のプロ",
      "逃げ足MAX",
      "面倒=無理",
      "空気読みの天才"
    ],
    "front": "😇 誰にでも優しくて協調性バツグン。\n\n🌟 空気を読む天才で、場の雰囲気を壊さないスキルはピカイチ。\n\n✨ おしゃれで楽しいことが大好き、一緒にいると華やかな気分になれるムードメーカー。",
    "hidden": "👿 裏では「この人と仲良くしておくと得かな」と損得勘定フル稼働中。\n\n🐢 面倒な状況になると海の底に潜るように静かに消える逃避の達人。\n\n🎭 「いい人」の仮面が分厚すぎて本心が見えない。\n\n💀 八方美人が災いして深い関係を築けない。\n\n🃏 空気は読めるが、都合よく読み替える才能もある。",
    "manual": "✅ 【攻略法】相手のペースに合わせつつ、たまに本音引き出すんやで。🫶 「無理せんでええよ」って安心感与えるのがめっちゃ大事やねん。😎 軽くて居心地ええ関係を目指しとき、重いのはあかんで。📸 SNS映えスポットにごっつ弱いからな、そこ狙っていけ。🤝 重い話は避けて軽いノリで楽しむのがコツやで、深刻ぶったらどっか行ってまうからな。知らんけど。\n\n💣 【地雷ポイント】重すぎるアプローチしたら光の速さで逃げられるで。🚫 「本音で話してや」って詰めたら貝みたいに閉じるからやめとき。💨 責任押し付けたら静かに消えるで、ほんまに消えるからな。💥 ネガティブ全開にしたら距離取られて終わりやで。",
    "date": "🎬 【シミュレーション】おしゃれなビーチカフェで待ち合わせするんや、雰囲気から入るのが大事やねん。📸 インスタに上げられる映えスポットを巡って「これめっちゃ映えるやん！」って盛り上がるんやで。🎵 「とりあえず楽しかったらOK！」の空気で軽やかに過ごすのが正解や。🙅 重い話は絶対にしたらあかん、「今この瞬間が楽しい！」を共有するのが全てやねん。ほんまに軽さが命やで。知らんけど。\n\n📍 【おすすめスポット】ビーチカフェ、映えスポット巡り、リゾート施設、ナイトプール、マルシェ",
    "killer": "💘 「あんたの前では仮面外してええんやで。素のままが一番ええんやから。」——💥 「素を出しても大丈夫」っていう安心感が最大の武器やねん。これ言えたらもうこっちのもんやで、ほんまに。",
    "love": "💑 【付き合うとこうなる】最初は「いい人」全開で全力で尽くしてくれる。\n\n🧮 だが慣れてくると「この関係、私にとって得？損？」という損得勘定が静かに起動する。\n\n🏃 面倒な話になると「ちょっとトイレ」と席を立ち、そのままフェードアウトする逃げ足の速さ。\n\n😊 ケンカは絶対にしない——なぜなら面倒だから。\n\n🎭 その場は笑顔で「わかった」と言うが、内心では何も解決していない。\n\n💎 ただし、相手が「無理しなくていいよ」と仮面を外す許可をくれたら、少しずつ本当の自分を見せてくれるようになる。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n🎭 表面的な平和は保てるが、本音が見えない不安がつきまとう。\n\n🤗 「逃げグセ」を責めずに安全地帯を作ってあげるのがコツ。"
  },
  "ENFJ": {
    "name": "ひだまりレトリバー",
    "emoji": "retriever",
    "tagline": "「みんなのために」とか言うて実は依存させるのが快感",
    "traits": [
      "承認欲求の塊",
      "依存させるプロ",
      "用済み=ポイ",
      "自己犠牲風マウント"
    ],
    "front": "😇 「あなたのためを思って」が口癖の世話焼き番長。\n\n🌻 周囲からは「いい人」認定で、困っている人を見ると放っておけない。\n\n🫂 包容力があり、グループの精神的支柱。\n\n😊 いつも笑顔で、一緒にいるとほっとする。",
    "hidden": "👿 実は「私が必要とされない世界」を許せない依存煽り職人。\n\n🎣 相手を世話することで自分の存在意義を確認している。\n\n🪓 用済みになった相手は無表情で切り捨てる残酷さも持ち合わせている。\n\n💀 「嫌われたくない」が全行動の原動力で、自己犠牲に見せかけたマウントが得意技。",
    "manual": "✅ 【攻略法】小さな配慮に気づいて大げさなくらい「ありがとう！」を連発しとけ、これが命綱やねん。📅 記念日は絶対に忘れたらあかんで、忘れた瞬間に闇落ちするからな。📱 こまめな連絡がめっちゃ大事やで、放置したら「嫌われた」って勝手に思い込むタイプやねん。🫶 相手の世話焼きは素直に受け入れつつ、たまに「自分のことも大事にしいや」って言うたれ、泣いて喜ぶから。ほんまに構ってちゃんの極みやけど、愛は本物やで。知らんけど。\n\n💣 【地雷ポイント】LINEの既読無視は宣戦布告と同じやで、マジで。🚫 感謝せーへん人間は「裏切り者」認定されるからな。💥 相手の好意を「別にええよ」って軽くあしらうのは致命傷やで、ほんまにやったらあかん。あの人の「ありがとう」センサーはごっつ精度高いんやから。",
    "date": "🎬 【シミュレーション】「あんたが選んでくれたんや！」感のあるアニマルカフェで待ち合わせするんやで。🧺 ピクニックで手作りのお弁当出てくる可能性大やから、めっちゃ感動しとけ。🌅 帰り道に「今日ほんまに楽しかったわ、ありがとうな」って感謝伝えたら好感度MAXやで。🎁 サプライズ演出にごっつ弱いから、ちょっとした花束とか用意しといたら泣きよるで。ほんまに。知らんけど。\n\n📍 【おすすめスポット】アニマルカフェ、ピクニック、手作り体験教室、映えスポット、季節イベント",
    "killer": "💘 「あんたのおかげでうち救われてるわ。存在がもうパワースポットやねん。」——💥 存在意義を全肯定されたら、もう離れられへんようなるで。ごっつ効くわこれ、ほんまに。",
    "love": "💑 【付き合うとこうなる】恋人に対して「世話焼きの過保護親」と化す。\n\n📱 「ご飯食べた？」「ちゃんと寝てる？」の確認LINEが1日5回。\n\n🎂 記念日は完璧にプロデュースし、相手が感動しないと不機嫌になる。\n\n📊 自分がどれだけ尽くしているかを無意識にカウントしており、相手からの見返りが足りないと「こんなにやってるのに…」と闇落ちする。\n\n😤 別れた後は共通の友人に「私があれだけやったのに」と愚痴るのが恒例。\n\n💎 でも、感謝をちゃんと伝えてくれる相手とは、世界一温かい家庭を築ける。\n\n⚠️ 【恋愛キケン度】★★★★☆\n🔄 尽くしすぎて見返りを求める無限ループに注意。\n\n🙏 「ありがとう」を日常的に伝えれば最強のパートナー。\n\n💕 感謝こそが最大の愛情表現。"
  },
  "ESFJ": {
    "name": "偽善ウミガメ",
    "emoji": "turtle",
    "tagline": "世話焼きながら「感謝しろよ？」と内心キレ散らかしてる",
    "traits": [
      "感謝の強要",
      "噂話=栄養",
      "仲間外れ=致死量",
      "表面だけ優しい"
    ],
    "front": "😇 困ってる人を放っておけない世話焼き体質。\n\n🌐 グループの和を大切にし、みんなが楽しめるよう気を配る潤滑油。\n\n📍 話題の店やイベントに詳しく、「あの人に聞けば間違いない」と頼りにされている。",
    "hidden": "👿 裏では「こんなにやってあげてるのに感謝がない」と常にキレている。\n\n🐢 グループの和を重視する実態は「自分が仲間外れにならないため」の生存戦略。\n\n🗣️ 噂話を栄養にして生きており、自分の噂には異常に敏感。\n\n💀 感謝されないと静かにブチギレる。",
    "manual": "✅ 【攻略法】「ありがとう」を惜しみなく伝えまくれ、これが全ての基本やで。👏 相手の努力を見逃さんと褒めとき、気づいてくれるだけでめっちゃ喜ぶからな。🤝 グループ内での立場守ったれよ、仲間外れにしたら終わりやで。🗺️ 話題のスポットとかみんなに自慢できる場所に誘ったら目輝くで。📱 こまめに情報共有するのも大事やねん、「自分だけ知らん」が一番あかんのや。知らんけど。\n\n💣 【地雷ポイント】悪口言う奴には不信感バリバリやで。🚫 自分だけ知らへん情報があったら不安でたまらんようなるからな。💥 仲間外れは精神崩壊のトリガーやで、ほんまにやったらあかん。🔥 感謝なしで「当たり前やん」扱いは爆発の導火線やからな、それだけは絶対やめとき。",
    "date": "🎬 【シミュレーション】話題のレストランで「ここめっちゃ行きたかってん！」って喜ばせるんやで。☕ カフェ巡りしながら友達に自慢できる写真撮りまくるんや、映えが命やからな。📸 「今日のこと、友達に話してもええ？」って聞かれたらデート大成功やで。🏆 「みんなに自慢できる」体験が大事やねん、地味なデートはあかんで。ほんまにSNS映えと話のネタが全てやわ。知らんけど。\n\n📍 【おすすめスポット】話題のレストラン、カフェ巡り、グルメフェス、マルシェ、季節のイベント",
    "killer": "💘 「あんたがおるだけで場がめっちゃ明るくなるわ。みんなそう思ってるで。」——💥 周囲からの評価を代弁したれや、承認欲求が満たされて一気に心開くからな。ごっつ単純やけど、それがええねん。",
    "love": "💑 【付き合うとこうなる】恋人に対しても「みんなの人気者でいたい」が優先されがち。\n\n📱 デート中でもSNSの通知が気になり、友達からの誘いを断れない八方美人ぶりが炸裂。\n\n🤔 「私とどっちが大事なの？」と聞かれると「どっちも！」と答えるが、実際は空気を読んで都合のいい方を選ぶ。\n\n🗣️ 相手の話より自分の話をしたがり、「今日こんなことがあってさ〜」のマシンガントークが止まらない。\n\n💎 ただし、恋人を友達に紹介する時の「自慢げな顔」は本物の愛情の証。\n\n🏅 あなたを自分の大事な世界の一部として認めた証拠。\n\n⚠️ 【恋愛キケン度】★★★☆☆\n📱 SNS依存と八方美人に振り回される覚悟が必要。\n\n👑 でも「あなたが一番」と特別扱いしてくれた瞬間の幸福感は最強。"
  }
}
