{
  "INTJ": {
    "name": "夜景の黒猫",
    "emoji": "cat",
    "tagline": "クールぶってるが、脳内は「俺様が一番正しい」の特権意識モンスター",
    "traits": ["選民意識の塊", "他人の成功に毒づく", "完璧主義の皮を被った臆病者", "孤高気取りの寂しがり屋"],
    "front": "表向きは冷静で知的なオーラをまとった「できる人」。余計なことは言わず、的確なアドバイスで周囲から一目置かれている。感情に流されず、常にロジカルに物事を判断するクールな存在。趣味や仕事に対してストイックで、「あの人は別格」と思われている。",
    "hidden": "その仮面の裏には「自分以外全員バカ」という壮大な勘違いが潜んでいる。他人の成功を見ると「運が良かっただけ」と陰で毒づき、自分の失敗は「周りのレベルが低いせい」と責任転嫁。承認欲求が異常に高いくせに、自分からは絶対にそれを見せない。孤高を気取っているが、実は「誰か俺の凄さに気づいてくれ」と心の中で叫んでいる。",
    "manual": "【攻略法】議論では絶対に感情論で攻めるな。「なるほど、その視点はなかった」と一旦受け止めてから反論すれば、こちらの話も聞く姿勢になる。知性を認める一言を最初に添えるのが鉄則。相手の専門分野をリサーチしておくと尊敬ポイントが爆上がりする。\n\n【地雷ポイント】頭ごなしに否定すると一生口を利かなくなる。「みんなそう言ってるよ」という同調圧力は最大の侮辱。感情的に泣いたり怒ったりすると「この人レベル低い」と判定されて終了。",
    "date": "【シミュレーション】隠れ家的なブックカフェで待ち合わせ → 美術館の特別展でお互い無言で鑑賞 → 静かなバーで「あの作品の解釈さ…」と議論開始。ここで知的な会話ができれば内心ニヤニヤが止まらない。間違っても騒がしい居酒屋やカラオケに連れて行ってはいけない。\n\n【おすすめスポット】美術館・博物館の企画展、隠れ家バー、天体観測スポット、古書店巡り",
    "killer": "「〇〇の独自理論、誰にも真似できないよね。天才じゃない？」——この一言で承認欲求のダムが決壊する。知性を褒められることに飢えているので、ピンポイントで刺せ。"
  },
  "INFJ": {
    "name": "高嶺の花子さん",
    "emoji": "flower",
    "tagline": "「私を理解できる人なんていない」と自分に酔ってる孤高の理想主義者",
    "traits": ["理想が高すぎて誰も届かない", "自己犠牲に酔いがち", "表面温厚・内面ドロドロ", "被害者意識の達人"],
    "front": "穏やかで優しく、困っている人を放っておけない理想主義者。聞き上手で、相手の気持ちを深く理解してくれる「心の拠り所」的存在。グループでは控えめだが、いざという時に核心を突く発言をして皆を驚かせる。",
    "hidden": "内心では「こんなに深い私を理解できる人はいない」と常にどこか上から目線。人間関係に深入りしすぎて、勝手に期待して勝手に失望する無限ループの住人。自分の世界観に合わない人間は静かに切り捨てる冷酷さを持ち、裏切られたと感じると一生許さない執念深さがある。自己犠牲に酔っている自分に気づいていない。",
    "manual": "【攻略法】表面的な会話は逆効果。「最近どう？」より「あの件どう思った？」と深い話題を振ると心が開く。二人きりの方が本音を話すので、大人数の場では距離が縮まらない。「あなたの考え、深いね」と本気で共感すれば信頼を得られる。\n\n【地雷ポイント】嘘の共感は即バレする。裏切りは絶対にNG、一度信頼を失うと二度と戻らない。大人数の飲み会に無理やり誘うのは魂が抜ける行為。「考えすぎだよ」は最悪の一言。",
    "date": "【シミュレーション】雰囲気のいいプラネタリウムで待ち合わせ → 静かな湖畔のレストランで人生観について語り合う → 帰り道に「今日、特別だった」と伝えれば心の扉が全開に。事前に相手の好みをリサーチしている「計画的サプライズ」が最強。\n\n【おすすめスポット】プラネタリウム、静かな水辺のレストラン、個室のある隠れ家カフェ、小さな映画館のレイトショー",
    "killer": "「〇〇みたいに、本質を見抜ける人は初めて。もっとその世界を知りたい。」——「唯一の理解者」ポジションを取れれば圧勝。"
  },
  "INTP": {
    "name": "無愛想なロボ",
    "emoji": "robot",
    "tagline": "感情をエラーとして処理する天然マウントマシン",
    "traits": ["感情よりロジック優先", "空気が読めない天才", "屁理屈の申し子", "興味ないことは完全無視"],
    "front": "物静かで知的なオーラを漂わせるインテリタイプ。専門分野の知識は圧倒的で、聞けば何でも論理的に説明してくれる頼れる存在。感情に左右されない冷静さがあり、トラブル時にも動じない安定感がある。",
    "hidden": "他人の感情は「処理不能なバグ」として脳内で弾かれている。悪気はないが「それ、論理的におかしくない？」が口癖で、周囲を地味に傷つけ続けている自覚がゼロ。興味があることには異常な集中力を見せるが、興味がないことは存在しないかのように無視。「正しければ何を言ってもいい」と本気で思っている。",
    "manual": "【攻略法】「これってなんで？」と知的好奇心を刺激する質問で距離を縮めるのが正解。議論を楽しめる相手だと認識されれば勝ち。返信が遅いのは嫌いだからじゃなく「返す必要を感じてない」だけなので催促は逆効果。\n\n【地雷ポイント】感情論で攻めると即シャットダウン。「空気読んでよ」は処理不能エラーを起こす禁句。催促LINEを3連投すると「面倒な人」フォルダに永久追放される。",
    "date": "【シミュレーション】科学館かボードゲームカフェで待ち合わせ → 一緒に何かの仕組みを考える体験型イベント → 「あの理論って実は…」と議論が盛り上がったら大成功。しっとりしたデートは相手がバグる。会話より「一緒に考える」体験が大事。\n\n【おすすめスポット】科学館、ボードゲームカフェ、VR体験施設、プログラミングワークショップ、謎解きイベント",
    "killer": "「〇〇の頭の中、覗いてみたい。その思考回路、めちゃくちゃ面白い。」——知性への好奇心を見せるのが最短ルート。"
  },
  "ISTP": {
    "name": "偏屈狼",
    "emoji": "wolf",
    "tagline": "無愛想をクールで片付けてるコミュ障、論破マウントが快感",
    "traits": ["コミュ障をクールと勘違い", "論破マウント中毒", "束縛されたら死ぬ", "不器用な愛情表現"],
    "front": "寡黙で頼りがいのある実力派。口数は少ないが、やることはきっちりやるタイプ。手先が器用で、趣味や仕事に対する集中力は凄まじい。余計なことを言わない「大人の男/女」という印象。",
    "hidden": "クールを気取っているが、実態はただのコミュニケーション不全。マニアックな知識で他人を論破してマウントを取るのが密かな快感。好きな人の前だと更にコミュ障が加速して、結果「嫌ってるの？」と誤解される不器用さ。束縛されると本気で消える。",
    "manual": "【攻略法】一人時間を絶対に邪魔しない。「放っておいてくれる人」が一番仲良くなれる。共通の趣味を見つけて「並んで同じことをする」時間を重視すれば勝手に心を開く。LINEの返信が遅くても絶対に責めるな。\n\n【地雷ポイント】「何考えてるの？」の詰問は逃走トリガー。過度なスキンシップや感情の押し付けは致命傷。予定をギチギチに詰め込むと窒息する。",
    "date": "【シミュレーション】ホームセンターかガジェット店で待ち合わせ → 工作ワークショップで一緒に何かを作る → 完成品を見て「やるじゃん」と短くお互いを認め合う。これが最高のデート。会話より「並んで同じことをする」時間が至福。\n\n【おすすめスポット】DIYワークショップ、ガジェットショップ巡り、ドライブ（行き先は適当でOK）、釣り、アウトドア",
    "killer": "「〇〇の専門的な話、もっと聞かせて。マジでハマるわ。」——自分の得意分野に興味を持ってくれる人に弱すぎる。これだけで心の扉が開く。"
  },
  "ENTJ": {
    "name": "やかまし上司",
    "emoji": "bigmom",
    "tagline": "「俺に従えば全員幸せ」と本気で信じてる支配欲の帝王",
    "traits": ["支配欲MAX", "有能だが独裁的", "弱みを見せたら負け", "意外と面倒見がいい"],
    "front": "生まれながらのリーダー気質。決断力があり、グループを引っ張る頼もしい存在。仕事もプライベートも常に全力で、その行動力に周囲は圧倒される。困った時に相談すれば、必ず具体的な解決策を出してくれる。",
    "hidden": "リーダーシップと独裁の区別がついていない。「俺に従えば全員幸せになれる」と本気で信じており、反論されると「こいつ無能だな」と内心で見下す。完璧じゃない自分を絶対に見せたくないので、疲れても弱音を吐けない。実は仲間の成長を誰よりも喜ぶツンデレ支配者。",
    "manual": "【攻略法】自分の意見をしっかり述べつつ、最終判断は相手に委ねるのが黄金パターン。「対等に議論できる相手」として認められれば一目置かれる。弱音を吐いた瞬間は絶対に茶化すな。たまに「頑張りすぎだよ」と言ってあげると内心泣いてる。\n\n【地雷ポイント】イエスマンになると見下される。優柔不断な態度は「無能認定」のフラグ。公の場で恥をかかせたら二度と許されない。",
    "date": "【シミュレーション】予約困難な名店に堂々と入店 → 「ここ、俺/私のおすすめ」とドヤ顔で案内 → 食後は夜景の見えるバーで将来の野望を語り出す。相手のビジョンに共感しつつ、自分の意見も述べられたら好感度MAX。安っぽい場所は二度目がない。\n\n【おすすめスポット】予約困難な名店、ルーフトップバー、高級ホテルのラウンジ、スポーツ観戦のVIP席",
    "killer": "「〇〇についていきたい。でもたまには弱いとこ見せてよ。」——支配者の仮面を外す許可証。この一言で心が崩れる。"
  },
  "ESTJ": {
    "name": "爆走ライオン",
    "emoji": "lion",
    "tagline": "完璧主義の仮面の下で「誰も私を助けてくれない」と被害妄想中",
    "traits": ["支配欲の権化", "他人disが趣味", "弱み見せたら死ぬ病", "隠れ甘えん坊"],
    "front": "責任感が強く、約束は絶対に守る信頼の塊。有言実行で頼りがいがあり、グループでは自然とまとめ役を買って出る。仕事も遊びも全力で、「この人に任せれば大丈夫」と思われている。",
    "hidden": "他人のミスを心の中で「この下手くそが！」とdisるのが実は快感。完璧主義の鎧を脱げない不器用さが最大の弱点で、「誰も私を助けてくれない」と被害妄想に陥りがち。本当は甘えたいけど甘え方がわからない不器用な王様。",
    "manual": "【攻略法】時間厳守・約束厳守が信頼構築の絶対条件。基本は尊重しつつ、たまに「今日は私が全部仕切るね」と甘えさせてあげる。「頑張らなくていいよ」の一言で涙腺が崩壊する。\n\n【地雷ポイント】ドタキャンは死罪。遅刻は信頼崩壊の始まり。「適当でいいじゃん」は全存在を否定する言葉。",
    "date": "【シミュレーション】予約してある高級焼肉店にきっちり5分前到着 → 「ここのタン塩は最高」と仕切り始める → 食後は「次の計画も立てとくね」と言えば内心キュンキュン。予定通りに進むデートが安心する。サプライズは嬉しいより「聞いてないけど？」が先に来る。\n\n【おすすめスポット】予約済みの名店、ゴルフ、スポーツ観戦、達成感のあるアクティビティ",
    "killer": "「いつも完璧だけど、私の前ではただのダメ人間でいいんだよ？」——鎧を脱がせる一言。これを言えるのはあなただけ、という特別感が致命傷になる。"
  },
  "ENTP": {
    "name": "ナルシスト拡声器",
    "emoji": "parrot",
    "tagline": "論破が趣味の知的マウントモンスター、でも飽きたら即撤退",
    "traits": ["論破中毒", "飽き性の極み", "口だけ番長", "刺激がないと死ぬ"],
    "front": "話題が豊富で、どんな場でも会話を盛り上げるエンターテイナー。アイデアマンで、新しい企画や提案を次々と生み出す。知識の幅が広く、「この人と話すと面白い」と思われる人気者。",
    "hidden": "議論の目的は「正しさの追求」ではなく「相手を論破する快感」。新しいアイデアを次々生み出すが、実行する前に飽きて次へ。口は達者だが行動が伴わない知的口だけ番長。自分が一番面白いと本気で思っている。表面的な知り合いは多いが本当の友達は少ない。",
    "manual": "【攻略法】「それは違うと思う。なぜなら…」と冷静に反論できる人に一目置く。知的なツッコミが一番距離を縮める。退屈が最大の敵なので、予定通りの付き合いより突発的なイベントが◎。\n\n【地雷ポイント】「すごいね」と褒めるだけの人は舐められる。感情的に怒ると「つまらない」判定されて終了。同じ話題を繰り返すと飽きて消える。",
    "date": "【シミュレーション】「面白い店見つけた、今から行かない？」と突発的に誘うのが正解 → 謎解きカフェや脱出ゲームで知的バトル → 「次は〇〇やってみない？」と次の刺激を提案し合う。予定通りのデートは退屈で死ぬので、ハプニングを歓迎する姿勢が大事。\n\n【おすすめスポット】脱出ゲーム、謎解きカフェ、お笑いライブ、トークイベント、新オープンの話題の店",
    "killer": "「〇〇の発想力、マジで化け物。一緒にいると脳がバグる。」——知的に認められたい欲求を直撃。退屈させない相手だと思わせたら勝ち。"
  },
  "ENFP": {
    "name": "路地裏チワワ",
    "emoji": "dog",
    "tagline": "明るいふりして、一人になると盛大に拗ねる構ってちゃんモンスター",
    "traits": ["笑顔の裏の闇", "構ってちゃん攻撃", "飽き性の権化", "感情のジェットコースター"],
    "front": "どこにいても場を明るくするムードメーカー。好奇心旺盛で新しいことが大好き、一緒にいると楽しいことが次々起こる。人懐っこくて誰とでもすぐ仲良くなれる、グループのアイドル的存在。",
    "hidden": "一人になった途端「誰も本当の自分を理解してない」と盛大に病む。寂しさから相手を試す「構ってちゃん攻撃」を仕掛けるくせに、飽きっぽいので自分から離れることも多い。捨てられるのは死ぬほど怖いのに、自分は平気で新しい人間関係に飛びつく矛盾の塊。",
    "manual": "【攻略法】突飛なアイデアを「それめっちゃいいじゃん！」と全力で全肯定。テンション高めのリアクションが命綱。「試し行動」にはムキにならず「ちゃんとここにいるよ」と安心させるのが正解。常に新しい話題を用意しとけ。\n\n【地雷ポイント】否定した瞬間、心のシャッターが音を立てて閉まる。既読無視は存在否定と同義。「落ち着いて」は火に油。長時間の無関心は致命傷。",
    "date": "【シミュレーション】新オープンのインスタ映えスポットへ直行 → 「次どこ行く？」のノープラン感を演出 → 突然「あそこ行ってみたい！」に全力で付き合う。予定はガチガチに決めず、ワクワク感を演出するのがコツ。マンネリは死。\n\n【おすすめスポット】新オープン施設、フォトジェニックカフェ、フリマ・マルシェ、花畑、イルミネーション",
    "killer": "「〇〇といると毎日が冒険！ 世界が派手に輝いて見えるよ」——特別感と冒険心をくすぐれば、尻尾を振って寄ってくる。"
  },
  "ISTJ": {
    "name": "鉄壁の金庫",
    "emoji": "vault",
    "tagline": "感情にロックをかけた、ルール絶対主義の石頭",
    "traits": ["ルールが命", "変化が怖い", "感情表現が化石", "裏では意外と心配性"],
    "front": "ルールと秩序を重んじる、信頼と安定の象徴。決められたことを完璧にこなし、約束は絶対に守る。口数は少ないが、やるべきことは黙々とやる堅実な人柄。「この人に任せれば間違いない」と思われている。",
    "hidden": "変化を極度に恐れ、新しいことに挑戦する前に10個くらいリスクを並べる。感情表現がほぼゼロなので、好意を持っていても相手に一切伝わらない。ルールを破る人間を心の底から軽蔑している。でも内心では「嫌われてないかな…」と常に心配している。",
    "manual": "【攻略法】時間厳守、マナー完璧、「当たり前のことを当たり前にやる」が最大の好感度UP。事前に予定を共有しておくと安心する。急な変更は理由をきちんと説明すれば受け入れてくれる。安定感と誠実さで勝負。\n\n【地雷ポイント】約束を破ったら信頼回復に1年かかる。サプライズは心臓に悪いのでNG。「ノリで決めようぜ」は恐怖の言葉。ルール無視は人格否定レベル。",
    "date": "【シミュレーション】事前に「何時にどこで何をする」を共有 → きっちり時間通りに老舗の和食で落ち合う → 食後は水族館を予定通り回り「次は〇〇が見たい」と素直に言えたらこっちの勝ち。予定通りに進む安心感が最大の幸福。\n\n【おすすめスポット】老舗和食店、水族館、博物館、温泉旅館（予約済み）、定番の名所",
    "killer": "「〇〇の堅実さ、本当に安心する。ずっと隣にいたい。」——「信頼されている」と実感できる言葉が一番効く。派手な言葉より日常の積み重ね。"
  },
  "ISFJ": {
    "name": "戦略ペンギン",
    "emoji": "penguin",
    "tagline": "真面目な顔して「ルール守れないヤツ全員消えろ」と呪ってる",
    "traits": ["ルール至上主義", "むっつり", "感情表現バグ", "裏オタク気質"],
    "front": "几帳面で真面目、信頼の塊。頼まれたことは完璧にこなし、陰ながら周囲をサポートする縁の下の力持ち。控えめだけど芯が強く、困った時に静かに助けてくれる安心感のある存在。",
    "hidden": "内心では「ルールを守れないヤツ、全員いなくなればいいのに」と呪っている。表面はポーカーフェイスだが、裏ではかなりの妄想家。感情表現がバグっているので、嬉しくても無表情。自分の趣味を一人でこっそり楽しむむっつり派。",
    "manual": "【攻略法】マナーと礼儀を徹底。靴を揃えるレベルの「当たり前」で信頼を得る。相手の好みを事前にリサーチして「予約しておいたよ」と伝えるのが最強の距離の縮め方。約束を守ることが最大の信頼構築法。\n\n【地雷ポイント】遅刻は死罪。ドタキャンしたら二度と会えないと思え。マナー違反は内心の軽蔑メーターが振り切れる。「適当でいいよ」は信じない。",
    "date": "【シミュレーション】「予約してあるから」の一言が最強の媚薬 → スケジュール通りに水族館を回る → 「次は〇〇に行きたいな」と控えめに提案してくれたら脈あり。定番デートスポットの方がハズレがなくて安心する。奇をてらうのは逆効果。\n\n【おすすめスポット】水族館、動物園、予約済みのレストラン、季節の花が見れる公園、カフェ巡り",
    "killer": "「〇〇のその几帳面さ、正直ガチで尊敬する。真似したい。」——真面目さを評価してくれる人が圧倒的に少ないので、この一言は心に深く刺さる。"
  },
  "ISFP": {
    "name": "雨宿りうさぎ",
    "emoji": "rabbit",
    "tagline": "穏やかな表情の裏で「この世界は私には眩しすぎる」と嘆いてる",
    "traits": ["繊細すぎる感受性", "自分の世界に引きこもる", "芸術肌の変わり者", "怒ると突然キレる"],
    "front": "穏やかで優しいオーラを漂わせる癒し系。芸術的なセンスが光り、ファッションや音楽の趣味がおしゃれ。争いを嫌い、誰に対しても柔らかい態度で接する。そっと寄り添ってくれる存在。",
    "hidden": "内面は過敏なセンサーだらけ。些細な言葉で深く傷つき、一人の世界に引きこもって回復する。穏やかに見えるが、怒りの沸点を超えると過去の全てを引っ張り出してキレる。感受性が豊かすぎて疲れやすく、「この世界は私には眩しすぎる」と嘆いている。",
    "manual": "【攻略法】無理に聞き出そうとせず、相手のペースにひたすら寄り添う。「わかるよ」の共感ワードを散りばめろ。静かなカフェや美術館など感性を刺激する場所で一緒に過ごすと自然と心を開く。\n\n【地雷ポイント】作品や価値観を否定した瞬間、永遠にブラックリスト入り。「気にしすぎだよ」は傷口に塩。騒がしい場所に連れて行くと魂が抜ける。正論パンチは心を折る。",
    "date": "【シミュレーション】おしゃれなセレクトショップで偶然を装って合流 → 美術館を「あの色使い好き」「わかる」と共感しながら巡る → 静かなカフェで深い話を始めたら大成功。「あなたと見たい世界がある」的な誘い方が刺さる。\n\n【おすすめスポット】美術館、セレクトショップ巡り、静かなカフェ、花畑、夕焼けが綺麗なスポット",
    "killer": "「言葉にしなくても、〇〇の内面の深さ、私には伝わってくるよ。」——「理解されている」感覚に飢えているので、この一言で完全に心を開く。"
  },
  "INFP": {
    "name": "優しさ過剰装備",
    "emoji": "tofu",
    "tagline": "脳内ポエムが止まらない、被害妄想と理想主義のカオス",
    "traits": ["脳内ポエマー", "被害妄想の達人", "理想と現実のギャップで自爆", "怒ると陰湿"],
    "front": "誰に対しても優しく、相手の気持ちに寄り添える共感力の持ち主。独自の世界観を持ち、創作や音楽、文学に造詣が深い。控えめだけど芯があり、大切なことには静かに声を上げる。",
    "hidden": "メンタルが豆腐並みに柔らかく、ちょっとした批判で3日寝込む。理想が高すぎて現実に常にガッカリしている。「あの人、私のこと嫌いに違いない」と勝手に確信する被害妄想の達人。優しさは本物だが過剰すぎて自分が潰れる。キレたら過去の罪状を全部引っ張り出す陰湿さも持つ。",
    "manual": "【攻略法】相手の夢や理想を全肯定。「その世界観、好きだよ」の一言が最強。焦らず時間をかけて距離を縮める。世界観の強い映画や音楽を共有すると一気に仲良くなれる。「あなたの感性は特別」と繰り返し伝えることで信頼を獲得。\n\n【地雷ポイント】否定は絶対にNG。現実的すぎるツッコミは毒薬。「考えすぎだよ」は全否定と同義。長期間の無視は被害妄想を加速させる。",
    "date": "【シミュレーション】世界観の強い映画を一緒に鑑賞 → 上映後に「あのシーンの意味、どう思った？」と感想を共有 → おしゃれな古本屋やレトロ喫茶で余韻に浸る。感動を共有できる体験型が◎。ファミレスなど現実感が強すぎる場所はテンションが落ちる。\n\n【おすすめスポット】ミニシアター、古本屋、レトロ喫茶、ミュージカル、世界観のある展覧会",
    "killer": "「〇〇の見てる世界、私にも見せてほしい。一緒にいたい。」——ポエティックに攻めるのが正解。現実的な言葉より、感性に響く表現を。"
  },
  "ESTP": {
    "name": "お祭りパンダ",
    "emoji": "panda",
    "tagline": "脳天気に見えて「この集まりクソつまんねぇ」と心で毒吐いてる",
    "traits": ["ムードメーカー仮面", "心の八つ当たり常習犯", "寂しがり屋の脳天気", "逃避行動の天才"],
    "front": "どんな場でもムードメーカーを買って出る陽キャの鑑。ノリが良く、一緒にいると楽しいことしか起こらない。行動力抜群で、「とりあえずやってみよう！」と周囲を巻き込む太陽のような存在。",
    "hidden": "疲れが溜まると「この集まり、クソつまんねぇ」と心で毒を吐いている。場の空気が悪くなると「お前のせいだ！」と心で八つ当たり。楽しいことで将来の不安から逃げ続ける逃避行動の天才。本当は寂しがり屋だが、それを認めたら負けだと思っている。",
    "manual": "【攻略法】一緒にバカみたいに大笑いするのが最強の信頼構築法。「楽しい！」「美味しい！」のリアクションはMAXで。ノリが合えば一生の仲間になれる。深刻な相談は短く・明るいトーンで。\n\n【地雷ポイント】テンション低い人は即戦力外通告。長い説教は論外。「ちゃんと将来考えてる？」は地雷ど真ん中。楽しくない空気は本気で無理。",
    "date": "【シミュレーション】「行こう！」の一言でフードフェスへ直行 → 食べ歩きしながらハイテンションで盛り上がる → テーマパークのアトラクションに片っ端から乗る。「何する？」より「行こう！」の勢いが大事。インスタ映えは必須条件。\n\n【おすすめスポット】テーマパーク、フードフェス、ライブ、花火大会、スポーツ観戦、BBQ",
    "killer": "「〇〇といる瞬間が人生のピーク！ 今日が最高すぎて死ねる！」——大げさなくらいの全力感が一番刺さる。冷静な言葉は響かない。"
  },
  "ESFP": {
    "name": "偽善ウミガメ",
    "emoji": "turtle",
    "tagline": "「いい人」仮面の下で損得勘定フル稼働、逃げ足だけは超一流",
    "traits": ["いい人を演じるプロ", "逃げ足MAX", "面倒くさがり屋", "空気を読む天才"],
    "front": "誰にでも優しくて協調性バツグン。空気を読む天才で、場の雰囲気を壊さないスキルはピカイチ。おしゃれで楽しいことが大好き、一緒にいると華やかな気分になれるムードメーカー。",
    "hidden": "裏では「この人と仲良くしておくと得かな」と損得勘定フル稼働中。面倒な状況になると海の底に潜るように静かに消える逃避の達人。「いい人」の仮面が分厚すぎて本心が見えない。八方美人が災いして深い関係を築けない。空気は読めるが、都合よく読み替える才能もある。",
    "manual": "【攻略法】相手のペースに合わせつつ、たまに本音を引き出す。「無理しなくていいよ」と安心感を与えるのが◎。軽くて居心地のいい関係を目指せ。SNS映えスポットに弱い。重い話は避けて、軽いノリで楽しむのがコツ。\n\n【地雷ポイント】重すぎるアプローチは逃げられる。「本音で話してよ」と詰めると貝になる。責任を押し付けると静かに消える。ネガティブ全開は距離を取られる。",
    "date": "【シミュレーション】おしゃれなビーチカフェで待ち合わせ → インスタに上げられる映えスポットを巡る → 「とりあえず楽しければOK！」の空気で軽やかに過ごす。重い話は絶対に避けて、「今この瞬間が楽しい！」を共有するのが大事。\n\n【おすすめスポット】ビーチカフェ、映えスポット巡り、リゾート施設、ナイトプール、マルシェ",
    "killer": "「〇〇の前では仮面外していいよ。素のままが一番いいから。」——「素を出しても大丈夫」という安心感が最大の武器。"
  },
  "ENFJ": {
    "name": "ひだまりレトリバー",
    "emoji": "retriever",
    "tagline": "「みんなのために」が口癖だが、実は依存煽り職人",
    "traits": ["承認欲求の化身", "依存させるプロ", "切り捨て上手", "自己犠牲風マウント"],
    "front": "「あなたのためを思って」が口癖の世話焼き番長。周囲からは「いい人」認定で、困っている人を見ると放っておけない。包容力があり、グループの精神的支柱。いつも笑顔で、一緒にいるとほっとする。",
    "hidden": "実は「私が必要とされない世界」を許せない依存煽り職人。相手を世話することで自分の存在意義を確認している。用済みになった相手は無表情で切り捨てる残酷さも持ち合わせている。「嫌われたくない」が全行動の原動力で、自己犠牲に見せかけたマウントが得意技。",
    "manual": "【攻略法】小さな配慮に気づき、大げさなくらい「ありがとう！」を連発。記念日は絶対に忘れるな。こまめな連絡が命綱。相手の世話焼きを素直に受け入れつつ、たまに「自分も大事にしてね」と言ってあげると泣いて喜ぶ。\n\n【地雷ポイント】LINEの既読無視は宣戦布告と同義。感謝しない人間は「裏切り者」認定。相手の好意を「別にいいよ」と軽くあしらうのは致命傷。",
    "date": "【シミュレーション】「あなたが選んでくれたんだ！」感のあるアニマルカフェで待ち合わせ → ピクニックで手作りのお弁当（相手が作ってくれる可能性大） → 帰り道に「今日楽しかった、ありがとう」と感謝を伝えれば好感度MAX。サプライズ演出にめちゃくちゃ弱い。\n\n【おすすめスポット】アニマルカフェ、ピクニック、手作り体験教室、映えスポット、季節イベント",
    "killer": "「〇〇のおかげで私は救われてる。存在がもう、パワースポット。」——存在意義を全肯定されると、もう離れられなくなる。"
  },
  "ESFJ": {
    "name": "偽善ウミガメ",
    "emoji": "turtle",
    "tagline": "笑顔で世話を焼きつつ「感謝されて当然でしょ」と内心キレてる",
    "traits": ["感謝を要求する世話焼き", "噂話が栄養", "仲間外れが致死量", "表面だけの優しさ"],
    "front": "困ってる人を放っておけない世話焼き体質。グループの和を大切にし、みんなが楽しめるよう気を配る潤滑油。話題の店やイベントに詳しく、「あの人に聞けば間違いない」と頼りにされている。",
    "hidden": "裏では「こんなにやってあげてるのに感謝がない」と常にキレている。グループの和を重視する実態は「自分が仲間外れにならないため」の生存戦略。噂話を栄養にして生きており、自分の噂には異常に敏感。感謝されないと静かにブチギレる。",
    "manual": "【攻略法】「ありがとう」を惜しみなく伝える。相手の努力を見逃さず褒める。グループ内での立場を守ってあげると好感度MAX。話題のスポットやみんなに自慢できる場所に誘うと喜ぶ。こまめに情報共有を。\n\n【地雷ポイント】悪口を言う相手には不信感を抱く。自分だけ知らない情報があると不安になる。仲間外れは精神崩壊のトリガー。感謝なしで「当たり前」扱いは爆発の導火線。",
    "date": "【シミュレーション】話題のレストランで「ここ行ってみたかった！」と喜ばせる → カフェ巡りしながら友達に自慢できる写真を撮る → 「今日のこと、友達に話してもいい？」と聞かれたらデート成功。「みんなに自慢できる」体験が大事。\n\n【おすすめスポット】話題のレストラン、カフェ巡り、グルメフェス、マルシェ、季節のイベント",
    "killer": "「〇〇がいるだけで場が明るくなる。みんなそう思ってるよ。」——周囲からの評価を代弁してあげると、承認欲求が満たされて一気に心を開く。"
  }
}
